doc/reference.org
#+TITLE:     Blue Mountain Reference 
#+AUTHOR:    Cliff Wulfman
#+EMAIL:     cwulfman@Princeton.EDU
#+DATE:      2013-01-22 Tue
#+DESCRIPTION:
#+KEYWORDS:
#+LANGUAGE:  en
#+OPTIONS:   H:6 num:t toc:t \n:nil @:t ::t |:t ^:nil -:t f:t *:t <:t
#+OPTIONS:   TeX:t LaTeX:t skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+INFOJS_OPT: view:nil toc:nil ltoc:t mouse:underline buttons:0 path:http://orgmode.org/org-info.js
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+LINK_UP:   
#+LINK_HOME: 
#+XSLT:

* Identifiers and Naming Conventions
  Blue Mountain assigns a URI to each magazine, magazine issue,
  METS, and MODS record it maintains:

  #+BEGIN_EXAMPLE
  <BMTNPREFIX> ::= "urn:PUL:bluemountain"
  <DATESTRING> ::= CCYY-MM-DD | CCYY-MM | CCYY
  <ISSUEINDEX> ::= <0-9><0-9>
  <BMTNID>     ::= "bmtn" <a-z><a-z><a-z>
  <ISSUID>     ::= <BMTNID> "_" <DATESTRING> "_" <ISSUEINDEX>

  <TITLEURI>    ::= <BMTNPREFIX> ":" <BMTNID>
  <ISSUEURI>    ::= <BMTNPREFIX> ":" <ISSUEID>

  
  <TITLEMETSURI> ::= <BMTNPREFIX> ":td:" <BMTNID>
  <ISSUEMETSURI> ::= <BMTNPREFIX> ":td:" <ISSUEID>

  <TITLEMODSURI> ::= <BMTNPREFIX> ":dmd:" <BMTNID>
  <ISSUEMODSURI> ::= <BMTNPREFIX> ":dmd:" <ISSUEID>
  #+END_EXAMPLE
  
  This syntax is explained below.

** Blue Mountain Identifiers (bmtnids)
  Blue Mountain is a /database/ of magazines: that is, it is a
  system that links information together.  In order to link
  information about specific objects -- magazine titles, magazine
  issues, ec. -- Blue Mountain must assign a /unique identifier/ to
  each object.  (This is a well-known feature of information
  science.).

  Blue Mountain adopts the Universal Resource Name conventions (URN)
  to compose unique identifiers for /titles/ and /issues/, as well
  as for the metadata records (METS and MODS) used to encode
  information about them. 

   A /Journal Title/ is the journal or magazine as a whole, as
   opposed to discrete volumes or issues -- the entire run of the
   magazine.  Blue Mountain assigns a sequential /blue mountain
   identifier/, or /bmtnid/ to each title.  The bmtnid will take the
   form /bmtnNNN/, where NNN is a hexavigesimal number (e.g., /aaa/,
   /aab/, /aac/, etc.).[fn:1] Blue Mountain will maintain bmtnids in a
   /project registry/, a file maintained with other administrative
   files.

** Issuance Strings
   Each journal /issue/ will be assigned an /issue identifier/ or
   /issueid/ of the form /bmtnid_issuanceString/, where /issuanceString/
   corresponds to the date of issuance and takes the form
   /CCYY-MM-DD_II/, defined as follows:

   - CCYY :: A four-digit number representing the year of publication (e.g., 1912)
   - MM   :: A two-digit number representing the month of publication,
	     where January = 01, February = 02, etc.
   - DD   :: A two-digit number representing the day of publication
	     (e.g., 01, 02 .. 30, 31).
   - II   :: A two-digit index of daily issuance (e.g., the first
	     issue of the day is 01, the second is 02, and so on).
	     This convention is adopted from the issuance of
	     newspapers, which not infrequently issued a morning
	     edition and an evening edition on the same day.  Blue
	     Mountain's adoption allows us to distinguish among
	     magazine texts that were published on the same day: a
	     regular issue and a supplement, for example.

