doc/reference.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Blue Mountain Reference </title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="Blue Mountain Reference "/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-01-22 Tue"/>
<meta name="author" content="Cliff Wulfman"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Blue Mountain Reference </h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Identifiers and Naming Conventions</a>
<ul>
<li><a href="#sec-1-1">1.1 Blue Mountain Identifiers (bmtnids)</a></li>
<li><a href="#sec-1-2">1.2 Issuance Strings</a>
<ul>
<li><a href="#sec-1-2-1">1.2.1 How to Compose an Issuance String</a>
<ul>
<li><a href="#sec-1-2-1-1">1.2.1.1 A Real Example</a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-1-3">1.3 File Names</a>
<ul>
<li><a href="#sec-1-3-1">1.3.1 Image File Names</a></li>
<li><a href="#sec-1-3-2">1.3.2 ALTO File Names</a></li>
<li><a href="#sec-1-3-3">1.3.3 METS File Names</a></li>
<li><a href="#sec-1-3-4">1.3.4 PDF File Names</a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-2">2 Journal Objects</a></li>
<li><a href="#sec-3">3 Arrangement (Blue Mountain Directory Structure)</a>
<ul>
<li><a href="#sec-3-1">3.1 The Metadata Store</a></li>
<li><a href="#sec-3-2">3.2 The Preservation Store</a></li>
<li><a href="#sec-3-3">3.3 The Access Store</a></li>
</ul>
</li>
<li><a href="#sec-4">4 Profiles</a>
<ul>
<li><a href="#sec-4-1">4.1 METS Profile</a>
<ul>
<li><a href="#sec-4-1-1">4.1.1 Title-Level METS</a></li>
<li><a href="#sec-4-1-2">4.1.2 Issue-Level METS</a>
<ul>
<li><a href="#sec-4-1-2-1">4.1.2.1 &lt;metsHdr&gt;</a>
<ul>
<li><a href="#sec-4-1-2-1-1">4.1.2.1.1 &lt;agent&gt;</a></li>
<li><a href="#sec-4-1-2-1-2">4.1.2.1.2 &lt;metsDocumentID TYPE="URN"&gt;</a></li>
</ul>
</li>
<li><a href="#sec-4-1-2-2">4.1.2.2 &lt;dmdSec&gt;</a></li>
<li><a href="#sec-4-1-2-3">4.1.2.3 &lt;amdSec&gt;</a></li>
<li><a href="#sec-4-1-2-4">4.1.2.4 &lt;fileSec&gt;</a>
<ul>
<li><a href="#sec-4-1-2-4-1">4.1.2.4.1 &lt;fileGrp ID="IMGGRP" USE="Images"&gt;</a>
<ul>
<li><a href="#sec-4-1-2-4-1-1">4.1.2.4.1.1 &lt;file&gt;</a></li>
</ul>
</li>
<li><a href="#sec-4-1-2-4-2">4.1.2.4.2 &lt;fileGrp ID="ALTOGRP" USE="OCR"&gt;</a></li>
</ul>
</li>
<li><a href="#sec-4-1-2-5">4.1.2.5 &lt;structMap&gt;</a>
<ul>
<li><a href="#sec-4-1-2-5-1">4.1.2.5.1 &lt;structMap type="PHYSICAL"&gt;</a></li>
<li><a href="#sec-4-1-2-5-2">4.1.2.5.2 &lt;structMap type="LOGICAL"&gt;</a>
<ul>
<li><a href="#sec-4-1-2-5-2-1">4.1.2.5.2.1 The &lt;div&gt; hierarchy</a></li>
</ul></li>
</ul></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-4-2">4.2 MODS Profile</a>
<ul>
<li><a href="#sec-4-2-1">4.2.1 Title-Level MODS</a></li>
<li><a href="#sec-4-2-2">4.2.2 Issue-Level MODS</a>
<ul>
<li><a href="#sec-4-2-2-1">4.2.2.1 &lt;mods&gt;</a></li>
<li><a href="#sec-4-2-2-2">4.2.2.2 &lt;recordInfo&gt;</a></li>
<li><a href="#sec-4-2-2-3">4.2.2.3 &lt;recordIdentifier&gt;</a></li>
<li><a href="#sec-4-2-2-4">4.2.2.4 &lt;identifier type="PUL"&gt;</a></li>
<li><a href="#sec-4-2-2-5">4.2.2.5 &lt;relatedItem type="host"&gt;</a></li>
<li><a href="#sec-4-2-2-6">4.2.2.6 &lt;language&gt;</a></li>
<li><a href="#sec-4-2-2-7">4.2.2.7 &lt;titleInfo&gt;</a></li>
<li><a href="#sec-4-2-2-8">4.2.2.8 &lt;MODS:part&gt;</a>
<ul>
<li><a href="#sec-4-2-2-8-1">4.2.2.8.1 &lt;MODS:detail type="volume"&gt;</a></li>
<li><a href="#sec-4-2-2-8-2">4.2.2.8.2 &lt;MODS:detail type="issue"&gt;</a></li>
</ul>
</li>
<li><a href="#sec-4-2-2-9">4.2.2.9 &lt;MODS:originInfo&gt;</a></li>
</ul>
</li>
<li><a href="#sec-4-2-3">4.2.3 &lt;relatedItem type="constituent"&gt;</a>
<ul>
<li><a href="#sec-4-2-3-1">4.2.3.1 &lt;titleInfo&gt;</a></li>
<li><a href="#sec-4-2-3-2">4.2.3.2 &lt;name&gt;</a></li>
<li><a href="#sec-4-2-3-3">4.2.3.3 &lt;language&gt;</a></li>
<li><a href="#sec-4-2-3-4">4.2.3.4 &lt;part&gt;</a>
<ul>
<li><a href="#sec-4-2-3-4-1">4.2.3.4.1 &lt;extent unit="page"&gt;</a></li>
</ul>
</li>
<li><a href="#sec-4-2-3-5">4.2.3.5 &lt;genre type="CCS"&gt;</a></li>
<li><a href="#sec-4-2-3-6">4.2.3.6 Kinds of Constituents</a>
<ul>
<li><a href="#sec-4-2-3-6-1">4.2.3.6.1 TextContent</a>
<ul>
<li><a href="#sec-4-2-3-6-1-1">4.2.3.6.1.1 Examples</a></li>
</ul>
</li>
<li><a href="#sec-4-2-3-6-2">4.2.3.6.2 Illustration</a>
<ul>
<li><a href="#sec-4-2-3-6-2-1">4.2.3.6.2.1 Examples</a></li>
</ul>
</li>
<li><a href="#sec-4-2-3-6-3">4.2.3.6.3 SponsoredAd</a>
<ul>
<li><a href="#sec-4-2-3-6-3-1">4.2.3.6.3.1 Examples</a></li>
</ul>
</li>
<li><a href="#sec-4-2-3-6-4">4.2.3.6.4 Section</a>
<ul>
<li><a href="#sec-4-2-3-6-4-1">4.2.3.6.4.1 Examples</a></li>
</ul></li>
</ul></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-4-3">4.3 ALTO Profile</a></li>
<li><a href="#sec-4-4">4.4 Image Profiles</a>
<ul>
<li><a href="#sec-4-4-1">4.4.1 TIFF: Image Description</a></li>
<li><a href="#sec-4-4-2">4.4.2 JPEG2000: Image Description</a>
<ul>
<li><a href="#sec-4-4-2-1">4.4.2.1 Generative Image Derivatives</a></li>
<li><a href="#sec-4-4-2-2">4.4.2.2 Delivery Derivatives</a></li>
</ul></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-5">5 Blue Mountain DocWorks Configuration</a>
<ul>
<li><a href="#sec-5-1">5.1 Containers</a>
<ul>
<li><a href="#sec-5-1-1">5.1.1 Editorial Content Container</a>
<ul>
<li><a href="#sec-5-1-1-1">5.1.1.1 Article Copy</a></li>
</ul>
</li>
<li><a href="#sec-5-1-2">5.1.2 PubInfo Container</a></li>
<li><a href="#sec-5-1-3">5.1.3 SponsoredAd Container</a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-6">6 General Markup Policy for Blue Mountain Magazines</a>
<ul>
<li><a href="#sec-6-1">6.1 Preliminary</a></li>
<li><a href="#sec-6-2">6.2 VerifyPageFrames (VPF)</a></li>
<li><a href="#sec-6-3">6.3 VerifyLayoutElements (VLE)</a></li>
<li><a href="#sec-6-4">6.4 VerifyPageNumbers (VPN)</a>
<ul>
<li><a href="#sec-6-4-1">6.4.1 Zone Types to Tag</a>
<ul>
<li><a href="#sec-6-4-1-1">6.4.1.1 PubInfo Container</a>
<ul>
<li><a href="#sec-6-4-1-1-1">6.4.1.1.1 Page Number</a></li>
<li><a href="#sec-6-4-1-1-2">6.4.1.1.2 Nameplate</a></li>
<li><a href="#sec-6-4-1-1-3">6.4.1.1.3 Masthead</a></li>
<li><a href="#sec-6-4-1-1-4">6.4.1.1.4 Folio Line (Inside)</a></li>
<li><a href="#sec-6-4-1-1-5">6.4.1.1.5 Front Folio Line(s)</a></li>
<li><a href="#sec-6-4-1-1-6">6.4.1.1.6 General Publication Information</a></li>
</ul>
</li>
<li><a href="#sec-6-4-1-2">6.4.1.2 Editorial Content Container</a>
<ul>
<li><a href="#sec-6-4-1-2-1">6.4.1.2.1 Head</a></li>
<li><a href="#sec-6-4-1-2-2">6.4.1.2.2 Subhead</a></li>
<li><a href="#sec-6-4-1-2-3">6.4.1.2.3 Article Copy</a></li>
<li><a href="#sec-6-4-1-2-4">6.4.1.2.4 Byline</a></li>
<li><a href="#sec-6-4-1-2-5">6.4.1.2.5 Art</a></li>
<li><a href="#sec-6-4-1-2-6">6.4.1.2.6 Caption</a></li>
<li><a href="#sec-6-4-1-2-7">6.4.1.2.7 Music</a></li>
<li><a href="#sec-6-4-1-2-8">6.4.1.2.8 Footnote</a></li>
</ul>
</li>
<li><a href="#sec-6-4-1-3">6.4.1.3 SponsoredAd Container</a>
<ul>
<li><a href="#sec-6-4-1-3-1">6.4.1.3.1 Sponsored Ad (Advertisement Copy)</a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-6-4-2">6.4.2 Zone Types to Ignore</a></li>
</ul>
</li>
<li><a href="#sec-6-5">6.5 VerifyPageHierarchy (VPH)</a></li>
<li><a href="#sec-6-6">6.6 VerifyHiearchy (VH)</a></li>
<li><a href="#sec-6-7">6.7 OCR Correction</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Identifiers and Naming Conventions</h2>
<div class="outline-text-2" id="text-1">

<p>  Blue Mountain assigns a URI to each magazine, magazine issue,
  METS, and MODS record it maintains:
</p>



<pre class="example">&lt;BMTNPREFIX&gt; ::= "urn:PUL:bluemountain"
&lt;DATESTRING&gt; ::= CCYY-MM-DD | CCYY-MM | CCYY
&lt;ISSUEINDEX&gt; ::= &lt;0-9&gt;&lt;0-9&gt;
&lt;BMTNID&gt;     ::= "bmtn" &lt;a-z&gt;&lt;a-z&gt;&lt;a-z&gt;
&lt;ISSUID&gt;     ::= &lt;BMTNID&gt; "_" &lt;DATESTRING&gt; "_" &lt;ISSUEINDEX&gt;

&lt;TITLEURI&gt;    ::= &lt;BMTNPREFIX&gt; ":" &lt;BMTNID&gt;
&lt;ISSUEURI&gt;    ::= &lt;BMTNPREFIX&gt; ":" &lt;ISSUEID&gt;


&lt;TITLEMETSURI&gt; ::= &lt;BMTNPREFIX&gt; ":td:" &lt;BMTNID&gt;
&lt;ISSUEMETSURI&gt; ::= &lt;BMTNPREFIX&gt; ":td:" &lt;ISSUEID&gt;

&lt;TITLEMODSURI&gt; ::= &lt;BMTNPREFIX&gt; ":dmd:" &lt;BMTNID&gt;
&lt;ISSUEMODSURI&gt; ::= &lt;BMTNPREFIX&gt; ":dmd:" &lt;ISSUEID&gt;
</pre>


<p>  
  This syntax is explained below.
</p>

</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Blue Mountain Identifiers (bmtnids)</h3>
<div class="outline-text-3" id="text-1-1">

<p>  Blue Mountain is a <i>database</i> of magazines: that is, it is a
  system that links information together.  In order to link
  information about specific objects &ndash; magazine titles, magazine
  issues, ec. &ndash; Blue Mountain must assign a <i>unique identifier</i> to
  each object.  (This is a well-known feature of information
  science.).
</p>
<p>
  Blue Mountain adopts the Universal Resource Name conventions (URN)
  to compose unique identifiers for <i>titles</i> and <i>issues</i>, as well
  as for the metadata records (METS and MODS) used to encode
  information about them. 
</p>
<p>
   A <i>Journal Title</i> is the journal or magazine as a whole, as
   opposed to discrete volumes or issues &ndash; the entire run of the
   magazine.  Blue Mountain assigns a sequential <i>blue mountain    identifier</i>, or <i>bmtnid</i> to each title.  The bmtnid will take the
   form <i>bmtnNNN</i>, where NNN is a hexavigesimal number (e.g., <i>aaa</i>,
   <i>aab</i>, <i>aac</i>, etc.).<sup><a class="footref" name="fnr-.1" href="#fn-.1">1</a></sup> Blue Mountain will maintain bmtnids in a
   <i>project registry</i>, a file maintained with other administrative
   files.
</p>
</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Issuance Strings</h3>
<div class="outline-text-3" id="text-1-2">

<p>   Each journal <i>issue</i> will be assigned an <i>issue identifier</i> or
   <i>issueid</i> of the form <i>bmtnid_issuanceString</i>, where <i>issuanceString</i>
   corresponds to the date of issuance and takes the form
   <i>CCYY-MM-DD_II</i>, defined as follows:
</p>
<dl>
<dt>CCYY</dt><dd>A four-digit number representing the year of publication (e.g., 1912)
</dd>
<dt>MM  </dt><dd>A two-digit number representing the month of publication,
             where January = 01, February = 02, etc.
</dd>
<dt>DD  </dt><dd>A two-digit number representing the day of publication
             (e.g., 01, 02 .. 30, 31).
</dd>
<dt>II  </dt><dd>A two-digit index of daily issuance (e.g., the first
             issue of the day is 01, the second is 02, and so on).
             This convention is adopted from the issuance of
             newspapers, which not infrequently issued a morning
             edition and an evening edition on the same day.  Blue
             Mountain's adoption allows us to distinguish among
             magazine texts that were published on the same day: a
             regular issue and a supplement, for example.
</dd>
</dl>



</div>
