doc/reference.org
*** How to Compose an Issuance String
    Issueids, like ISO 8601 dates, are organized from most
    significant to least significant chronological unit (i.e., from
    year to day).  This format has two advantages: it allows ids to
    be sorted naturally, and it enables /variable precision/: the
    representation of daily, monthly, or yearly issuance.

    - If you know the year, month, and day of publication (e.g., you
      know that the issue was published on January 5th, 1912) :: then
      the issuance string os 1912-01-05_01.

    - If you have two issues published on the same day (e.g., an
      issue and a special supplement were both issued on January
      5th, 1912) :: then the issuance strings are 1912-01-05_01 and
      1912-01-05_02.

    - If you know only the year and month of publication (e.g., you
      know it was published in January, 1912, but you do not know on
      what day: 1912-01_01.

    - If you know that the magazine published two issues monthly, but
      you do not know the dates of publication (e.g., you have two
      issues published in January, 1912): The issuance strings are
      1912-01_01 and 1912-01_02.

    - If you know only the year of publication (e.g., you know that
      the issue was published in 1912, but you do not know the month
      or, therefore, the day of publication): The issuance string is
      1912_01.

    - If you have several issues published in the same year, but you
      know neither the month nor the day of publication (e.g., you
      know the journal published two issues in 1912, but you do not
      know the months or days of publication): The issuance strings
      are 1912_01 and 1912_02.

**** A Real Example
    The journal /le coeur à barbe/ has the Blue Mountain
    identifier *bmtnaad*.  Only one issue was published, in April
    of 1920. 

    |---------------+---------------------------------------------|
    | titleid       | urn:PUL:bluemountain:bmtnaad                |
    | title METS id | urn:PUL:bluemountain:td:bmtnaad             |
    | title MODS id | urn:PUL:bluemountain:dmd:bmtnaad            |
    | issueid       | urn:PUL:bluemountain:bmtnaad_1920-04_01     |
    | issue METS id | urn:PUL:bluemountain:td:bmtnaad_1920-04_01  |
    | issue MODS id | urn:PUL:bluemountain:dmd:bmtnaad_1920-04_01 |
    |---------------+---------------------------------------------|


** File Names
   Names of Blue Mountain files will be constructed using the naming
   convention described above.
*** Image File Names
    #+BEGIN_EXAMPLE
    <EXTENSION> ::= "tif" | "jp2"
    <IMGINDEX>  ::= <0-9><0-9><0-9>
    <FILENAME>  ::= <ISSUEID> "_" <IMGINDEX> "." <EXTENSION>
    #+END_EXAMPLE

   Image files shall be named /issueid_nnn.jp2/ or /issueid_nnn.tif/,
   where
   - /issuid/ is the identifier of the issue;
   - /nnn/ is a three-digit number indicating the location of the
     image file in the sequence of image files (not necessarily the
     number printed on the page that has been photographed);
   - /jp2/ is the conventional file extension for JPEG2000 files.
   - /tif/ is the conventional file extension for TIFF files.

   For example,
   #+BEGIN_EXAMPLE
   bmtnaad_1925-06-03_01_001.jp2
   bmtnaad_1925-06-03_01_002.jp2
   ...
   #+END_EXAMPLE
*** ALTO File Names
    #+BEGIN_EXAMPLE
    <EXTENSION> ::= "alto.xml"
    <IMGINDEX>  ::= <0-9><0-9><0-9>
    <FILENAME>  ::= <ISSUEID> "_" <IMGINDEX> "." <EXTENSION>
    #+END_EXAMPLE

   ALTO files shall be named /issueid_nnn.alto.xml/, where
   - /issuid/ is the identifier of the issue
   - /nnn/ is a three-digit number corresponding to the sequence
     number of the image file to which this ALTO file corresponds
   - /alto/ indicates the schema used to encode the document
   - /xml/ indicates the format of the file.

   For example,
   #+BEGIN_EXAMPLE
   bmtnaad_1925-06-03_01_001.alto.xml
   bmtnaad_1925-06-03_01_002.alto.xml
   ...
   #+END_EXAMPLE
*** METS File Names
    #+BEGIN_EXAMPLE
    <EXTENSION> ::= "mets.xml"
    <FILENAME>  ::= <ISSUEID>  "." <EXTENSION>
    #+END_EXAMPLE

   METS files shall be named /issueid.mets.xml/, where
   - /issueid/ is the identifier of the issue
   - /mets/ indicates the schema used to encode the document
   - /xml/ indicates the format of the file.
   
   For example,
   #+BEGIN_EXAMPLE
   bmtnaad_1925-06-03_01.mets.xml
   #+END_EXAMPLE
*** PDF File Names
    #+BEGIN_EXAMPLE
    <EXTENSION> ::= "pdf"
    <FILENAME>  ::= <ISSUEID> "." <EXTENSION>
    #+END_EXAMPLE

   PDF files shall be named /issueid.pdf/, where
   - /issueid/ is the identifier of the issue
   - /pdf/ indicates the format of the file.
   
   For example,
   #+BEGIN_EXAMPLE
   bmtnaad_1925-06-03_01.pdf
   #+END_EXAMPLE

* Journal Objects
 A /journal object/ will comprise the following elements:

 - title-level descriptive metadata :: A detailed, machine-readable
      description of the periodical as a whole.  Encoded in MODS for
      compatibility with library systems, but translatable into other
      formats (e.g., TEI).

 - title-level bibliography :: An article-level prose description.
      (/bmtnid.tei.xml/)

 - title-level metadata wrapper :: Pulls together the title-level
      metadata, the bibliography, and the issue-level metadata
      (/bmtnid.mets.xml/)

 - issues :: one or more issues, each of which entails the following:
   - preservation-quality images :: high-quality TIFF files ('master
	TIFFs'), produced according to local best practices and in
	conformance with the FADGI standards
	(http://www.digitizationguidelines.gov/guidelines/digitize-technical.html).
   - generative image derivatives :: more manageable forms of the
	master TIFFs, meant to serve as the source for online
	deliverables, etc.  Encoded in the JPEG2000 format, according
	to specifications described below.
   - delivery derivatives :: images optimized for delivery over the
	World Wide Web.
   - issue-level descriptive metadata :: a MODS document (see below).
   - text encodings :: Initially these will be in the form of
		       corrected OCR for each page, encoded in the
		       ALTO schema (output by ABBYY via
		       docWORKS). Future encodings will likely
		       include TEI representations, derived from the
		       ALTO documents, for detailed textual analysis.
   - deliverable text-under-image PDF :: another ABBYY output format.
   - issue-level metadata wrapper :: a METS document.  The METS half
	of METS/ALTO, the structMap of this document links
	constituent-level items to the regions identified in the ALTO
	documents, and to the page image.  (See below for detailed
	specification.)
