doc/reference.html

<div id="outline-container-1-2-1" class="outline-4">
<h4 id="sec-1-2-1"><span class="section-number-4">1.2.1</span> How to Compose an Issuance String</h4>
<div class="outline-text-4" id="text-1-2-1">

<p>    Issueids, like ISO 8601 dates, are organized from most
    significant to least significant chronological unit (i.e., from
    year to day).  This format has two advantages: it allows ids to
    be sorted naturally, and it enables <i>variable precision</i>: the
    representation of daily, monthly, or yearly issuance.
</p>
<ul>
<li>If you know the year, month, and day of publication (e.g., you
      know that the issue was published on January 5th, 1912) :: then
      the issuance string os 1912-01-05_01.

</li>
<li>If you have two issues published on the same day (e.g., an
      issue and a special supplement were both issued on January
      5th, 1912) :: then the issuance strings are 1912-01-05_01 and
      1912-01-05_02.

</li>
<li>If you know only the year and month of publication (e.g., you
      know it was published in January, 1912, but you do not know on
      what day: 1912-01_01.

</li>
<li>If you know that the magazine published two issues monthly, but
      you do not know the dates of publication (e.g., you have two
      issues published in January, 1912): The issuance strings are
      1912-01_01 and 1912-01_02.

</li>
<li>If you know only the year of publication (e.g., you know that
      the issue was published in 1912, but you do not know the month
      or, therefore, the day of publication): The issuance string is
      1912_01.

</li>
<li>If you have several issues published in the same year, but you
      know neither the month nor the day of publication (e.g., you
      know the journal published two issues in 1912, but you do not
      know the months or days of publication): The issuance strings
      are 1912_01 and 1912_02.
</li>
</ul>



</div>

<div id="outline-container-1-2-1-1" class="outline-5">
<h5 id="sec-1-2-1-1"><span class="section-number-5">1.2.1.1</span> A Real Example</h5>
<div class="outline-text-5" id="text-1-2-1-1">

<p>    The journal <i>le coeur à barbe</i> has the Blue Mountain
    identifier <b>bmtnaad</b>.  Only one issue was published, in April
    of 1920. 
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" /><col class="left" />
</colgroup>
<tbody>
<tr><td class="left">titleid</td><td class="left">urn:PUL:bluemountain:bmtnaad</td></tr>
<tr><td class="left">title METS id</td><td class="left">urn:PUL:bluemountain:td:bmtnaad</td></tr>
<tr><td class="left">title MODS id</td><td class="left">urn:PUL:bluemountain:dmd:bmtnaad</td></tr>
<tr><td class="left">issueid</td><td class="left">urn:PUL:bluemountain:bmtnaad_1920-04_01</td></tr>
<tr><td class="left">issue METS id</td><td class="left">urn:PUL:bluemountain:td:bmtnaad_1920-04_01</td></tr>
<tr><td class="left">issue MODS id</td><td class="left">urn:PUL:bluemountain:dmd:bmtnaad_1920-04_01</td></tr>
</tbody>
</table>



</div>
</div>
</div>

</div>

<div id="outline-container-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> File Names</h3>
<div class="outline-text-3" id="text-1-3">

<p>   Names of Blue Mountain files will be constructed using the naming
   convention described above.
</p>
</div>

<div id="outline-container-1-3-1" class="outline-4">
<h4 id="sec-1-3-1"><span class="section-number-4">1.3.1</span> Image File Names</h4>
<div class="outline-text-4" id="text-1-3-1">




<pre class="example">&lt;EXTENSION&gt; ::= "tif" | "jp2"
&lt;IMGINDEX&gt;  ::= &lt;0-9&gt;&lt;0-9&gt;&lt;0-9&gt;
&lt;FILENAME&gt;  ::= &lt;ISSUEID&gt; "_" &lt;IMGINDEX&gt; "." &lt;EXTENSION&gt;
</pre>


<p>
   Image files shall be named <i>issueid_nnn.jp2</i> or <i>issueid_nnn.tif</i>,
   where
</p><ul>
<li><i>issuid</i> is the identifier of the issue;
</li>
<li><i>nnn</i> is a three-digit number indicating the location of the
     image file in the sequence of image files (not necessarily the
     number printed on the page that has been photographed);
</li>
<li><i>jp2</i> is the conventional file extension for JPEG2000 files.
</li>
<li><i>tif</i> is the conventional file extension for TIFF files.
</li>
</ul>


<p>
   For example,
</p>


<pre class="example">bmtnaad_1925-06-03_01_001.jp2
bmtnaad_1925-06-03_01_002.jp2
...
</pre>

</div>

</div>

<div id="outline-container-1-3-2" class="outline-4">
<h4 id="sec-1-3-2"><span class="section-number-4">1.3.2</span> ALTO File Names</h4>
<div class="outline-text-4" id="text-1-3-2">




<pre class="example">&lt;EXTENSION&gt; ::= "alto.xml"
&lt;IMGINDEX&gt;  ::= &lt;0-9&gt;&lt;0-9&gt;&lt;0-9&gt;
&lt;FILENAME&gt;  ::= &lt;ISSUEID&gt; "_" &lt;IMGINDEX&gt; "." &lt;EXTENSION&gt;
</pre>


<p>
   ALTO files shall be named <i>issueid_nnn.alto.xml</i>, where
</p><ul>
<li><i>issuid</i> is the identifier of the issue
</li>
<li><i>nnn</i> is a three-digit number corresponding to the sequence
     number of the image file to which this ALTO file corresponds
</li>
<li><i>alto</i> indicates the schema used to encode the document
</li>
<li><i>xml</i> indicates the format of the file.
</li>
</ul>


<p>
   For example,
</p>


<pre class="example">bmtnaad_1925-06-03_01_001.alto.xml
bmtnaad_1925-06-03_01_002.alto.xml
...
</pre>

</div>

</div>

<div id="outline-container-1-3-3" class="outline-4">
<h4 id="sec-1-3-3"><span class="section-number-4">1.3.3</span> METS File Names</h4>
<div class="outline-text-4" id="text-1-3-3">




<pre class="example">&lt;EXTENSION&gt; ::= "mets.xml"
&lt;FILENAME&gt;  ::= &lt;ISSUEID&gt;  "." &lt;EXTENSION&gt;
</pre>


<p>
   METS files shall be named <i>issueid.mets.xml</i>, where
</p><ul>
<li><i>issueid</i> is the identifier of the issue
</li>
<li><i>mets</i> indicates the schema used to encode the document
</li>
<li><i>xml</i> indicates the format of the file.
</li>
</ul>


<p>   
   For example,
</p>


<pre class="example">bmtnaad_1925-06-03_01.mets.xml
</pre>

</div>

</div>

<div id="outline-container-1-3-4" class="outline-4">
<h4 id="sec-1-3-4"><span class="section-number-4">1.3.4</span> PDF File Names</h4>
<div class="outline-text-4" id="text-1-3-4">




<pre class="example">&lt;EXTENSION&gt; ::= "pdf"
&lt;FILENAME&gt;  ::= &lt;ISSUEID&gt; "." &lt;EXTENSION&gt;
</pre>


<p>
   PDF files shall be named <i>issueid.pdf</i>, where
</p><ul>
<li><i>issueid</i> is the identifier of the issue
</li>
<li><i>pdf</i> indicates the format of the file.
</li>
</ul>


<p>   
   For example,
</p>


<pre class="example">bmtnaad_1925-06-03_01.pdf
</pre>


</div>
</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Journal Objects</h2>
<div class="outline-text-2" id="text-2">

<p> A <i>journal object</i> will comprise the following elements:
</p>
<dl>
<dt>title-level descriptive metadata</dt><dd>A detailed, machine-readable
      description of the periodical as a whole.  Encoded in MODS for
      compatibility with library systems, but translatable into other
      formats (e.g., TEI).

</dd>
<dt>title-level bibliography</dt><dd>An article-level prose description.
      (<i>bmtnid.tei.xml</i>)

</dd>
<dt>title-level metadata wrapper</dt><dd>Pulls together the title-level
      metadata, the bibliography, and the issue-level metadata
      (<i>bmtnid.mets.xml</i>)

</dd>
<dt>issues</dt><dd>one or more issues, each of which entails the following:
<dl>
<dt>preservation-quality images</dt><dd>high-quality TIFF files ('master
        TIFFs'), produced according to local best practices and in
        conformance with the FADGI standards
        (<a href="http://www.digitizationguidelines.gov/guidelines/digitize-technical.html">http://www.digitizationguidelines.gov/guidelines/digitize-technical.html</a>).
</dd>
<dt>generative image derivatives</dt><dd>more manageable forms of the
        master TIFFs, meant to serve as the source for online
        deliverables, etc.  Encoded in the JPEG2000 format, according
        to specifications described below.
</dd>
<dt>delivery derivatives</dt><dd>images optimized for delivery over the
        World Wide Web.
</dd>
<dt>issue-level descriptive metadata</dt><dd>a MODS document (see below).
</dd>
<dt>text encodings</dt><dd>Initially these will be in the form of
                       corrected OCR for each page, encoded in the
                       ALTO schema (output by ABBYY via
                       docWORKS). Future encodings will likely
                       include TEI representations, derived from the
                       ALTO documents, for detailed textual analysis.
</dd>
<dt>deliverable text-under-image PDF</dt><dd>another ABBYY output format.
</dd>
<dt>issue-level metadata wrapper</dt><dd>a METS document.  The METS half
        of METS/ALTO, the structMap of this document links
        constituent-level items to the regions identified in the ALTO
        documents, and to the page image.  (See below for detailed
        specification.)
</dd>
</dl>

</dd>
</dl>

</div>

</div>
