doc/reference.org
* Arrangement (Blue Mountain Directory Structure)
  The components of the journal object have different storage and
  access requirements.  Master TIFF files are very large binary
  files that will seldom be accessed but must be carefully preserved
  (they are expensive or impossible to replace). Image derivatives,
  too, are large binary files, but they can be regenerated from the
  master TIFFs and therefore require less care, but they will be
  accessed from a variety of sources (primarily the web).  PDF files
  are hybrids: they are large binary files, composites of image
  derivatives and OCR output that cannot easily be recreated and so
  must be preserved more carefully than image derivatives while
  still being accessible.  Metadata files are relatively small but
  very expensive to replace, and so must be curated carefully.  They
  are also liable to updating, so version tracking is important.

  The Blue Mountain Project will manage these assets separately.
  The non-binary data and metadata will be stored and managed in a
  distributed version control system (DVCS), which will enable
  change management, collaborative development among PUL and its
  METS/ALTO vendor, and resource sharing, as stipulated in the
  grant.

  Master TIFF files and text-under-image PDFs will be maintained in a
  /preservation store/; image derivatives, and copies of the PDFs and
  the metadata, will be kept in an /access store./
** The Metadata Store
   Metadata will be organized as a hierarchy of files and
   directories, like this:
   #+BEGIN_EXAMPLE
   - periodicals/
     - bmtnID/
       - bmtnID.mets.xml
       - bmtnID.mods.xml
       - bmtnID.tei.xml
       - issues/
   #+END_EXAMPLE
   The issues/ directory will be organized by publication date,
   following the same convention as that used for constructing
   identifiers.  So, for example,
   #+BEGIN_EXAMPLE
   - bmtnabi/
     - issues/
       - 1859/
	 - 01/
	   - 05_01/
	     - bmtnid_issueid.mets.xml
	     - bmtnid_issueid.mods.xml
	     - bmtnid_issueid.tei.xml
	     - alto/
	       - bmtnid_issueid-001.alto.xml
	       - bmtnid_issueid-002.alto.xml
   #+END_EXAMPLE
** The Preservation Store
   The Preservation Store will be arranged as a filesystem mirroring
   the structure of the metadata tree and rooted at
   /usr/share/BlueMountain/pstore/periodicals.
   #+BEGIN_EXAMPLE
   - pstore/
     - periodicals/
       - bmtnid/
	 - issues/
	   - CCYY/
	     - MM/
	       - DD_II/
		 - bmtnid_issueid.pdf
		 - bmtnid_issueid_001.tif
		 - bmtnid_issueid_002.tif
   #+END_EXAMPLE
** The Access Store
   Like the Preservation Store, the Access store will be arranged as
   a filesystem mirroring the structure of the metadata tree; it will
   be rooted at /usr/share/BlueMountain/astore/periodicals.
   #+BEGIN_EXAMPLE
   - astore/
     - periodicals/
       - bmtnid/
	 - issues/
	   - CCYY/
	     - MM/
	       - DD_II/
		 - bmtnid_issueid.pdf
		 - generative/
		   - bmtnid_issueid_001.jp2
		   - bmtnid_issueid_002.jp2
		   - bmtnid_issueid_003.jp2
		 - delivery/
		   - bmtnid_issueid_001.jp2
		   - bmtnid_issueid_002.jp2
		   - bmtnid_issueid_003.jp2
   #+END_EXAMPLE

* Profiles
** METS Profile
   There are two kinds of METS records in Blue Mountain:

   1. *Title-Level METS* -- A METS document encapsulating information about
      the magazine title as a whole.
   2. *Issue-Level METS* -- A METS document encapsulating information
      about an individual issue of a magazine.

   These are described in greater detail below.

*** Title-Level METS
    ( Greater detail to come. )

    The metadata for the title will be encapsulated in a title-level
    METS record: the title-level descriptive metadata (either as an
    embedded MODS record or pointed to), a pointer to the
    bibliographic history, and (possibly) pointers to issue-level metadata.

