doc/reference.html

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Arrangement (Blue Mountain Directory Structure)</h2>
<div class="outline-text-2" id="text-3">

<p>  The components of the journal object have different storage and
  access requirements.  Master TIFF files are very large binary
  files that will seldom be accessed but must be carefully preserved
  (they are expensive or impossible to replace). Image derivatives,
  too, are large binary files, but they can be regenerated from the
  master TIFFs and therefore require less care, but they will be
  accessed from a variety of sources (primarily the web).  PDF files
  are hybrids: they are large binary files, composites of image
  derivatives and OCR output that cannot easily be recreated and so
  must be preserved more carefully than image derivatives while
  still being accessible.  Metadata files are relatively small but
  very expensive to replace, and so must be curated carefully.  They
  are also liable to updating, so version tracking is important.
</p>
<p>
  The Blue Mountain Project will manage these assets separately.
  The non-binary data and metadata will be stored and managed in a
  distributed version control system (DVCS), which will enable
  change management, collaborative development among PUL and its
  METS/ALTO vendor, and resource sharing, as stipulated in the
  grant.
</p>
<p>
  Master TIFF files and text-under-image PDFs will be maintained in a
  <i>preservation store</i>; image derivatives, and copies of the PDFs and
  the metadata, will be kept in an <i>access store.</i>
</p>
</div>

<div id="outline-container-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> The Metadata Store</h3>
<div class="outline-text-3" id="text-3-1">

<p>   Metadata will be organized as a hierarchy of files and
   directories, like this:
</p>


<pre class="example">- periodicals/
  - bmtnID/
    - bmtnID.mets.xml
    - bmtnID.mods.xml
    - bmtnID.tei.xml
    - issues/
</pre>

<p>
   The issues/ directory will be organized by publication date,
   following the same convention as that used for constructing
   identifiers.  So, for example,
</p>


<pre class="example">- bmtnabi/
  - issues/
    - 1859/
      - 01/
        - 05_01/
          - bmtnid_issueid.mets.xml
          - bmtnid_issueid.mods.xml
          - bmtnid_issueid.tei.xml
          - alto/
            - bmtnid_issueid-001.alto.xml
            - bmtnid_issueid-002.alto.xml
</pre>

</div>

</div>

<div id="outline-container-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> The Preservation Store</h3>
<div class="outline-text-3" id="text-3-2">

<p>   The Preservation Store will be arranged as a filesystem mirroring
   the structure of the metadata tree and rooted at
   /usr/share/BlueMountain/pstore/periodicals.
</p>


<pre class="example">- pstore/
  - periodicals/
    - bmtnid/
      - issues/
        - CCYY/
          - MM/
            - DD_II/
              - bmtnid_issueid.pdf
              - bmtnid_issueid_001.tif
              - bmtnid_issueid_002.tif
</pre>

</div>

</div>

<div id="outline-container-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> The Access Store</h3>
<div class="outline-text-3" id="text-3-3">

<p>   Like the Preservation Store, the Access store will be arranged as
   a filesystem mirroring the structure of the metadata tree; it will
   be rooted at /usr/share/BlueMountain/astore/periodicals.
</p>


<pre class="example">- astore/
  - periodicals/
    - bmtnid/
      - issues/
        - CCYY/
          - MM/
            - DD_II/
              - bmtnid_issueid.pdf
              - generative/
                - bmtnid_issueid_001.jp2
                - bmtnid_issueid_002.jp2
                - bmtnid_issueid_003.jp2
              - delivery/
                - bmtnid_issueid_001.jp2
                - bmtnid_issueid_002.jp2
                - bmtnid_issueid_003.jp2
</pre>


</div>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Profiles</h2>
<div class="outline-text-2" id="text-4">


</div>

<div id="outline-container-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> METS Profile</h3>
<div class="outline-text-3" id="text-4-1">

<p>   There are two kinds of METS records in Blue Mountain:
</p>
<ol>
<li><b>Title-Level METS</b> &ndash; A METS document encapsulating information about
      the magazine title as a whole.
</li>
<li><b>Issue-Level METS</b> &ndash; A METS document encapsulating information
      about an individual issue of a magazine.
</li>
</ol>


<p>
   These are described in greater detail below.
</p>

</div>

<div id="outline-container-4-1-1" class="outline-4">
<h4 id="sec-4-1-1"><span class="section-number-4">4.1.1</span> Title-Level METS</h4>
<div class="outline-text-4" id="text-4-1-1">

<p>    ( Greater detail to come. )
</p>
<p>
    The metadata for the title will be encapsulated in a title-level
    METS record: the title-level descriptive metadata (either as an
    embedded MODS record or pointed to), a pointer to the
    bibliographic history, and (possibly) pointers to issue-level metadata.
</p>
</div>

</div>
