doc/reference.html

<div id="outline-container-4-1-2" class="outline-4">
<h4 id="sec-4-1-2"><span class="section-number-4">4.1.2</span> Issue-Level METS</h4>
<div class="outline-text-4" id="text-4-1-2">

<p>   The metadata for each issue shall be encapsulated in a METS
   record.  A skeleton sample of such a record is the following:
</p>



<pre class="src src-xml">&lt;?<span style="color: #f0dfaf; font-weight: bold;">xml</span> <span style="color: #dfaf8f;">version</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">1.0</span><span style="color: #cc9393;">"</span> <span style="color: #dfaf8f;">encoding</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">UTF-8</span><span style="color: #cc9393;">"</span>?&gt;
&lt;<span style="color: #8cd0d3;">mets</span> <span style="color: #93e0e3;">xmlns</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">http://www.loc.gov/METS/</span><span style="color: #cc9393;">"</span>
      <span style="color: #93e0e3;">xmlns</span>:<span style="color: #dfaf8f;">xlink</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">http://www.w3.org/1999/xlink</span><span style="color: #cc9393;">"</span>
      <span style="color: #93e0e3;">xmlns</span>:<span style="color: #dfaf8f;">xsi</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">http://www.w3.org/2001/XMLSchema-instance</span><span style="color: #cc9393;">"</span>
      <span style="color: #93e0e3;">xsi</span>:<span style="color: #dfaf8f;">schemaLocation</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">http://www.loc.gov/METS/ http://www.loc.gov/standards/mets/mets.xsd</span><span style="color: #cc9393;">"</span> 
      <span style="color: #dfaf8f;">TYPE</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">Magazine</span><span style="color: #cc9393;">"</span>
      <span style="color: #dfaf8f;">OBJID</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">urn:PUL:bluemountain:bmtnaad_1925-06-03_01</span><span style="color: #cc9393;">"</span>
      <span style="color: #dfaf8f;">LABEL</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">vozrozhdenie_1925-06-03_01</span><span style="color: #cc9393;">"</span>&gt;
  &lt;<span style="color: #8cd0d3;">metsHdr</span>&gt;
    &lt;<span style="color: #8cd0d3;">agent</span> <span style="color: #dfaf8f;">ROLE</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">CREATOR</span><span style="color: #cc9393;">"</span> <span style="color: #dfaf8f;">TYPE</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">ORGANIZATION</span><span style="color: #cc9393;">"</span>&gt;
      &lt;<span style="color: #8cd0d3;">name</span>&gt;Princeton University Library, Digital Initiatives&lt;/<span style="color: #8cd0d3;">name</span>&gt;
    &lt;/<span style="color: #8cd0d3;">agent</span>&gt;
    &lt;<span style="color: #8cd0d3;">metsDocumentID</span> <span style="color: #dfaf8f;">TYPE</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">URN</span><span style="color: #cc9393;">"</span>&gt;urn:PUL:bluemountain:td:bmtnaad_1925-06-03_01&lt;/<span style="color: #8cd0d3;">metsDocumentID</span>&gt;
  &lt;/<span style="color: #8cd0d3;">metsHdr</span>&gt;
  &lt;<span style="color: #8cd0d3;">dmdSec</span> <span style="color: #dfaf8f;">ID</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">dmd1</span><span style="color: #cc9393;">"</span>&gt;
    &lt;<span style="color: #8cd0d3;">mdWrap</span> <span style="color: #dfaf8f;">MDTYPE</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">MODS</span><span style="color: #cc9393;">"</span>&gt;
      &lt;<span style="color: #8cd0d3;">xmlData</span>&gt;
        <span style="color: #7f9f7f;">&lt;!--</span><span style="color: #7f9f7f;"> MODS record goes here </span><span style="color: #7f9f7f;">--&gt;</span>
      &lt;/<span style="color: #8cd0d3;">xmlData</span>&gt;
    &lt;/<span style="color: #8cd0d3;">mdWrap</span>&gt;
  &lt;/<span style="color: #8cd0d3;">dmdSec</span>&gt;

    <span style="color: #7f9f7f;">&lt;!--</span><span style="color: #7f9f7f;">Use a single administrative section (&lt;amdSec&gt;) as a </span>
<span style="color: #7f9f7f;">        wrapper for the technical metadata for all the images</span><span style="color: #7f9f7f;">--&gt;</span>
  &lt;<span style="color: #8cd0d3;">amdSec</span>&gt;
    &lt;<span style="color: #8cd0d3;">techMD</span> <span style="color: #dfaf8f;">ID</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">techmd1</span><span style="color: #cc9393;">"</span>&gt;
      <span style="color: #7f9f7f;">&lt;!--</span><span style="color: #7f9f7f;"> technical metadata (MIX) for first image </span><span style="color: #7f9f7f;">--&gt;</span>
      &lt;<span style="color: #8cd0d3;">mdWrap</span> <span style="color: #dfaf8f;">MDTYPE</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">NISOIMG</span><span style="color: #cc9393;">"</span>&gt;
        <span style="color: #7f9f7f;">&lt;!--</span><span style="color: #7f9f7f;"> The technical metadata docWorks provides goes here </span><span style="color: #7f9f7f;">--&gt;</span>
      &lt;/<span style="color: #8cd0d3;">mdWrap</span>&gt;
    &lt;/<span style="color: #8cd0d3;">techMD</span>&gt;
    &lt;<span style="color: #8cd0d3;">techMD</span> <span style="color: #dfaf8f;">ID</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">techmd2</span><span style="color: #cc9393;">"</span>&gt;
      <span style="color: #7f9f7f;">&lt;!--</span><span style="color: #7f9f7f;"> technical metadata for the second image </span><span style="color: #7f9f7f;">--&gt;</span>
      &lt;<span style="color: #8cd0d3;">mdWrap</span> <span style="color: #dfaf8f;">MDTYPE</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">NISOIMG</span><span style="color: #cc9393;">"</span>/&gt;
    &lt;/<span style="color: #8cd0d3;">techMD</span>&gt;

    <span style="color: #7f9f7f;">&lt;!--</span><span style="color: #7f9f7f;"> &lt;techMD&gt; elements for remaining image files </span><span style="color: #7f9f7f;">--&gt;</span>
  &lt;/<span style="color: #8cd0d3;">amdSec</span>&gt;

  &lt;<span style="color: #8cd0d3;">fileSec</span>&gt;
    &lt;<span style="color: #8cd0d3;">fileGrp</span> <span style="color: #dfaf8f;">ID</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">IMGGRP</span><span style="color: #cc9393;">"</span> <span style="color: #dfaf8f;">USE</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">Images</span><span style="color: #cc9393;">"</span>&gt;

      <span style="color: #7f9f7f;">&lt;!--</span><span style="color: #7f9f7f;"> Note that the AMDID attribute contains the ID of the</span>
<span style="color: #7f9f7f;">      &lt;techMD&gt; element corresponding to the file. Note, too,</span>
<span style="color: #7f9f7f;">      the use of the GROUPID attribute, which groups together</span>
<span style="color: #7f9f7f;">      the image file and its corresponding ALTO file. </span><span style="color: #7f9f7f;">--&gt;</span>

      &lt;<span style="color: #8cd0d3;">file</span> <span style="color: #dfaf8f;">ID</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">IMG001</span><span style="color: #cc9393;">"</span> <span style="color: #dfaf8f;">AMDID</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">techmd1</span><span style="color: #cc9393;">"</span> <span style="color: #dfaf8f;">GROUPID</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">page1</span><span style="color: #cc9393;">"</span> <span style="color: #dfaf8f;">MIMETYPE</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">image/jp2</span><span style="color: #cc9393;">"</span> <span style="color: #dfaf8f;">CHECKSUM</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">xxxx</span><span style="color: #cc9393;">"</span> <span style="color: #dfaf8f;">CHECKSUMTYPE</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">SHA-1</span><span style="color: #cc9393;">"</span>&gt;
        &lt;<span style="color: #8cd0d3;">FLocat</span> <span style="color: #dfaf8f;">LOCTYPE</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">URL</span><span style="color: #cc9393;">"</span> <span style="color: #93e0e3;">xlink</span>:<span style="color: #dfaf8f;">href</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">file://.bmtnaad_1925-06-03_01_001.jp2</span><span style="color: #cc9393;">"</span>/&gt;
      &lt;/<span style="color: #8cd0d3;">file</span>&gt;
      &lt;<span style="color: #8cd0d3;">file</span> <span style="color: #dfaf8f;">ID</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">IMG002</span><span style="color: #cc9393;">"</span> <span style="color: #dfaf8f;">AMDID</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">techmd2</span><span style="color: #cc9393;">"</span> <span style="color: #dfaf8f;">GROUPID</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">page2</span><span style="color: #cc9393;">"</span> <span style="color: #dfaf8f;">MIMETYPE</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">image/jp2</span><span style="color: #cc9393;">"</span> <span style="color: #dfaf8f;">CHECKSUM</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">xxxx</span><span style="color: #cc9393;">"</span> <span style="color: #dfaf8f;">CHECKSUMTYPE</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">SHA-1</span><span style="color: #cc9393;">"</span>&gt;
        &lt;<span style="color: #8cd0d3;">FLocat</span> <span style="color: #dfaf8f;">LOCTYPE</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">URL</span><span style="color: #cc9393;">"</span> <span style="color: #93e0e3;">xlink</span>:<span style="color: #dfaf8f;">href</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">file://.bmtnaad_1925-06-03_01_002.jp2</span><span style="color: #cc9393;">"</span>/&gt;
      &lt;/<span style="color: #8cd0d3;">file</span>&gt;
    &lt;/<span style="color: #8cd0d3;">fileGrp</span>&gt;

    &lt;<span style="color: #8cd0d3;">fileGrp</span> <span style="color: #dfaf8f;">ID</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">ALTOGRP</span><span style="color: #cc9393;">"</span> <span style="color: #dfaf8f;">USE</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">OCR</span><span style="color: #cc9393;">"</span>&gt;
      &lt;<span style="color: #8cd0d3;">file</span> <span style="color: #dfaf8f;">ID</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">ALTO001</span><span style="color: #cc9393;">"</span> <span style="color: #dfaf8f;">GROUPID</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">page1</span><span style="color: #cc9393;">"</span> <span style="color: #dfaf8f;">MIMETYPE</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">text/xml</span><span style="color: #cc9393;">"</span> <span style="color: #dfaf8f;">CHECKSUM</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">xxxx</span><span style="color: #cc9393;">"</span> <span style="color: #dfaf8f;">CHECKSUMTYPE</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">SHA-1</span><span style="color: #cc9393;">"</span>&gt;
        &lt;<span style="color: #8cd0d3;">FLocat</span> <span style="color: #dfaf8f;">LOCTYPE</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">URL</span><span style="color: #cc9393;">"</span> <span style="color: #93e0e3;">xlink</span>:<span style="color: #dfaf8f;">href</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">file://.bmtnaad_1925-06-03_01_001.alto.xml</span><span style="color: #cc9393;">"</span>/&gt;
      &lt;/<span style="color: #8cd0d3;">file</span>&gt;
      &lt;<span style="color: #8cd0d3;">file</span> <span style="color: #dfaf8f;">ID</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">ALTO002</span><span style="color: #cc9393;">"</span> <span style="color: #dfaf8f;">GROUPID</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">page2</span><span style="color: #cc9393;">"</span> <span style="color: #dfaf8f;">MIMETYPE</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">text/xml</span><span style="color: #cc9393;">"</span> <span style="color: #dfaf8f;">CHECKSUM</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">xxxx</span><span style="color: #cc9393;">"</span> <span style="color: #dfaf8f;">CHECKSUMTYPE</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">SHA-1</span><span style="color: #cc9393;">"</span>&gt;
        &lt;<span style="color: #8cd0d3;">FLocat</span> <span style="color: #dfaf8f;">LOCTYPE</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">URL</span><span style="color: #cc9393;">"</span> <span style="color: #93e0e3;">xlink</span>:<span style="color: #dfaf8f;">href</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">file://.bmtnaad_1925-06-03_01_002.alto.xml</span><span style="color: #cc9393;">"</span>/&gt;
      &lt;/<span style="color: #8cd0d3;">file</span>&gt;
    &lt;/<span style="color: #8cd0d3;">fileGrp</span>&gt;
  &lt;/<span style="color: #8cd0d3;">fileSec</span>&gt;
  &lt;<span style="color: #8cd0d3;">structMap</span> <span style="color: #dfaf8f;">TYPE</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">PHYSICAL</span><span style="color: #cc9393;">"</span>&gt;
    &lt;<span style="color: #8cd0d3;">div</span>/&gt;
  &lt;/<span style="color: #8cd0d3;">structMap</span>&gt;
  &lt;<span style="color: #8cd0d3;">structMap</span> <span style="color: #dfaf8f;">TYPE</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">LOGICAL</span><span style="color: #cc9393;">"</span>&gt;
    &lt;<span style="color: #8cd0d3;">div</span>/&gt;
  &lt;/<span style="color: #8cd0d3;">structMap</span>&gt;
&lt;/<span style="color: #8cd0d3;">mets</span>&gt;
</pre>


<p>
   The root element &lt;mets&gt; contains these attributes:
</p><dl>
<dt>TYPE</dt><dd>the fixed value <i>Magazine</i>
</dd>
<dt>OBJID</dt><dd>the URN for the issue
</dd>
<dt>LABEL</dt><dd>the <i>issueid</i>
</dd>
</dl>


</div>
