doc/reference.org
**** <metsHdr>
     The <metsHdr> element shall contain two elements:
***** <agent>
      A constant value for all records:
      #+BEGIN_SRC xml
       <agent ROLE="CREATOR" TYPE="ORGANIZATION">
       	<name>Princeton University Library, Digital Initiatives</name>
       </agent>
      #+END_SRC
***** <metsDocumentID TYPE="URN">
     Contains a string whose contents is composed as follows:
      #+BEGIN_EXAMPLE
      PREFIX:ISSUID
      #+END_EXAMPLE
      Where /PREFIX/ is the following fixed value:
      #+BEGIN_EXAMPLE
      urn:PUL:bluemountain:td:
      #+END_EXAMPLE
      And /ISSUEID/ is the issue identifier, computed using the rules
      above.
**** <dmdSec>
     The record contains a single <dmdSec> element with an ID
     attribute of "dmd1"' it contains an embedded MODS record for the
     issue (described below).
**** <amdSec>
     The <amdSec> contains a /<techMD>/ element for each image file (a
     <mix> record).
**** <fileSec>
     The fileSec comprises two /<fileGrp>/ elements: one for the
     images and one for the ALTO records.
***** <fileGrp ID="IMGGRP" USE="Images">
      The /IMGGRP/ file group contains <file> elements that indicate
      the location of each image file, with attributes linking the
      file to the corresponding technical metadata and to the
      corresponding ALTO file.
****** <file>
      - /ID/ :: a unique XML id
      - AMDID :: the ID of the /<techmd>/ element corresponding to the
                 image file
      - GROUPID :: an ID that links an image file to an ALTO file.
                   The image file for a page and the ALTO file
                   containing the OCR output for that page share an id
                   (conventionally named /pageN/, where N is a
                   sequence number).
      - MIMETYPE :: the constant "image/jp2" for jpeg2000 images
      - CHECKSUM :: the checksum of the file, according to the
                    algorithm specified in /CHECKSUMTYPE/
      - CHECKSUMTYPE :: the algorithm used to compute the checksum;
                       	usually SHA-1.
******** <FLocat>
       The METS element indicating the actual file location.
       - LOCTYPE :: the constant /URL/
       - xlink:href :: the path to the file.  For this project, it will
                       be a local path.  For example:
		       #+BEGIN_EXAMPLE
		       file://./bmtnaad_1925-06-03_01_001.jp2
		       #+END_EXAMPLE
***** <fileGrp ID="ALTOGRP" USE="OCR">
      Like the /<fileGrp>/ for images, but corresponding to the ALTO
      files. (The ALTO files do not have technical metadata, so there
      is no AMDID attribute.)
**** <structMap>
     The <structMap> element describes a hierarchical arrangement of
     the parts (<div>s) making up the digital object described by the
     METS.  For this project, there are two kinds: a /physical
     structMap/, which delineates the pages of the newspaper issue in
     reading order, and a /logical structMap/, which functions as an
     outline of the newspaper's contents.  Both of these are assembled
     by docWorks, using configuration rules.
***** <structMap type="PHYSICAL">
***** <structMap type="LOGICAL">
****** The <div> hierarchy
       The outlines below show the hierarchical relationship among the
       <div> elements in the logical structMap.  Each div is described
       more fully below.

       - Magazine
	 - Volume+
	   - Issue+
	     - Contents
	       - { Article* | Illustration* | Section* }
	     - Advertisements
	       - { SponsoredAd+ | Section* }

       - Article
	 - Header*
	   - Head+
	   - Byline*
	 - Body
	   - { Paragraph* | Section* }

       - Illustration
	 - Graphic+
	 - Caption?
	   - Paragraph+

       - SponsoredAd
	 - { Graphic* | Paragraph* }

       - Section
	 - Header?
	 - Body
	   - { Article* | Illustration* | SponsoredAd* | Section* }

       - Paragraph
	 - TextBlock+

******* <div TYPE="Magazine">
       	The root <div> of the logical structMap is <div
       	TYPE="Magazine">.  It must contain one or more <div
       	TYPE="Volume"> elements (in practice it will contain only
       	one).
       	
       	Attributes:
       	- TYPE :: must be "Magazine"

       	- LABEL :: The name of the magazine, equivalent to the
                   top-level <mods:titleInfo> element.
******* <div TYPE="Volume">?
       	A <div> representing a (possibly) bound volume of issues.  In
       	most cases, we are representing each issue of a magazine
       	as a separate digital object, so the <div TYPE="Volume">
       	element will in practice contain only one <div TYPE="Issue">.

       	Attributes:
       	- TYPE :: must be "VOLUME"
       	- LABEL :: The volume caption, if present
******* <div TYPE="Issue">
       	A <div> representing the actual issue.  It contains the
       	"contents" of the paper: the editorial content and the
       	advertisements.

       	Attributes:
       	- TYPE :: must be "ISSUE"
       	- LABEL :: The issue number and the date of publication
       	- DMDID :: the ID of the <dmdSec> for the object (in practice,
                   always "dmd1")

       	The Issue <div> contains, in most cases, three sub-<div>s: <div
       	TYPE="PublicationInfo">, <div TYPE="EditorialContent"> and <div
       	TYPE="SponsoredAdvertisements">, described below.
******* <div TYPE="PublicationInfo">
       	Contains <div>s corresponding to the metadata about the
       	magazine printed in the issue itself: mastheads, nameplates,
       	folio lines, page numbers, etc.
