doc/reference.html

<div id="outline-container-4-1-2-1" class="outline-5">
<h5 id="sec-4-1-2-1"><span class="section-number-5">4.1.2.1</span> &lt;metsHdr&gt;</h5>
<div class="outline-text-5" id="text-4-1-2-1">

<p>     The &lt;metsHdr&gt; element shall contain two elements:
</p>
</div>

<div id="outline-container-4-1-2-1-1" class="outline-6">
<h6 id="sec-4-1-2-1-1"><span class="section-number-6">4.1.2.1.1</span> &lt;agent&gt;</h6>
<div class="outline-text-6" id="text-4-1-2-1-1">

<p>      A constant value for all records:
</p>


<pre class="src src-xml">&lt;<span style="color: #8cd0d3;">agent</span> <span style="color: #dfaf8f;">ROLE</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">CREATOR</span><span style="color: #cc9393;">"</span> <span style="color: #dfaf8f;">TYPE</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">ORGANIZATION</span><span style="color: #cc9393;">"</span>&gt;
 &lt;<span style="color: #8cd0d3;">name</span>&gt;Princeton University Library, Digital Initiatives&lt;/<span style="color: #8cd0d3;">name</span>&gt;
&lt;/<span style="color: #8cd0d3;">agent</span>&gt;
</pre>

</div>

</div>

<div id="outline-container-4-1-2-1-2" class="outline-6">
<h6 id="sec-4-1-2-1-2"><span class="section-number-6">4.1.2.1.2</span> &lt;metsDocumentID TYPE="URN"&gt;</h6>
<div class="outline-text-6" id="text-4-1-2-1-2">

<p>     Contains a string whose contents is composed as follows:
</p>


<pre class="example">PREFIX:ISSUID
</pre>

<p>
      Where <i>PREFIX</i> is the following fixed value:
</p>


<pre class="example">urn:PUL:bluemountain:td:
</pre>

<p>
      And <i>ISSUEID</i> is the issue identifier, computed using the rules
      above.
</p></div>
</div>

</div>

<div id="outline-container-4-1-2-2" class="outline-5">
<h5 id="sec-4-1-2-2"><span class="section-number-5">4.1.2.2</span> &lt;dmdSec&gt;</h5>
<div class="outline-text-5" id="text-4-1-2-2">

<p>     The record contains a single &lt;dmdSec&gt; element with an ID
     attribute of "dmd1"' it contains an embedded MODS record for the
     issue (described below).
</p></div>

</div>

<div id="outline-container-4-1-2-3" class="outline-5">
<h5 id="sec-4-1-2-3"><span class="section-number-5">4.1.2.3</span> &lt;amdSec&gt;</h5>
<div class="outline-text-5" id="text-4-1-2-3">

<p>     The &lt;amdSec&gt; contains a <i>&lt;techMD&gt;</i> element for each image file (a
     &lt;mix&gt; record).
</p></div>

</div>

<div id="outline-container-4-1-2-4" class="outline-5">
<h5 id="sec-4-1-2-4"><span class="section-number-5">4.1.2.4</span> &lt;fileSec&gt;</h5>
<div class="outline-text-5" id="text-4-1-2-4">

<p>     The fileSec comprises two <i>&lt;fileGrp&gt;</i> elements: one for the
     images and one for the ALTO records.
</p>
</div>

<div id="outline-container-4-1-2-4-1" class="outline-6">
<h6 id="sec-4-1-2-4-1"><span class="section-number-6">4.1.2.4.1</span> &lt;fileGrp ID="IMGGRP" USE="Images"&gt;</h6>
<div class="outline-text-6" id="text-4-1-2-4-1">

<p>      The <i>IMGGRP</i> file group contains &lt;file&gt; elements that indicate
      the location of each image file, with attributes linking the
      file to the corresponding technical metadata and to the
      corresponding ALTO file.
</p>
</div>

<div id="outline-container-4-1-2-4-1-1" class="outline-7">
<h7 id="sec-4-1-2-4-1-1"><span class="section-number-7">4.1.2.4.1.1</span> &lt;file&gt;</h7>
<div class="outline-text-7" id="text-4-1-2-4-1-1">

<dl>
<dt><i>ID</i></dt><dd>a unique XML id
</dd>
<dt>AMDID</dt><dd>the ID of the <i>&lt;techmd&gt;</i> element corresponding to the
                 image file
</dd>
<dt>GROUPID</dt><dd>an ID that links an image file to an ALTO file.
                   The image file for a page and the ALTO file
                   containing the OCR output for that page share an id
                   (conventionally named <i>pageN</i>, where N is a
                   sequence number).
</dd>
<dt>MIMETYPE</dt><dd>the constant "image/jp2" for jpeg2000 images
</dd>
<dt>CHECKSUM</dt><dd>the checksum of the file, according to the
                    algorithm specified in <i>CHECKSUMTYPE</i>
</dd>
<dt>CHECKSUMTYPE</dt><dd>the algorithm used to compute the checksum;
                        usually SHA-1.
</dd>
</dl>

<ul>
<li id="sec-4-1-2-4-1-1-1">&lt;FLocat&gt;<br/>
       The METS element indicating the actual file location.
<dl>
<dt>LOCTYPE</dt><dd>the constant <i>URL</i>
</dd>
<dt>xlink:href</dt><dd>the path to the file.  For this project, it will
                       be a local path.  For example:



<pre class="example">file://./bmtnaad_1925-06-03_01_001.jp2
</pre>

</dd>
</dl>

</li>
</ul>
</div>
</div>

</div>

<div id="outline-container-4-1-2-4-2" class="outline-6">
<h6 id="sec-4-1-2-4-2"><span class="section-number-6">4.1.2.4.2</span> &lt;fileGrp ID="ALTOGRP" USE="OCR"&gt;</h6>
<div class="outline-text-6" id="text-4-1-2-4-2">

<p>      Like the <i>&lt;fileGrp&gt;</i> for images, but corresponding to the ALTO
      files. (The ALTO files do not have technical metadata, so there
      is no AMDID attribute.)
</p></div>
</div>

</div>

<div id="outline-container-4-1-2-5" class="outline-5">
<h5 id="sec-4-1-2-5"><span class="section-number-5">4.1.2.5</span> &lt;structMap&gt;</h5>
<div class="outline-text-5" id="text-4-1-2-5">

<p>     The &lt;structMap&gt; element describes a hierarchical arrangement of
     the parts (&lt;div&gt;s) making up the digital object described by the
     METS.  For this project, there are two kinds: a <i>physical      structMap</i>, which delineates the pages of the newspaper issue in
     reading order, and a <i>logical structMap</i>, which functions as an
     outline of the newspaper's contents.  Both of these are assembled
     by docWorks, using configuration rules.
</p>
</div>

<div id="outline-container-4-1-2-5-1" class="outline-6">
<h6 id="sec-4-1-2-5-1"><span class="section-number-6">4.1.2.5.1</span> &lt;structMap type="PHYSICAL"&gt;</h6>
<div class="outline-text-6" id="text-4-1-2-5-1">

</div>

</div>

<div id="outline-container-4-1-2-5-2" class="outline-6">
<h6 id="sec-4-1-2-5-2"><span class="section-number-6">4.1.2.5.2</span> &lt;structMap type="LOGICAL"&gt;</h6>
<div class="outline-text-6" id="text-4-1-2-5-2">


</div>

<div id="outline-container-4-1-2-5-2-1" class="outline-7">
<h7 id="sec-4-1-2-5-2-1"><span class="section-number-7">4.1.2.5.2.1</span> The &lt;div&gt; hierarchy</h7>
<div class="outline-text-7" id="text-4-1-2-5-2-1">

<p>       The outlines below show the hierarchical relationship among the
       &lt;div&gt; elements in the logical structMap.  Each div is described
       more fully below.
</p>
<ul>
<li>Magazine
<ul>
<li>Volume+
<ul>
<li>Issue+
<ul>
<li>Contents
<ul>
<li>{ Article* | Illustration* | Section* }
</li>
</ul>

</li>
<li>Advertisements
<ul>
<li>{ SponsoredAd+ | Section* }

</li>
</ul>

</li>
</ul>

</li>
</ul>

</li>
</ul>

</li>
<li>Article
<ul>
<li>Header*
<ul>
<li>Head+
</li>
<li>Byline*
</li>
</ul>

</li>
<li>Body
<ul>
<li>{ Paragraph* | Section* }

</li>
</ul>

</li>
</ul>

</li>
<li>Illustration
<ul>
<li>Graphic+
</li>
<li>Caption?
<ul>
<li>Paragraph+

</li>
</ul>

</li>
</ul>

</li>
<li>SponsoredAd
<ul>
<li>{ Graphic* | Paragraph* }

</li>
</ul>

</li>
<li>Section
<ul>
<li>Header?
</li>
<li>Body
<ul>
<li>{ Article* | Illustration* | SponsoredAd* | Section* }

</li>
</ul>

</li>
</ul>

</li>
<li>Paragraph
<ul>
<li>TextBlock+
</li>
</ul>

</li>
</ul>


<ul>
<li id="sec-4-1-2-5-2-1-1">&lt;div TYPE="Magazine"&gt;<br/>
        The root &lt;div&gt; of the logical structMap is &lt;div
        TYPE="Magazine"&gt;.  It must contain one or more &lt;div
        TYPE="Volume"&gt; elements (in practice it will contain only
        one).

<p>        
        Attributes:
</p><dl>
<dt>TYPE</dt><dd>must be "Magazine"

</dd>
<dt>LABEL</dt><dd>The name of the magazine, equivalent to the
                   top-level &lt;mods:titleInfo&gt; element.
</dd>
</dl>

</li>
</ul>
<ul>
<li id="sec-4-1-2-5-2-1-2">&lt;div TYPE="Volume"&gt;?<br/>
        A &lt;div&gt; representing a (possibly) bound volume of issues.  In
        most cases, we are representing each issue of a magazine
        as a separate digital object, so the &lt;div TYPE="Volume"&gt;
        element will in practice contain only one &lt;div TYPE="Issue"&gt;.

<p>
        Attributes:
</p><dl>
<dt>TYPE</dt><dd>must be "VOLUME"
</dd>
<dt>LABEL</dt><dd>The volume caption, if present
</dd>
</dl>

</li>
</ul>
<ul>
<li id="sec-4-1-2-5-2-1-3">&lt;div TYPE="Issue"&gt;<br/>
        A &lt;div&gt; representing the actual issue.  It contains the
        "contents" of the paper: the editorial content and the
        advertisements.

<p>
        Attributes:
</p><dl>
<dt>TYPE</dt><dd>must be "ISSUE"
</dd>
<dt>LABEL</dt><dd>The issue number and the date of publication
</dd>
<dt>DMDID</dt><dd>the ID of the &lt;dmdSec&gt; for the object (in practice,
                   always "dmd1")
</dd>
</dl>


<p>
        The Issue &lt;div&gt; contains, in most cases, three sub-&lt;div&gt;s: &lt;div
        TYPE="PublicationInfo"&gt;, &lt;div TYPE="EditorialContent"&gt; and &lt;div
        TYPE="SponsoredAdvertisements"&gt;, described below.
</p></li>
</ul>
<ul>
<li id="sec-4-1-2-5-2-1-4">&lt;div TYPE="PublicationInfo"&gt;<br/>
        Contains &lt;div&gt;s corresponding to the metadata about the
        magazine printed in the issue itself: mastheads, nameplates,
        folio lines, page numbers, etc.
</li>
</ul>
<ul>
