doc/reference.org
******* <div TYPE="EditorialContent" LABEL="Contents">
       	Contains <div>s corresponding to the TextContent and
       	Illustration elements, in publication order.  These elements
       	have DMDID attributes whose values link them to the
       	corresponding <relatedItem> elements in the <mods> record.
******* <div TYPE="SponsoredAdvertisements" LABEL="Advertisements">
       	Contains <div>s corresponding to the SponsoredAdvertisement
       	elements, in publication order.  These elements have DMDID
       	attributes whose values link them to the corresponding
       	<relatedItem> elements in the <mods> record.

******* <div TYPE="TextContent">
       	A <div> representing a piece of editorial content: an article,
       	a review, a letter, a poem, etc.

       	Editorial content takes a number of forms: it may or may not
       	have a headline; it may or may not have a byline; it may have
       	subsections, each with its own headline (subhead).

       	A TextContent <div> MAY contain a <div TYPE="Header">; it will
       	always have a <div TYPE="Body">.

       	Attributes:
       	- TYPE :: must be "TextContent"
       	- DMDID :: the ID of the <mods:relatedItem type="constituent">
                   element corresponding to this piece in the newspaper.
       	- LABEL :: SHOULD be equivalent to the contents of the
                   mods:relatedItem/mods:titleInfo/mods:title element

******* <div TYPE="Header">
       	A <div> containing the component's (the TextContent, SponsoredAd,
       	or Section) heading information: a combination of headline and
       	byline.  The Header may contain one or more Head elements
       	(encompassing, for example, a headline and a subhead); it may
       	also contain one or more Byline elements (which may not
       	necessarily be physically contiguous in the physical layout of
       	the page).

       	Attributes:
       	- TYPE :: must be "Header"

******* <div TYPE="Head">
       	A <div> designating the region associated with a head of some
       	kind: a headline, a subhead, etc.

       	Attributes:
       	- TYPE :: must be "Head"
******* <div TYPE="Byline">
       	A <div> designating one or more regions associated with the
       	writer of an article: usually the writer's name, but sometimes
       	also the writer's position or other biographical information.

       	Attributes:
       	- TYPE :: must be "Byline"


******* <div TYPE="Body">
       	A container <div> for the body of an article or
       	section.  A BODY may contain paragraphs, illustrations, or
       	sections, in any order.

******* <div TYPE="Paragraph">
       	A <div> that contains one or more text blocks representing the
       	contents of a logical paragraph.  Paragraphs have a sequential
       	order within their containing article, caption, or sponsored
       	ad.

       	Attributes:
       	- TYPE :: must be "Paragraph"
       	- ORDER :: the index of the paragraph in its containing div
                   (1, 2, etc.).

******* <div TYPE="Section">
       	A section is a container <div> of other <div>s.  It may or may
       	not have a Header; it will contain some combination of
       	articles, illustrations, SponsoredAds, and other sections.

******* <div TYPE="Illustration">

******* <div TYPE="Graphic">
       	A div designating the location of a graphic on the page.


******* <div TYPE="Caption">

******* <div TYPE="SponsoredAd">

******* <div TYPE="TextBlock">
       	A div designating the region of a block of text on a page.

** MODS Profile
   There are two kinds of MODS records in Blue Mountain:

   1. Title-level MODS
   2. Issue-level MODS

