doc/reference.html
<li id="sec-4-1-2-5-2-1-5">&lt;div TYPE="EditorialContent" LABEL="Contents"&gt;<br/>
        Contains &lt;div&gt;s corresponding to the TextContent and
        Illustration elements, in publication order.  These elements
        have DMDID attributes whose values link them to the
        corresponding &lt;relatedItem&gt; elements in the &lt;mods&gt; record.
</li>
</ul>
<ul>
<li id="sec-4-1-2-5-2-1-6">&lt;div TYPE="SponsoredAdvertisements" LABEL="Advertisements"&gt;<br/>
        Contains &lt;div&gt;s corresponding to the SponsoredAdvertisement
        elements, in publication order.  These elements have DMDID
        attributes whose values link them to the corresponding
        &lt;relatedItem&gt; elements in the &lt;mods&gt; record.

</li>
</ul>
<ul>
<li id="sec-4-1-2-5-2-1-7">&lt;div TYPE="TextContent"&gt;<br/>
        A &lt;div&gt; representing a piece of editorial content: an article,
        a review, a letter, a poem, etc.

<p>
        Editorial content takes a number of forms: it may or may not
        have a headline; it may or may not have a byline; it may have
        subsections, each with its own headline (subhead).
</p>
<p>
        A TextContent &lt;div&gt; MAY contain a &lt;div TYPE="Header"&gt;; it will
        always have a &lt;div TYPE="Body"&gt;.
</p>
<p>
        Attributes:
</p><dl>
<dt>TYPE</dt><dd>must be "TextContent"
</dd>
<dt>DMDID</dt><dd>the ID of the &lt;mods:relatedItem type="constituent"&gt;
                   element corresponding to this piece in the newspaper.
</dd>
<dt>LABEL</dt><dd>SHOULD be equivalent to the contents of the
                   mods:relatedItem/mods:titleInfo/mods:title element
</dd>
</dl>


</li>
</ul>
<ul>
<li id="sec-4-1-2-5-2-1-8">&lt;div TYPE="Header"&gt;<br/>
        A &lt;div&gt; containing the component's (the TextContent, SponsoredAd,
        or Section) heading information: a combination of headline and
        byline.  The Header may contain one or more Head elements
        (encompassing, for example, a headline and a subhead); it may
        also contain one or more Byline elements (which may not
        necessarily be physically contiguous in the physical layout of
        the page).

<p>
        Attributes:
</p><dl>
<dt>TYPE</dt><dd>must be "Header"
</dd>
</dl>


</li>
</ul>
<ul>
<li id="sec-4-1-2-5-2-1-9">&lt;div TYPE="Head"&gt;<br/>
        A &lt;div&gt; designating the region associated with a head of some
        kind: a headline, a subhead, etc.

<p>
        Attributes:
</p><dl>
<dt>TYPE</dt><dd>must be "Head"
</dd>
</dl>

</li>
</ul>
<ul>
<li id="sec-4-1-2-5-2-1-10">&lt;div TYPE="Byline"&gt;<br/>
        A &lt;div&gt; designating one or more regions associated with the
        writer of an article: usually the writer's name, but sometimes
        also the writer's position or other biographical information.

<p>
        Attributes:
</p><dl>
<dt>TYPE</dt><dd>must be "Byline"
</dd>
</dl>



</li>
</ul>
<ul>
<li id="sec-4-1-2-5-2-1-11">&lt;div TYPE="Body"&gt;<br/>
        A container &lt;div&gt; for the body of an article or
        section.  A BODY may contain paragraphs, illustrations, or
        sections, in any order.

</li>
</ul>
<ul>
<li id="sec-4-1-2-5-2-1-12">&lt;div TYPE="Paragraph"&gt;<br/>
        A &lt;div&gt; that contains one or more text blocks representing the
        contents of a logical paragraph.  Paragraphs have a sequential
        order within their containing article, caption, or sponsored
        ad.

<p>
        Attributes:
</p><dl>
<dt>TYPE</dt><dd>must be "Paragraph"
</dd>
<dt>ORDER</dt><dd>the index of the paragraph in its containing div
                   (1, 2, etc.).
</dd>
</dl>


</li>
</ul>
<ul>
<li id="sec-4-1-2-5-2-1-13">&lt;div TYPE="Section"&gt;<br/>
        A section is a container &lt;div&gt; of other &lt;div&gt;s.  It may or may
        not have a Header; it will contain some combination of
        articles, illustrations, SponsoredAds, and other sections.

</li>
</ul>
<ul>
<li id="sec-4-1-2-5-2-1-14">&lt;div TYPE="Illustration"&gt;<br/>

</li>
</ul>
<ul>
<li id="sec-4-1-2-5-2-1-15">&lt;div TYPE="Graphic"&gt;<br/>
        A div designating the location of a graphic on the page.


</li>
</ul>
<ul>
<li id="sec-4-1-2-5-2-1-16">&lt;div TYPE="Caption"&gt;<br/>

</li>
</ul>
<ul>
<li id="sec-4-1-2-5-2-1-17">&lt;div TYPE="SponsoredAd"&gt;<br/>

</li>
</ul>
<ul>
<li id="sec-4-1-2-5-2-1-18">&lt;div TYPE="TextBlock"&gt;<br/>
        A div designating the region of a block of text on a page.

</li>
</ul>
</div>
</div>
</div>
</div>
</div>

</div>
