doc/reference.org
*** Title-Level MODS
    The descriptive metadata for most, if not all, of the Blue
    Mountain titles has been taken from MARC records retrieved from
    Princeton's OPAC and machine-converted, then edited and enhanced
    by hand.  Here is a sample:

    #+BEGIN_SRC xml -n
  <?xml version="1.0" encoding="UTF-8"?>
  <mods xmlns="http://www.loc.gov/mods/v3">

    <identifier type="bmtn">urn:PUL:bluemountain:bmtnaad</identifier> <!-- (ref:identifier) -->

    <recordInfo>
      <recordIdentifier>urn:PUL:bluemountain:dmd:bmtnaad</recordIdentifier> <!-- (ref:ridentifier) -->
      <recordContentSource authority="marcorg">NjP</recordContentSource>
      <recordOrigin>http://catalog.princeton.edu/cgi-bin/Pwebrecon.cgi?BBID=4939605</recordOrigin>
      <languageOfCataloging>
       	<languageTerm authority="iso639-2b" type="code">eng</languageTerm>
      </languageOfCataloging>
    </recordInfo>
    
    <titleInfo>
      <nonSort>Le</nonSort>
      <title>coeur à barbe</title>
      <subTitle>journal transparent</subTitle>
    </titleInfo>

    <name type="personal" authority="viaf" valueURI="http://viaf.org/viaf/73848255">
      <namePart type="family">Eluard</namePart>
      <namePart type="given">Paul</namePart>
      <namePart type="date">1895-1952</namePart>
    </name>
    <name type="personal" authority="viaf" valueURI="http://viaf.org/viaf/96123513">
      <namePart type="family">Ribemont-Dessaignes</namePart>
      <namePart type="given">Georges</namePart>
      <namePart type="date">1884-1974</namePart>
    </name>
    <name type="personal" authority="viaf" valueURI="http://viaf.org/viaf/27072443">
      <namePart type="family">Tzara</namePart>
      <namePart type="given">Tristan</namePart>
      <namePart type="date">1896-1963</namePart>
    </name>

    <typeOfResource>text</typeOfResource>

    <originInfo script="Latn">
      <place>
       	<placeTerm type="text">Paris</placeTerm>
      </place>
      <dateIssued>1922</dateIssued>
      <dateIssued encoding="iso8601" point="start">1922</dateIssued>
      <dateIssued encoding="iso8601" point="end">1922</dateIssued>
    </originInfo>
    <language>
      <languageTerm authority="iso639-2b" type="code">fre</languageTerm>
    </language>
    <subject authority="lcsh">
      <topic>Dadaism</topic>
      <genre>Periodicals</genre>
    </subject>
    <subject authority="lcsh">
      <topic>Dadaism</topic>
      <geographic>France</geographic>
      <genre>Periodicals</genre>
    </subject>
  </mods>
    #+END_SRC
    - The MODS record contains an [[(identifer)][<identifier>]] element whose type is
      /bmtn/.  Its value is a URN for the title, which is of the form

      #+BEGIN_EXAMPLE
       	urn:PUL:bluemountain:BMTNID
      #+END_EXAMPLE

      where the string /urn:PUL:bluemountain/ is constant (for all
      Blue Mountain URNs) and /BMTNID/ is the Blue Mountain project
      identifier of the periodical.

    - The MODS record also contains a <recordInfo> element, which
      provides a link back to the original OPAC record, as well as a
      [[(ridentifier)][<recordIdentifier>]] uniquely identifying the record itself; it is
      simply the journal URN with /dmd/ inserted into the identifier:
      #+BEGIN_EXAMPLE
       	urn:PUL:bluemountain:dmd:BMTNID
      #+END_EXAMPLE
    - The <name> elements are associated with authorities to enhance
      search and broaden the interconnectedness of the
      data.  http://viaf.org is the preferred authority;
      http://id.loc.gov should be consulted when a name is not found
      in viaf.org; if a name is found in neither, a local authority
      will be created (To be determined later).
    - Dates are encoded in ISO standard 8601 format (see
      http://www.iso.org/iso/catalogue_detail?csnumber=40874; for an
      overview see http://en.wikipedia.org/wiki/ISO_8601).  The
      extended form of the representation is preferred.
    - Subject headings will conform with existing standards in a
      manner yet to be determined.
