doc/reference.html

<div id="outline-container-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> MODS Profile</h3>
<div class="outline-text-3" id="text-4-2">

<p>   There are two kinds of MODS records in Blue Mountain:
</p>
<ol>
<li>Title-level MODS
</li>
<li>Issue-level MODS
</li>
</ol>



</div>

<div id="outline-container-4-2-1" class="outline-4">
<h4 id="sec-4-2-1"><span class="section-number-4">4.2.1</span> Title-Level MODS</h4>
<div class="outline-text-4" id="text-4-2-1">

<p>    The descriptive metadata for most, if not all, of the Blue
    Mountain titles has been taken from MARC records retrieved from
    Princeton's OPAC and machine-converted, then edited and enhanced
    by hand.  Here is a sample:
</p>



<pre class="src src-xml"><span class="linenr"> 1:  </span>&lt;?<span style="color: #f0dfaf; font-weight: bold;">xml</span> <span style="color: #dfaf8f;">version</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">1.0</span><span style="color: #cc9393;">"</span> <span style="color: #dfaf8f;">encoding</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">UTF-8</span><span style="color: #cc9393;">"</span>?&gt;
<span class="linenr"> 2:  </span>&lt;<span style="color: #8cd0d3;">mods</span> <span style="color: #93e0e3;">xmlns</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">http://www.loc.gov/mods/v3</span><span style="color: #cc9393;">"</span>&gt;
<span class="linenr"> 3:  </span>
<span id="coderef-identifier" class="coderef-off"><span class="linenr"> 4:  </span>  &lt;<span style="color: #8cd0d3;">identifier</span> <span style="color: #dfaf8f;">type</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">bmtn</span><span style="color: #cc9393;">"</span>&gt;urn:PUL:bluemountain:bmtnaad&lt;/<span style="color: #8cd0d3;">identifier</span>&gt; <span style="color: #7f9f7f;">&lt;!--</span><span style="color: #7f9f7f;"> (identifier) </span><span style="color: #7f9f7f;">--&gt;</span></span>
<span class="linenr"> 5:  </span>
<span class="linenr"> 6:  </span>  &lt;<span style="color: #8cd0d3;">recordInfo</span>&gt;
<span id="coderef-ridentifier" class="coderef-off"><span class="linenr"> 7:  </span>    &lt;<span style="color: #8cd0d3;">recordIdentifier</span>&gt;urn:PUL:bluemountain:dmd:bmtnaad&lt;/<span style="color: #8cd0d3;">recordIdentifier</span>&gt; <span style="color: #7f9f7f;">&lt;!--</span><span style="color: #7f9f7f;"> (ridentifier) </span><span style="color: #7f9f7f;">--&gt;</span></span>
<span class="linenr"> 8:  </span>    &lt;<span style="color: #8cd0d3;">recordContentSource</span> <span style="color: #dfaf8f;">authority</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">marcorg</span><span style="color: #cc9393;">"</span>&gt;NjP&lt;/<span style="color: #8cd0d3;">recordContentSource</span>&gt;
<span class="linenr"> 9:  </span>    &lt;<span style="color: #8cd0d3;">recordOrigin</span>&gt;http://catalog.princeton.edu/cgi-bin/Pwebrecon.cgi?BBID=4939605&lt;/<span style="color: #8cd0d3;">recordOrigin</span>&gt;
<span class="linenr">10:  </span>    &lt;<span style="color: #8cd0d3;">languageOfCataloging</span>&gt;
<span class="linenr">11:  </span>      &lt;<span style="color: #8cd0d3;">languageTerm</span> <span style="color: #dfaf8f;">authority</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">iso639-2b</span><span style="color: #cc9393;">"</span> <span style="color: #dfaf8f;">type</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">code</span><span style="color: #cc9393;">"</span>&gt;eng&lt;/<span style="color: #8cd0d3;">languageTerm</span>&gt;
<span class="linenr">12:  </span>    &lt;/<span style="color: #8cd0d3;">languageOfCataloging</span>&gt;
<span class="linenr">13:  </span>  &lt;/<span style="color: #8cd0d3;">recordInfo</span>&gt;
<span class="linenr">14:  </span>
<span class="linenr">15:  </span>  &lt;<span style="color: #8cd0d3;">titleInfo</span>&gt;
<span class="linenr">16:  </span>    &lt;<span style="color: #8cd0d3;">nonSort</span>&gt;Le&lt;/<span style="color: #8cd0d3;">nonSort</span>&gt;
<span class="linenr">17:  </span>    &lt;<span style="color: #8cd0d3;">title</span>&gt;coeur &#224; barbe&lt;/<span style="color: #8cd0d3;">title</span>&gt;
<span class="linenr">18:  </span>    &lt;<span style="color: #8cd0d3;">subTitle</span>&gt;journal transparent&lt;/<span style="color: #8cd0d3;">subTitle</span>&gt;
<span class="linenr">19:  </span>  &lt;/<span style="color: #8cd0d3;">titleInfo</span>&gt;
<span class="linenr">20:  </span>
<span class="linenr">21:  </span>  &lt;<span style="color: #8cd0d3;">name</span> <span style="color: #dfaf8f;">type</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">personal</span><span style="color: #cc9393;">"</span> <span style="color: #dfaf8f;">authority</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">viaf</span><span style="color: #cc9393;">"</span> <span style="color: #dfaf8f;">valueURI</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">http://viaf.org/viaf/73848255</span><span style="color: #cc9393;">"</span>&gt;
<span class="linenr">22:  </span>    &lt;<span style="color: #8cd0d3;">namePart</span> <span style="color: #dfaf8f;">type</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">family</span><span style="color: #cc9393;">"</span>&gt;Eluard&lt;/<span style="color: #8cd0d3;">namePart</span>&gt;
<span class="linenr">23:  </span>    &lt;<span style="color: #8cd0d3;">namePart</span> <span style="color: #dfaf8f;">type</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">given</span><span style="color: #cc9393;">"</span>&gt;Paul&lt;/<span style="color: #8cd0d3;">namePart</span>&gt;
<span class="linenr">24:  </span>    &lt;<span style="color: #8cd0d3;">namePart</span> <span style="color: #dfaf8f;">type</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">date</span><span style="color: #cc9393;">"</span>&gt;1895-1952&lt;/<span style="color: #8cd0d3;">namePart</span>&gt;
<span class="linenr">25:  </span>  &lt;/<span style="color: #8cd0d3;">name</span>&gt;
<span class="linenr">26:  </span>  &lt;<span style="color: #8cd0d3;">name</span> <span style="color: #dfaf8f;">type</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">personal</span><span style="color: #cc9393;">"</span> <span style="color: #dfaf8f;">authority</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">viaf</span><span style="color: #cc9393;">"</span> <span style="color: #dfaf8f;">valueURI</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">http://viaf.org/viaf/96123513</span><span style="color: #cc9393;">"</span>&gt;
<span class="linenr">27:  </span>    &lt;<span style="color: #8cd0d3;">namePart</span> <span style="color: #dfaf8f;">type</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">family</span><span style="color: #cc9393;">"</span>&gt;Ribemont-Dessaignes&lt;/<span style="color: #8cd0d3;">namePart</span>&gt;
<span class="linenr">28:  </span>    &lt;<span style="color: #8cd0d3;">namePart</span> <span style="color: #dfaf8f;">type</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">given</span><span style="color: #cc9393;">"</span>&gt;Georges&lt;/<span style="color: #8cd0d3;">namePart</span>&gt;
<span class="linenr">29:  </span>    &lt;<span style="color: #8cd0d3;">namePart</span> <span style="color: #dfaf8f;">type</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">date</span><span style="color: #cc9393;">"</span>&gt;1884-1974&lt;/<span style="color: #8cd0d3;">namePart</span>&gt;
<span class="linenr">30:  </span>  &lt;/<span style="color: #8cd0d3;">name</span>&gt;
<span class="linenr">31:  </span>  &lt;<span style="color: #8cd0d3;">name</span> <span style="color: #dfaf8f;">type</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">personal</span><span style="color: #cc9393;">"</span> <span style="color: #dfaf8f;">authority</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">viaf</span><span style="color: #cc9393;">"</span> <span style="color: #dfaf8f;">valueURI</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">http://viaf.org/viaf/27072443</span><span style="color: #cc9393;">"</span>&gt;
<span class="linenr">32:  </span>    &lt;<span style="color: #8cd0d3;">namePart</span> <span style="color: #dfaf8f;">type</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">family</span><span style="color: #cc9393;">"</span>&gt;Tzara&lt;/<span style="color: #8cd0d3;">namePart</span>&gt;
<span class="linenr">33:  </span>    &lt;<span style="color: #8cd0d3;">namePart</span> <span style="color: #dfaf8f;">type</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">given</span><span style="color: #cc9393;">"</span>&gt;Tristan&lt;/<span style="color: #8cd0d3;">namePart</span>&gt;
<span class="linenr">34:  </span>    &lt;<span style="color: #8cd0d3;">namePart</span> <span style="color: #dfaf8f;">type</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">date</span><span style="color: #cc9393;">"</span>&gt;1896-1963&lt;/<span style="color: #8cd0d3;">namePart</span>&gt;
<span class="linenr">35:  </span>  &lt;/<span style="color: #8cd0d3;">name</span>&gt;
<span class="linenr">36:  </span>
<span class="linenr">37:  </span>  &lt;<span style="color: #8cd0d3;">typeOfResource</span>&gt;text&lt;/<span style="color: #8cd0d3;">typeOfResource</span>&gt;
<span class="linenr">38:  </span>
<span class="linenr">39:  </span>  &lt;<span style="color: #8cd0d3;">originInfo</span> <span style="color: #dfaf8f;">script</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">Latn</span><span style="color: #cc9393;">"</span>&gt;
<span class="linenr">40:  </span>    &lt;<span style="color: #8cd0d3;">place</span>&gt;
<span class="linenr">41:  </span>      &lt;<span style="color: #8cd0d3;">placeTerm</span> <span style="color: #dfaf8f;">type</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">text</span><span style="color: #cc9393;">"</span>&gt;Paris&lt;/<span style="color: #8cd0d3;">placeTerm</span>&gt;
<span class="linenr">42:  </span>    &lt;/<span style="color: #8cd0d3;">place</span>&gt;
<span class="linenr">43:  </span>    &lt;<span style="color: #8cd0d3;">dateIssued</span>&gt;1922&lt;/<span style="color: #8cd0d3;">dateIssued</span>&gt;
<span class="linenr">44:  </span>    &lt;<span style="color: #8cd0d3;">dateIssued</span> <span style="color: #dfaf8f;">encoding</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">iso8601</span><span style="color: #cc9393;">"</span> <span style="color: #dfaf8f;">point</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">start</span><span style="color: #cc9393;">"</span>&gt;1922&lt;/<span style="color: #8cd0d3;">dateIssued</span>&gt;
<span class="linenr">45:  </span>    &lt;<span style="color: #8cd0d3;">dateIssued</span> <span style="color: #dfaf8f;">encoding</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">iso8601</span><span style="color: #cc9393;">"</span> <span style="color: #dfaf8f;">point</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">end</span><span style="color: #cc9393;">"</span>&gt;1922&lt;/<span style="color: #8cd0d3;">dateIssued</span>&gt;
<span class="linenr">46:  </span>  &lt;/<span style="color: #8cd0d3;">originInfo</span>&gt;
<span class="linenr">47:  </span>  &lt;<span style="color: #8cd0d3;">language</span>&gt;
<span class="linenr">48:  </span>    &lt;<span style="color: #8cd0d3;">languageTerm</span> <span style="color: #dfaf8f;">authority</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">iso639-2b</span><span style="color: #cc9393;">"</span> <span style="color: #dfaf8f;">type</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">code</span><span style="color: #cc9393;">"</span>&gt;fre&lt;/<span style="color: #8cd0d3;">languageTerm</span>&gt;
<span class="linenr">49:  </span>  &lt;/<span style="color: #8cd0d3;">language</span>&gt;
<span class="linenr">50:  </span>  &lt;<span style="color: #8cd0d3;">subject</span> <span style="color: #dfaf8f;">authority</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">lcsh</span><span style="color: #cc9393;">"</span>&gt;
<span class="linenr">51:  </span>    &lt;<span style="color: #8cd0d3;">topic</span>&gt;Dadaism&lt;/<span style="color: #8cd0d3;">topic</span>&gt;
<span class="linenr">52:  </span>    &lt;<span style="color: #8cd0d3;">genre</span>&gt;Periodicals&lt;/<span style="color: #8cd0d3;">genre</span>&gt;
<span class="linenr">53:  </span>  &lt;/<span style="color: #8cd0d3;">subject</span>&gt;
<span class="linenr">54:  </span>  &lt;<span style="color: #8cd0d3;">subject</span> <span style="color: #dfaf8f;">authority</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">lcsh</span><span style="color: #cc9393;">"</span>&gt;
<span class="linenr">55:  </span>    &lt;<span style="color: #8cd0d3;">topic</span>&gt;Dadaism&lt;/<span style="color: #8cd0d3;">topic</span>&gt;
<span class="linenr">56:  </span>    &lt;<span style="color: #8cd0d3;">geographic</span>&gt;France&lt;/<span style="color: #8cd0d3;">geographic</span>&gt;
<span class="linenr">57:  </span>    &lt;<span style="color: #8cd0d3;">genre</span>&gt;Periodicals&lt;/<span style="color: #8cd0d3;">genre</span>&gt;
<span class="linenr">58:  </span>  &lt;/<span style="color: #8cd0d3;">subject</span>&gt;
<span class="linenr">59:  </span>&lt;/<span style="color: #8cd0d3;">mods</span>&gt;
</pre>

<ul>
<li>The MODS record contains an <a href="#coderef-identifer" class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-identifer');" onmouseout="CodeHighlightOff(this, 'coderef-identifer');">&lt;identifier&gt;</a> element whose type is
      <i>bmtn</i>.  Its value is a URN for the title, which is of the form




<pre class="example">urn:PUL:bluemountain:BMTNID
</pre>


<p>
      where the string <i>urn:PUL:bluemountain</i> is constant (for all
      Blue Mountain URNs) and <i>BMTNID</i> is the Blue Mountain project
      identifier of the periodical.
</p>
</li>
<li>The MODS record also contains a &lt;recordInfo&gt; element, which
      provides a link back to the original OPAC record, as well as a
      <a href="#coderef-ridentifier" class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-ridentifier');" onmouseout="CodeHighlightOff(this, 'coderef-ridentifier');">&lt;recordIdentifier&gt;</a> uniquely identifying the record itself; it is
      simply the journal URN with <i>dmd</i> inserted into the identifier:



<pre class="example">urn:PUL:bluemountain:dmd:BMTNID
</pre>

</li>
<li>The &lt;name&gt; elements are associated with authorities to enhance
      search and broaden the interconnectedness of the
      data.  <a href="http://viaf.org">http://viaf.org</a> is the preferred authority;
      <a href="http://id.loc.gov">http://id.loc.gov</a> should be consulted when a name is not found
      in viaf.org; if a name is found in neither, a local authority
      will be created (To be determined later).
</li>
<li>Dates are encoded in ISO standard 8601 format (see
      <a href="http://www.iso.org/iso/catalogue_detail?csnumber=40874">http://www.iso.org/iso/catalogue\_detail?csnumber=40874</a>; for an
      overview see <a href="http://en.wikipedia.org/wiki/ISO_8601">http://en.wikipedia.org/wiki/ISO\_8601</a>).  The
      extended form of the representation is preferred.
</li>
<li>Subject headings will conform with existing standards in a
      manner yet to be determined.
</li>
</ul>

</div>

</div>
