doc/reference.org
*** Issue-Level MODS
    Blue Mountain encodes descriptive metadata for the contents of
    each magazine issue, so the issues may be searched and analyzed.

    #+BEGIN_SRC xml
    	<mods xmlns="http://www.loc.gov/mods/v3">
	  <recordInfo>
	    <recordIdentifier>urn:PUL:bluemountain:dmd:bmtnabg_1911-01-05_01</recordIdentifier>
	  </recordInfo>
	  <identifier type="bmtn">urn:PUL:bluemountain:bmtnabg_1911-01-05_01</identifier>
	  <typeOfResource>text</typeOfResource>
	  <genre>Periodicals-Issue</genre>
	  <titleInfo>
	    <title>Der Sturm</title>
	    <subTitle>Wochenschrift für Kultur und die Künste</subTitle>
	  </titleInfo>
	  <part type="issue">
	    <detail type="volume">
	      <number>1</number>
	      <caption>Jahrgang 1911</caption>
	    </detail>
	    <detail type="number">
	      <number>45</number>
	      <caption>Nummer 45</caption>
	    </detail>
	  </part>
	  <originInfo>
	    <dateIssued>5. Januar 1911</dateIssued>
	    <dateIssued keyDate="yes" encoding="w3cdtf">1911-01-05</dateIssued>
	  </originInfo>
	  <relatedItem type="host" xlink:type="simple" xlink:href="urn:PUL:bluemountain:bmtnabg">
	    <recordInfo>
	      <recordIdentifier>urn:PUL:bluemountain:dmd:bmtnabg</recordIdentifier>
	    </recordInfo>
	  </relatedItem>
	  <relatedItem type="constituent" ID="c001">
	    <titleInfo lang="ger">
	      <title>INHALT:</title>
	    </titleInfo>
	    <typeOfResource>text</typeOfResource>
	    <language>
	      <languageTerm authority="iso639-2b">ger</languageTerm>
	    </language>
	    <part>
	      <extent unit="page">
		<start>1</start>
	      </extent>
	    </part>
	    <genre type="CCS">TextContent</genre>
	  </relatedItem>
	  <relatedItem type="constituent" ID="c002">
	    <titleInfo lang="ger">
	      <title>Vorüber</title>
	    </titleInfo>
	    <name type="personal">
	      <displayForm>Zeichnung von Oskar Kokoschka</displayForm>
	      <role>
		<roleTerm type="code" authority="marcrelator">cre</roleTerm>
	      </role>
	    </name>
	    <typeOfResource>still image</typeOfResource>
	    <part>
	      <extent unit="page">
		<start>1</start>
	      </extent>
	    </part>
	    <genre type="CCS">Illustration</genre>
	  </relatedItem>

          <!-- The remaining constituents go here -->
     </mods>
    #+END_SRC

**** <mods>
     The root element of the document.  When output as a stand-alone
     document, it has fixed attributes, as illustrated below:
     #+BEGIN_SRC xml
     <mods xmlns="http://www.loc.gov/mods/v3"
           xmlns:xlink="http://www.w3.org/1999/xlink"
           xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
           xsi:schemaLocation="http://www.loc.gov/mods/v3 
             http://www.loc.gov/mods/v3/mods-3-4.xsd">
     #+END_SRC
**** <recordInfo>
     The <recordInfo> element contains information about the MODS
     record itself.  It shall contain a /<recordIdentifier>/ element, as
     below.
**** <recordIdentifier>
     The <recordIdentifier> element contains the ISSUEMODSURI, the
     unique identifier for the MODS record itself, as described above.
