doc/reference.html

<div id="outline-container-4-2-2" class="outline-4">
<h4 id="sec-4-2-2"><span class="section-number-4">4.2.2</span> Issue-Level MODS</h4>
<div class="outline-text-4" id="text-4-2-2">

<p>    Blue Mountain encodes descriptive metadata for the contents of
    each magazine issue, so the issues may be searched and analyzed.
</p>



<pre class="src src-xml">   &lt;<span style="color: #8cd0d3;">mods</span> <span style="color: #93e0e3;">xmlns</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">http://www.loc.gov/mods/v3</span><span style="color: #cc9393;">"</span>&gt;
     &lt;<span style="color: #8cd0d3;">recordInfo</span>&gt;
       &lt;<span style="color: #8cd0d3;">recordIdentifier</span>&gt;urn:PUL:bluemountain:dmd:bmtnabg_1911-01-05_01&lt;/<span style="color: #8cd0d3;">recordIdentifier</span>&gt;
     &lt;/<span style="color: #8cd0d3;">recordInfo</span>&gt;
     &lt;<span style="color: #8cd0d3;">identifier</span> <span style="color: #dfaf8f;">type</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">bmtn</span><span style="color: #cc9393;">"</span>&gt;urn:PUL:bluemountain:bmtnabg_1911-01-05_01&lt;/<span style="color: #8cd0d3;">identifier</span>&gt;
     &lt;<span style="color: #8cd0d3;">typeOfResource</span>&gt;text&lt;/<span style="color: #8cd0d3;">typeOfResource</span>&gt;
     &lt;<span style="color: #8cd0d3;">genre</span>&gt;Periodicals-Issue&lt;/<span style="color: #8cd0d3;">genre</span>&gt;
     &lt;<span style="color: #8cd0d3;">titleInfo</span>&gt;
       &lt;<span style="color: #8cd0d3;">title</span>&gt;Der Sturm&lt;/<span style="color: #8cd0d3;">title</span>&gt;
       &lt;<span style="color: #8cd0d3;">subTitle</span>&gt;Wochenschrift f&#252;r Kultur und die K&#252;nste&lt;/<span style="color: #8cd0d3;">subTitle</span>&gt;
     &lt;/<span style="color: #8cd0d3;">titleInfo</span>&gt;
     &lt;<span style="color: #8cd0d3;">part</span> <span style="color: #dfaf8f;">type</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">issue</span><span style="color: #cc9393;">"</span>&gt;
       &lt;<span style="color: #8cd0d3;">detail</span> <span style="color: #dfaf8f;">type</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">volume</span><span style="color: #cc9393;">"</span>&gt;
         &lt;<span style="color: #8cd0d3;">number</span>&gt;1&lt;/<span style="color: #8cd0d3;">number</span>&gt;
         &lt;<span style="color: #8cd0d3;">caption</span>&gt;Jahrgang 1911&lt;/<span style="color: #8cd0d3;">caption</span>&gt;
       &lt;/<span style="color: #8cd0d3;">detail</span>&gt;
       &lt;<span style="color: #8cd0d3;">detail</span> <span style="color: #dfaf8f;">type</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">number</span><span style="color: #cc9393;">"</span>&gt;
         &lt;<span style="color: #8cd0d3;">number</span>&gt;45&lt;/<span style="color: #8cd0d3;">number</span>&gt;
         &lt;<span style="color: #8cd0d3;">caption</span>&gt;Nummer 45&lt;/<span style="color: #8cd0d3;">caption</span>&gt;
       &lt;/<span style="color: #8cd0d3;">detail</span>&gt;
     &lt;/<span style="color: #8cd0d3;">part</span>&gt;
     &lt;<span style="color: #8cd0d3;">originInfo</span>&gt;
       &lt;<span style="color: #8cd0d3;">dateIssued</span>&gt;5. Januar 1911&lt;/<span style="color: #8cd0d3;">dateIssued</span>&gt;
       &lt;<span style="color: #8cd0d3;">dateIssued</span> <span style="color: #dfaf8f;">keyDate</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">yes</span><span style="color: #cc9393;">"</span> <span style="color: #dfaf8f;">encoding</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">w3cdtf</span><span style="color: #cc9393;">"</span>&gt;1911-01-05&lt;/<span style="color: #8cd0d3;">dateIssued</span>&gt;
     &lt;/<span style="color: #8cd0d3;">originInfo</span>&gt;
     &lt;<span style="color: #8cd0d3;">relatedItem</span> <span style="color: #dfaf8f;">type</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">host</span><span style="color: #cc9393;">"</span> <span style="color: #93e0e3;">xlink</span>:<span style="color: #dfaf8f;">type</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">simple</span><span style="color: #cc9393;">"</span> <span style="color: #93e0e3;">xlink</span>:<span style="color: #dfaf8f;">href</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">urn:PUL:bluemountain:bmtnabg</span><span style="color: #cc9393;">"</span>&gt;
       &lt;<span style="color: #8cd0d3;">recordInfo</span>&gt;
         &lt;<span style="color: #8cd0d3;">recordIdentifier</span>&gt;urn:PUL:bluemountain:dmd:bmtnabg&lt;/<span style="color: #8cd0d3;">recordIdentifier</span>&gt;
       &lt;/<span style="color: #8cd0d3;">recordInfo</span>&gt;
     &lt;/<span style="color: #8cd0d3;">relatedItem</span>&gt;
     &lt;<span style="color: #8cd0d3;">relatedItem</span> <span style="color: #dfaf8f;">type</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">constituent</span><span style="color: #cc9393;">"</span> <span style="color: #dfaf8f;">ID</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">c001</span><span style="color: #cc9393;">"</span>&gt;
       &lt;<span style="color: #8cd0d3;">titleInfo</span> <span style="color: #dfaf8f;">lang</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">ger</span><span style="color: #cc9393;">"</span>&gt;
         &lt;<span style="color: #8cd0d3;">title</span>&gt;INHALT:&lt;/<span style="color: #8cd0d3;">title</span>&gt;
       &lt;/<span style="color: #8cd0d3;">titleInfo</span>&gt;
       &lt;<span style="color: #8cd0d3;">typeOfResource</span>&gt;text&lt;/<span style="color: #8cd0d3;">typeOfResource</span>&gt;
       &lt;<span style="color: #8cd0d3;">language</span>&gt;
         &lt;<span style="color: #8cd0d3;">languageTerm</span> <span style="color: #dfaf8f;">authority</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">iso639-2b</span><span style="color: #cc9393;">"</span>&gt;ger&lt;/<span style="color: #8cd0d3;">languageTerm</span>&gt;
       &lt;/<span style="color: #8cd0d3;">language</span>&gt;
       &lt;<span style="color: #8cd0d3;">part</span>&gt;
         &lt;<span style="color: #8cd0d3;">extent</span> <span style="color: #dfaf8f;">unit</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">page</span><span style="color: #cc9393;">"</span>&gt;
           &lt;<span style="color: #8cd0d3;">start</span>&gt;1&lt;/<span style="color: #8cd0d3;">start</span>&gt;
         &lt;/<span style="color: #8cd0d3;">extent</span>&gt;
       &lt;/<span style="color: #8cd0d3;">part</span>&gt;
       &lt;<span style="color: #8cd0d3;">genre</span> <span style="color: #dfaf8f;">type</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">CCS</span><span style="color: #cc9393;">"</span>&gt;TextContent&lt;/<span style="color: #8cd0d3;">genre</span>&gt;
     &lt;/<span style="color: #8cd0d3;">relatedItem</span>&gt;
     &lt;<span style="color: #8cd0d3;">relatedItem</span> <span style="color: #dfaf8f;">type</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">constituent</span><span style="color: #cc9393;">"</span> <span style="color: #dfaf8f;">ID</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">c002</span><span style="color: #cc9393;">"</span>&gt;
       &lt;<span style="color: #8cd0d3;">titleInfo</span> <span style="color: #dfaf8f;">lang</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">ger</span><span style="color: #cc9393;">"</span>&gt;
         &lt;<span style="color: #8cd0d3;">title</span>&gt;Vor&#252;ber&lt;/<span style="color: #8cd0d3;">title</span>&gt;
       &lt;/<span style="color: #8cd0d3;">titleInfo</span>&gt;
       &lt;<span style="color: #8cd0d3;">name</span> <span style="color: #dfaf8f;">type</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">personal</span><span style="color: #cc9393;">"</span>&gt;
         &lt;<span style="color: #8cd0d3;">displayForm</span>&gt;Zeichnung von Oskar Kokoschka&lt;/<span style="color: #8cd0d3;">displayForm</span>&gt;
         &lt;<span style="color: #8cd0d3;">role</span>&gt;
           &lt;<span style="color: #8cd0d3;">roleTerm</span> <span style="color: #dfaf8f;">type</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">code</span><span style="color: #cc9393;">"</span> <span style="color: #dfaf8f;">authority</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">marcrelator</span><span style="color: #cc9393;">"</span>&gt;cre&lt;/<span style="color: #8cd0d3;">roleTerm</span>&gt;
         &lt;/<span style="color: #8cd0d3;">role</span>&gt;
       &lt;/<span style="color: #8cd0d3;">name</span>&gt;
       &lt;<span style="color: #8cd0d3;">typeOfResource</span>&gt;still image&lt;/<span style="color: #8cd0d3;">typeOfResource</span>&gt;
       &lt;<span style="color: #8cd0d3;">part</span>&gt;
         &lt;<span style="color: #8cd0d3;">extent</span> <span style="color: #dfaf8f;">unit</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">page</span><span style="color: #cc9393;">"</span>&gt;
           &lt;<span style="color: #8cd0d3;">start</span>&gt;1&lt;/<span style="color: #8cd0d3;">start</span>&gt;
         &lt;/<span style="color: #8cd0d3;">extent</span>&gt;
       &lt;/<span style="color: #8cd0d3;">part</span>&gt;
       &lt;<span style="color: #8cd0d3;">genre</span> <span style="color: #dfaf8f;">type</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">CCS</span><span style="color: #cc9393;">"</span>&gt;Illustration&lt;/<span style="color: #8cd0d3;">genre</span>&gt;
     &lt;/<span style="color: #8cd0d3;">relatedItem</span>&gt;

     <span style="color: #7f9f7f;">&lt;!--</span><span style="color: #7f9f7f;"> The remaining constituents go here </span><span style="color: #7f9f7f;">--&gt;</span>
&lt;/<span style="color: #8cd0d3;">mods</span>&gt;
</pre>



</div>

<div id="outline-container-4-2-2-1" class="outline-5">
<h5 id="sec-4-2-2-1"><span class="section-number-5">4.2.2.1</span> &lt;mods&gt;</h5>
<div class="outline-text-5" id="text-4-2-2-1">

<p>     The root element of the document.  When output as a stand-alone
     document, it has fixed attributes, as illustrated below:
</p>


<pre class="src src-xml">&lt;<span style="color: #8cd0d3;">mods</span> <span style="color: #93e0e3;">xmlns</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">http://www.loc.gov/mods/v3</span><span style="color: #cc9393;">"</span>
      <span style="color: #93e0e3;">xmlns</span>:<span style="color: #dfaf8f;">xlink</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">http://www.w3.org/1999/xlink</span><span style="color: #cc9393;">"</span>
      <span style="color: #93e0e3;">xmlns</span>:<span style="color: #dfaf8f;">xsi</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">http://www.w3.org/2001/XMLSchema-instance</span><span style="color: #cc9393;">"</span>
      <span style="color: #93e0e3;">xsi</span>:<span style="color: #dfaf8f;">schemaLocation</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">http://www.loc.gov/mods/v3 </span>
<span style="color: #cc9393;">        http://www.loc.gov/mods/v3/mods-3-4.xsd</span><span style="color: #cc9393;">"</span>&gt;
</pre>

</div>

</div>

<div id="outline-container-4-2-2-2" class="outline-5">
<h5 id="sec-4-2-2-2"><span class="section-number-5">4.2.2.2</span> &lt;recordInfo&gt;</h5>
<div class="outline-text-5" id="text-4-2-2-2">

<p>     The &lt;recordInfo&gt; element contains information about the MODS
     record itself.  It shall contain a <i>&lt;recordIdentifier&gt;</i> element, as
     below.
</p></div>

</div>

<div id="outline-container-4-2-2-3" class="outline-5">
<h5 id="sec-4-2-2-3"><span class="section-number-5">4.2.2.3</span> &lt;recordIdentifier&gt;</h5>
<div class="outline-text-5" id="text-4-2-2-3">

<p>     The &lt;recordIdentifier&gt; element contains the ISSUEMODSURI, the
     unique identifier for the MODS record itself, as described above.
</p></div>

</div>
