doc/reference.org
**** <identifier type="PUL">
     The <identifier> element is used to identify the resource the MODS
     record describes (the magazine issue).  Its value is the
     resource's ISSUEURI, as described above.
     #+BEGIN_SRC xml
     <identifier type="PUL">urn:PUL:bluemountain:bmtnaad_1925-06-03_01</identifier>
     #+END_SRC
**** <relatedItem type="host">
     Each issue-level MODS record is related to the
     title-level record /via/ a <relatedItem type='host'> element.

     #+BEGIN_SRC xml
      <relatedItem type="host" xlink:type="simple" xlink:href="urn:PUL:bluemountain:PUBID">
       	<recordInfo>
	  <recordIdentifier>urn:PUL:bluemountain:dmd:PUBID</recordIdentifier>
       	</recordInfo>
      </relatedItem>
     #+END_SRC

     where /PUBID/ is the publication identifier of the title.

     The xlink:href shows the semantic relation between the issue and
     its host; the <recordIdentifier> is a specific key to the
     title-level record.

**** <language>
     The <language> element(s) indicates the language of the resource
     (the magazine issue).  If the issue contains material written in
     several languages, the record should include a <language>
     element for each one.  The value of the <languageTerm> element
     must be drawn from iso639-2b.  For example:
     #+BEGIN_SRC xml
     <language>
       <languageTerm type="code" authority="iso639-2b">rus</languageTerm>
      </language>
     #+END_SRC
**** <titleInfo>
     The <MODS:titleInfo> element shall be determined by standard
     cataloging rules.

     #+BEGIN_SRC xml
     <titleInfo>
       <nonSort>Le</nonSort>
       <title>coeur à barbe</title>
       <subTitle>journal transparent</subTitle>
     </titleInfo>
     #+END_SRC
**** <MODS:part>
     The <MODS:part> element shall take the following form:

     #+BEGIN_SRC xml
     <MODS:part>
      <MODS:detail type="volume">...</MODS:detail>
      <MODS:detail type="issue">...</MODS:detail>
     </MODS:part>
     #+END_SRC

***** <MODS:detail type="volume">
      #+BEGIN_SRC xml
       <MODS:detail type="volume">
	<MODS:number>ARABICVOL</MODS:number>
	<MODS:caption>Vol. MASTHEADVOL</MODS:caption>
      </MODS:detail>
      #+END_SRC
      Where
      - ARABICVOL is the volume number expressed as a non-formatted arabic numeral (e.g., 1, 2, 3,
       ... 10, 11, ...)
      - MASTHEADVOL is the volume number as it appears in the
	masthead.
***** <MODS:detail type="issue">
      The <MODS:detail type="issue"> element shall take one of two possible
      forms:
      - For "normal" issues (i.e., those following the recorded
	sequence of publication), record both the sequential number of
	the issue as an arabic numeral and the issue number as it
	appears in the masthead:
	#+BEGIN_SRC xml
	<MODS:detail type="issue">
	 <MODS:number>ARABICISSUE</MODS:number>
	 <MODS:caption>No. MASTHEADISSUE</MODS:caption>
	</MODS:detail>
	#+END_SRC
	Where
	- ARABICISSUE is the issue number expressed as a non-formatted arabic numeral
	  (e.g., 1, 2, 3, ..., 10, 11, ...)
	- MASTHEADISSUE is the volume number as it appears in the
	  masthead. 
      - For "special" issues (e.g., supplements, etc.), for which there is no sequential number for the
	issue, the <MODS:detail type="issue"> element should take the
	following form:
	#+BEGIN_SRC xml
	<MODS:detail type="issue">
	 <MODS:caption>CAPTIONTEXT</MODS:caption>
	</MODS:detail>
	#+END_SRC
	Where /CAPTIONTEXT/ is determined using standard cataloging rules.




**** <MODS:originInfo>
     The <MODS:originInfo> element shall be used to record the date of
     issuance, as follows:
     #+BEGIN_SRC xml
     <MODS:originInfo>
      <MODS:dateIssued>PRINTEDDATE</MODS:dateIssued>
      <MODS:dateIssued encoding="iso8601" keyDate="yes">ISODATE</MODS:dateIssued>
     </MODS:originInfo>
     #+END_SRC
     Where
     - /PRINTEDDATE/ is the date as it appears in the cover page
       FolioLine, or in the Masthead.
     - /ISODATE/ is the value of the date in the masthead, expressed
       in iso8601 format (YYYY-MM-DD) -- see
       http://www.w3.org/TR/NOTE-datetime for details.


