doc/reference.html

<div id="outline-container-4-2-2-4" class="outline-5">
<h5 id="sec-4-2-2-4"><span class="section-number-5">4.2.2.4</span> &lt;identifier type="PUL"&gt;</h5>
<div class="outline-text-5" id="text-4-2-2-4">

<p>     The &lt;identifier&gt; element is used to identify the resource the MODS
     record describes (the magazine issue).  Its value is the
     resource's ISSUEURI, as described above.
</p>


<pre class="src src-xml">&lt;<span style="color: #8cd0d3;">identifier</span> <span style="color: #dfaf8f;">type</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">PUL</span><span style="color: #cc9393;">"</span>&gt;urn:PUL:bluemountain:bmtnaad_1925-06-03_01&lt;/<span style="color: #8cd0d3;">identifier</span>&gt;
</pre>

</div>

</div>

<div id="outline-container-4-2-2-5" class="outline-5">
<h5 id="sec-4-2-2-5"><span class="section-number-5">4.2.2.5</span> &lt;relatedItem type="host"&gt;</h5>
<div class="outline-text-5" id="text-4-2-2-5">

<p>     Each issue-level MODS record is related to the
     title-level record <i>via</i> a &lt;relatedItem type='host'&gt; element.
</p>



<pre class="src src-xml">&lt;<span style="color: #8cd0d3;">relatedItem</span> <span style="color: #dfaf8f;">type</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">host</span><span style="color: #cc9393;">"</span> <span style="color: #93e0e3;">xlink</span>:<span style="color: #dfaf8f;">type</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">simple</span><span style="color: #cc9393;">"</span> <span style="color: #93e0e3;">xlink</span>:<span style="color: #dfaf8f;">href</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">urn:PUL:bluemountain:PUBID</span><span style="color: #cc9393;">"</span>&gt;
  &lt;<span style="color: #8cd0d3;">recordInfo</span>&gt;
    &lt;<span style="color: #8cd0d3;">recordIdentifier</span>&gt;urn:PUL:bluemountain:dmd:PUBID&lt;/<span style="color: #8cd0d3;">recordIdentifier</span>&gt;
  &lt;/<span style="color: #8cd0d3;">recordInfo</span>&gt;
&lt;/<span style="color: #8cd0d3;">relatedItem</span>&gt;
</pre>


<p>
     where <i>PUBID</i> is the publication identifier of the title.
</p>
<p>
     The xlink:href shows the semantic relation between the issue and
     its host; the &lt;recordIdentifier&gt; is a specific key to the
     title-level record.
</p>
</div>

</div>

<div id="outline-container-4-2-2-6" class="outline-5">
<h5 id="sec-4-2-2-6"><span class="section-number-5">4.2.2.6</span> &lt;language&gt;</h5>
<div class="outline-text-5" id="text-4-2-2-6">

<p>     The &lt;language&gt; element(s) indicates the language of the resource
     (the magazine issue).  If the issue contains material written in
     several languages, the record should include a &lt;language&gt;
     element for each one.  The value of the &lt;languageTerm&gt; element
     must be drawn from iso639-2b.  For example:
</p>


<pre class="src src-xml">&lt;<span style="color: #8cd0d3;">language</span>&gt;
  &lt;<span style="color: #8cd0d3;">languageTerm</span> <span style="color: #dfaf8f;">type</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">code</span><span style="color: #cc9393;">"</span> <span style="color: #dfaf8f;">authority</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">iso639-2b</span><span style="color: #cc9393;">"</span>&gt;rus&lt;/<span style="color: #8cd0d3;">languageTerm</span>&gt;
 &lt;/<span style="color: #8cd0d3;">language</span>&gt;
</pre>

</div>

</div>

<div id="outline-container-4-2-2-7" class="outline-5">
<h5 id="sec-4-2-2-7"><span class="section-number-5">4.2.2.7</span> &lt;titleInfo&gt;</h5>
<div class="outline-text-5" id="text-4-2-2-7">

<p>     The &lt;MODS:titleInfo&gt; element shall be determined by standard
     cataloging rules.
</p>



<pre class="src src-xml">&lt;<span style="color: #8cd0d3;">titleInfo</span>&gt;
  &lt;<span style="color: #8cd0d3;">nonSort</span>&gt;Le&lt;/<span style="color: #8cd0d3;">nonSort</span>&gt;
  &lt;<span style="color: #8cd0d3;">title</span>&gt;coeur &#224; barbe&lt;/<span style="color: #8cd0d3;">title</span>&gt;
  &lt;<span style="color: #8cd0d3;">subTitle</span>&gt;journal transparent&lt;/<span style="color: #8cd0d3;">subTitle</span>&gt;
&lt;/<span style="color: #8cd0d3;">titleInfo</span>&gt;
</pre>

</div>

</div>

<div id="outline-container-4-2-2-8" class="outline-5">
<h5 id="sec-4-2-2-8"><span class="section-number-5">4.2.2.8</span> &lt;MODS:part&gt;</h5>
<div class="outline-text-5" id="text-4-2-2-8">

<p>     The &lt;MODS:part&gt; element shall take the following form:
</p>



<pre class="src src-xml">&lt;<span style="color: #93e0e3;">MODS</span>:<span style="color: #8cd0d3;">part</span>&gt;
 &lt;<span style="color: #93e0e3;">MODS</span>:<span style="color: #8cd0d3;">detail</span> <span style="color: #dfaf8f;">type</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">volume</span><span style="color: #cc9393;">"</span>&gt;...&lt;/<span style="color: #93e0e3;">MODS</span>:<span style="color: #8cd0d3;">detail</span>&gt;
 &lt;<span style="color: #93e0e3;">MODS</span>:<span style="color: #8cd0d3;">detail</span> <span style="color: #dfaf8f;">type</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">issue</span><span style="color: #cc9393;">"</span>&gt;...&lt;/<span style="color: #93e0e3;">MODS</span>:<span style="color: #8cd0d3;">detail</span>&gt;
&lt;/<span style="color: #93e0e3;">MODS</span>:<span style="color: #8cd0d3;">part</span>&gt;
</pre>



</div>

<div id="outline-container-4-2-2-8-1" class="outline-6">
<h6 id="sec-4-2-2-8-1"><span class="section-number-6">4.2.2.8.1</span> &lt;MODS:detail type="volume"&gt;</h6>
<div class="outline-text-6" id="text-4-2-2-8-1">




<pre class="src src-xml"> &lt;<span style="color: #93e0e3;">MODS</span>:<span style="color: #8cd0d3;">detail</span> <span style="color: #dfaf8f;">type</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">volume</span><span style="color: #cc9393;">"</span>&gt;
  &lt;<span style="color: #93e0e3;">MODS</span>:<span style="color: #8cd0d3;">number</span>&gt;ARABICVOL&lt;/<span style="color: #93e0e3;">MODS</span>:<span style="color: #8cd0d3;">number</span>&gt;
  &lt;<span style="color: #93e0e3;">MODS</span>:<span style="color: #8cd0d3;">caption</span>&gt;Vol. MASTHEADVOL&lt;/<span style="color: #93e0e3;">MODS</span>:<span style="color: #8cd0d3;">caption</span>&gt;
&lt;/<span style="color: #93e0e3;">MODS</span>:<span style="color: #8cd0d3;">detail</span>&gt;
</pre>

<p>
      Where
</p><ul>
<li>ARABICVOL is the volume number expressed as a non-formatted arabic numeral (e.g., 1, 2, 3,
       &hellip; 10, 11, &hellip;)
</li>
<li>MASTHEADVOL is the volume number as it appears in the
        masthead.
</li>
</ul>

</div>

</div>

<div id="outline-container-4-2-2-8-2" class="outline-6">
<h6 id="sec-4-2-2-8-2"><span class="section-number-6">4.2.2.8.2</span> &lt;MODS:detail type="issue"&gt;</h6>
<div class="outline-text-6" id="text-4-2-2-8-2">

<p>      The &lt;MODS:detail type="issue"&gt; element shall take one of two possible
      forms:
</p><ul>
<li>For "normal" issues (i.e., those following the recorded
        sequence of publication), record both the sequential number of
        the issue as an arabic numeral and the issue number as it
        appears in the masthead:



<pre class="src src-xml">&lt;<span style="color: #93e0e3;">MODS</span>:<span style="color: #8cd0d3;">detail</span> <span style="color: #dfaf8f;">type</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">issue</span><span style="color: #cc9393;">"</span>&gt;
 &lt;<span style="color: #93e0e3;">MODS</span>:<span style="color: #8cd0d3;">number</span>&gt;ARABICISSUE&lt;/<span style="color: #93e0e3;">MODS</span>:<span style="color: #8cd0d3;">number</span>&gt;
 &lt;<span style="color: #93e0e3;">MODS</span>:<span style="color: #8cd0d3;">caption</span>&gt;No. MASTHEADISSUE&lt;/<span style="color: #93e0e3;">MODS</span>:<span style="color: #8cd0d3;">caption</span>&gt;
&lt;/<span style="color: #93e0e3;">MODS</span>:<span style="color: #8cd0d3;">detail</span>&gt;
</pre>

<p>
        Where
</p><ul>
<li>ARABICISSUE is the issue number expressed as a non-formatted arabic numeral
          (e.g., 1, 2, 3, &hellip;, 10, 11, &hellip;)
</li>
<li>MASTHEADISSUE is the volume number as it appears in the
          masthead. 
</li>
</ul>

</li>
<li>For "special" issues (e.g., supplements, etc.), for which there is no sequential number for the
        issue, the &lt;MODS:detail type="issue"&gt; element should take the
        following form:



<pre class="src src-xml">&lt;<span style="color: #93e0e3;">MODS</span>:<span style="color: #8cd0d3;">detail</span> <span style="color: #dfaf8f;">type</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">issue</span><span style="color: #cc9393;">"</span>&gt;
 &lt;<span style="color: #93e0e3;">MODS</span>:<span style="color: #8cd0d3;">caption</span>&gt;CAPTIONTEXT&lt;/<span style="color: #93e0e3;">MODS</span>:<span style="color: #8cd0d3;">caption</span>&gt;
&lt;/<span style="color: #93e0e3;">MODS</span>:<span style="color: #8cd0d3;">detail</span>&gt;
</pre>

<p>
        Where <i>CAPTIONTEXT</i> is determined using standard cataloging rules.
</p></li>
</ul>





</div>
</div>

</div>

<div id="outline-container-4-2-2-9" class="outline-5">
<h5 id="sec-4-2-2-9"><span class="section-number-5">4.2.2.9</span> &lt;MODS:originInfo&gt;</h5>
<div class="outline-text-5" id="text-4-2-2-9">

<p>     The &lt;MODS:originInfo&gt; element shall be used to record the date of
     issuance, as follows:
</p>


<pre class="src src-xml">&lt;<span style="color: #93e0e3;">MODS</span>:<span style="color: #8cd0d3;">originInfo</span>&gt;
 &lt;<span style="color: #93e0e3;">MODS</span>:<span style="color: #8cd0d3;">dateIssued</span>&gt;PRINTEDDATE&lt;/<span style="color: #93e0e3;">MODS</span>:<span style="color: #8cd0d3;">dateIssued</span>&gt;
 &lt;<span style="color: #93e0e3;">MODS</span>:<span style="color: #8cd0d3;">dateIssued</span> <span style="color: #dfaf8f;">encoding</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">iso8601</span><span style="color: #cc9393;">"</span> <span style="color: #dfaf8f;">keyDate</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">yes</span><span style="color: #cc9393;">"</span>&gt;ISODATE&lt;/<span style="color: #93e0e3;">MODS</span>:<span style="color: #8cd0d3;">dateIssued</span>&gt;
&lt;/<span style="color: #93e0e3;">MODS</span>:<span style="color: #8cd0d3;">originInfo</span>&gt;
</pre>

<p>
     Where
</p><ul>
<li><i>PRINTEDDATE</i> is the date as it appears in the cover page
       FolioLine, or in the Masthead.
</li>
<li><i>ISODATE</i> is the value of the date in the masthead, expressed
       in iso8601 format (YYYY-MM-DD) &ndash; see
       <a href="http://www.w3.org/TR/NOTE-datetime">http://www.w3.org/TR/NOTE-datetime</a> for details.
</li>
</ul>



</div>
</div>

</div>
