doc/reference.org
*** <relatedItem type="constituent">
     Traditional library cataloging does not extend to the contents
     of periodicals, yet this level of description is precisely what
     is required by scholars of periodicals, and the Blue
     Mountain Project is committed to providing it, as well as to
     formulating guidelines, in cooperation with scholars and
     librarians, for this level of description.  The specifications
     for this description, therefore, must be considered work in
     progress, work that will necessarily evolve over the course of
     the Project.

     That being said, the Project will, at the outset, capture
     information about the following sorts of constituents:

     - traditional editorial content (articles, features, letters to the
       editor, etc.)
     - significant illustrations (figures, tip-ins, etc.)
     - advertisements

     The last sort -- advertisements -- is the most controversial,
     and the most difficult for librarians to understand, although
     advertisements are among the most heavily studied parts of
     historical periodicals.  There are at present no established
     rules for describing advertisements, and their variety and
     abundance pose serious practical challenges to projects with
     limited resources.  This version of the specification,
     therefore, provides little guidance on the description of
     periodicals, other than providing a framework for this level of
     detail to be created at a future date, by scholars, researchers,
     and other students of the material who wish to advance
     scholarship by enhancing the data provided here.

   - TextContent
   - Illustration
   - SponsoredAd
   - Section

   They are described in greater detail below.

   Here is a hypothetical example, in English:
   #+BEGIN_SRC xml
<relatedItem type="constituent" ID="c17">
  <titleInfo>
   <nonSort>A</nonSort>
   <title>Modest Proposal</title>
  </titleInfo>
  <name type="personal" authority="viaf" valueURI="http://viaf.org/viaf/14777110">
   <displayForm>Jonathan Swift</displayForm>
   <role>
    <roleTerm type="code">cre</roleTerm>
   </role>
  </name>
  <language>
   <languageTerm type="code" authority="iso639-2b">eng</languageTerm>
  </language>
  <part>
   <extent unit="page">
    <start>25</start>
    <end>29</end>
   </extent>
  </part>
  <genre type="CCS">TextContent</genre>
 </relatedItem>
   #+END_SRC

   - The /type/ attribute has the value /constituent/, because this
     related item is a constituent (a part) of the newspaper.

   - The /ID/ attribute may be any valid XML ID (it must begin with a
     character).  By convention, the ID will begin with the letter /c/
     followed by a sequential number.  (The docWorks processing flow
     seems to generate the /ID/ attributes.)  This attribute links the
     description to a <div> element in the METS logical structMap.

**** <titleInfo>
     The <title> is transcribed as it appears on the page, using
     standard cataloging rules.
**** <name>
    - The <name> elements (there may none, or there may be more than
      one) are used to record the names of the people or organizations
      who are responsible for the constituent -- usually, this is
      simply the author of the piece.

      The /<name>/ is transcribed as it appears on the page and is
      encoded in the /<displayForm>/ element.  All /<name>/ elements
      shall include a /<role>/ element, which shall designate the
      generic role, /cre/, in the /<roleTerm>/ subelement.

      When possible, encoders should supply a link to a name
      authority, preferably http://viaf.org.  
**** <language>
    - The language used in the text.  If more than one language is
      used, there should be a <language> element for each.
    - The <language> element shall contain the subelement
      /<languageTerm>/, a three-letter code derived from the ISO639-2
      standard, found at http://www.loc.gov/standards/iso639-2/.  The
      code form should be used.
**** <part>
     Contains a single <extent> element.
