doc/reference.html

<div id="outline-container-4-2-3" class="outline-4">
<h4 id="sec-4-2-3"><span class="section-number-4">4.2.3</span> &lt;relatedItem type="constituent"&gt;</h4>
<div class="outline-text-4" id="text-4-2-3">

<p>     Traditional library cataloging does not extend to the contents
     of periodicals, yet this level of description is precisely what
     is required by scholars of periodicals, and the Blue
     Mountain Project is committed to providing it, as well as to
     formulating guidelines, in cooperation with scholars and
     librarians, for this level of description.  The specifications
     for this description, therefore, must be considered work in
     progress, work that will necessarily evolve over the course of
     the Project.
</p>
<p>
     That being said, the Project will, at the outset, capture
     information about the following sorts of constituents:
</p>
<ul>
<li>traditional editorial content (articles, features, letters to the
       editor, etc.)
</li>
<li>significant illustrations (figures, tip-ins, etc.)
</li>
<li>advertisements
</li>
</ul>


<p>
     The last sort &ndash; advertisements &ndash; is the most controversial,
     and the most difficult for librarians to understand, although
     advertisements are among the most heavily studied parts of
     historical periodicals.  There are at present no established
     rules for describing advertisements, and their variety and
     abundance pose serious practical challenges to projects with
     limited resources.  This version of the specification,
     therefore, provides little guidance on the description of
     periodicals, other than providing a framework for this level of
     detail to be created at a future date, by scholars, researchers,
     and other students of the material who wish to advance
     scholarship by enhancing the data provided here.
</p>
<ul>
<li>TextContent
</li>
<li>Illustration
</li>
<li>SponsoredAd
</li>
<li>Section
</li>
</ul>


<p>
   They are described in greater detail below.
</p>
<p>
   Here is a hypothetical example, in English:
</p>


<pre class="src src-xml">&lt;<span style="color: #8cd0d3;">relatedItem</span> <span style="color: #dfaf8f;">type</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">constituent</span><span style="color: #cc9393;">"</span> <span style="color: #dfaf8f;">ID</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">c17</span><span style="color: #cc9393;">"</span>&gt;
  &lt;<span style="color: #8cd0d3;">titleInfo</span>&gt;
   &lt;<span style="color: #8cd0d3;">nonSort</span>&gt;A&lt;/<span style="color: #8cd0d3;">nonSort</span>&gt;
   &lt;<span style="color: #8cd0d3;">title</span>&gt;Modest Proposal&lt;/<span style="color: #8cd0d3;">title</span>&gt;
  &lt;/<span style="color: #8cd0d3;">titleInfo</span>&gt;
  &lt;<span style="color: #8cd0d3;">name</span> <span style="color: #dfaf8f;">type</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">personal</span><span style="color: #cc9393;">"</span> <span style="color: #dfaf8f;">authority</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">viaf</span><span style="color: #cc9393;">"</span> <span style="color: #dfaf8f;">valueURI</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">http://viaf.org/viaf/14777110</span><span style="color: #cc9393;">"</span>&gt;
   &lt;<span style="color: #8cd0d3;">displayForm</span>&gt;Jonathan Swift&lt;/<span style="color: #8cd0d3;">displayForm</span>&gt;
   &lt;<span style="color: #8cd0d3;">role</span>&gt;
    &lt;<span style="color: #8cd0d3;">roleTerm</span> <span style="color: #dfaf8f;">type</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">code</span><span style="color: #cc9393;">"</span>&gt;cre&lt;/<span style="color: #8cd0d3;">roleTerm</span>&gt;
   &lt;/<span style="color: #8cd0d3;">role</span>&gt;
  &lt;/<span style="color: #8cd0d3;">name</span>&gt;
  &lt;<span style="color: #8cd0d3;">language</span>&gt;
   &lt;<span style="color: #8cd0d3;">languageTerm</span> <span style="color: #dfaf8f;">type</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">code</span><span style="color: #cc9393;">"</span> <span style="color: #dfaf8f;">authority</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">iso639-2b</span><span style="color: #cc9393;">"</span>&gt;eng&lt;/<span style="color: #8cd0d3;">languageTerm</span>&gt;
  &lt;/<span style="color: #8cd0d3;">language</span>&gt;
  &lt;<span style="color: #8cd0d3;">part</span>&gt;
   &lt;<span style="color: #8cd0d3;">extent</span> <span style="color: #dfaf8f;">unit</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">page</span><span style="color: #cc9393;">"</span>&gt;
    &lt;<span style="color: #8cd0d3;">start</span>&gt;25&lt;/<span style="color: #8cd0d3;">start</span>&gt;
    &lt;<span style="color: #8cd0d3;">end</span>&gt;29&lt;/<span style="color: #8cd0d3;">end</span>&gt;
   &lt;/<span style="color: #8cd0d3;">extent</span>&gt;
  &lt;/<span style="color: #8cd0d3;">part</span>&gt;
  &lt;<span style="color: #8cd0d3;">genre</span> <span style="color: #dfaf8f;">type</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">CCS</span><span style="color: #cc9393;">"</span>&gt;TextContent&lt;/<span style="color: #8cd0d3;">genre</span>&gt;
 &lt;/<span style="color: #8cd0d3;">relatedItem</span>&gt;
</pre>


<ul>
<li>The <i>type</i> attribute has the value <i>constituent</i>, because this
     related item is a constituent (a part) of the newspaper.

</li>
<li>The <i>ID</i> attribute may be any valid XML ID (it must begin with a
     character).  By convention, the ID will begin with the letter <i>c</i>
     followed by a sequential number.  (The docWorks processing flow
     seems to generate the <i>ID</i> attributes.)  This attribute links the
     description to a &lt;div&gt; element in the METS logical structMap.
</li>
</ul>



</div>

<div id="outline-container-4-2-3-1" class="outline-5">
<h5 id="sec-4-2-3-1"><span class="section-number-5">4.2.3.1</span> &lt;titleInfo&gt;</h5>
<div class="outline-text-5" id="text-4-2-3-1">

<p>     The &lt;title&gt; is transcribed as it appears on the page, using
     standard cataloging rules.
</p></div>

</div>

<div id="outline-container-4-2-3-2" class="outline-5">
<h5 id="sec-4-2-3-2"><span class="section-number-5">4.2.3.2</span> &lt;name&gt;</h5>
<div class="outline-text-5" id="text-4-2-3-2">

<ul>
<li>The &lt;name&gt; elements (there may none, or there may be more than
      one) are used to record the names of the people or organizations
      who are responsible for the constituent &ndash; usually, this is
      simply the author of the piece.

<p>
      The <i>&lt;name&gt;</i> is transcribed as it appears on the page and is
      encoded in the <i>&lt;displayForm&gt;</i> element.  All <i>&lt;name&gt;</i> elements
      shall include a <i>&lt;role&gt;</i> element, which shall designate the
      generic role, <i>cre</i>, in the <i>&lt;roleTerm&gt;</i> subelement.
</p>
<p>
      When possible, encoders should supply a link to a name
      authority, preferably <a href="http://viaf.org">http://viaf.org</a>.  
</p></li>
</ul>

</div>

</div>

<div id="outline-container-4-2-3-3" class="outline-5">
<h5 id="sec-4-2-3-3"><span class="section-number-5">4.2.3.3</span> &lt;language&gt;</h5>
<div class="outline-text-5" id="text-4-2-3-3">

<ul>
<li>The language used in the text.  If more than one language is
      used, there should be a &lt;language&gt; element for each.
</li>
<li>The &lt;language&gt; element shall contain the subelement
      <i>&lt;languageTerm&gt;</i>, a three-letter code derived from the ISO639-2
      standard, found at <a href="http://www.loc.gov/standards/iso639-2/">http://www.loc.gov/standards/iso639-2/</a>.  The
      code form should be used.
</li>
</ul>

</div>

</div>

<div id="outline-container-4-2-3-4" class="outline-5">
<h5 id="sec-4-2-3-4"><span class="section-number-5">4.2.3.4</span> &lt;part&gt;</h5>
<div class="outline-text-5" id="text-4-2-3-4">

<p>     Contains a single &lt;extent&gt; element.
</p>
</div>
