doc/reference.org
***** <extent unit="page">
     - The <extent> records the page or pages on which the constituent appears:
       - when the item appears on a single page ::
	    encode the page number as a solitary /<start>/ element.
	    #+BEGIN_SRC xml
	    <extent unit="page">
             <start>3</start>
            </extent>
	    #+END_SRC

       - when the item appears on multiple sequential pages :: 
	    encode the first page in a /<start>/ element and the last
            page in an /<end>/ element.
	    #+BEGIN_SRC xml
	    <extent unit="page">
             <start>3</start>
             <end>4</end>
            </extent>
	    #+END_SRC

       - when the item appears on non-sequential pages :: 
	    encode the pages as a series in a /<list>/ element, as in
	    #+BEGIN_SRC xml
	    <extent unit="page">
             <list>3; 5</list>
            </extent>
	    #+END_SRC

       - when the item appears on a mix of sequential and non-sequential pages :: 
            #+BEGIN_SRC xml
	    <extent unit="page">
             <list>1-2; 5</list>
            </extent>
            #+END_SRC

       	 For an article that starts on page 1, continues on page 2, and
       	 then skips to page 5.

**** <genre type="CCS">
     The /<genre type="CCS">/ is determined from the docWorks configuration: for
     articles and other editorial content, it will be /TextContent/;
     for photographs, cartoons, and other illustrations, it will be
     /Illustration/; for advertisements, is will be /SponsoredAd/.
     Those <relatedItem type="constituent"> elements that contain
     /other/ constituents will have the genre /Section/.
**** Kinds of Constituents
***** TextContent
      These are the most common sorts of constituents: articles,
      notices, poems, stories, sports scores -- all textual editorial
      content.

      A TextContent constituent may contain /other constituents/: in
      particular, an article may contain illustrations.
****** Examples
******* A basic article
	#+BEGIN_SRC xml
     <relatedItem type="constituent">
      <titleInfo>
       <title>Письма изъ Германiи</title>
      </titleInfo>
      <name type="personal">
       <displayForm>А. Бунге.</displayForm>
       <role>
        <roleTerm type="code">cre</roleTerm>
       </role>
      </name>
      <language>
       <languageTerm type="code" authority="iso639-2b">rus</languageTerm>
      </language>
      <part>
       <extent unit="page">
        <start>2</start>
       </extent>
      </part>
      <genre type="CCS">TextContent</genre>
     </relatedItem>
	#+END_SRC

******* An article with an embedded illustration
	#+BEGIN_SRC xml
	    <relatedItem type="constituent">
      <titleInfo>
       <title>Театрь и Музыка</title>
      </titleInfo>

      <language>
       <languageTerm type="code" authority="iso639-2b">rus</languageTerm>
      </language>
      <part>
       <extent unit="page">
        <start>4</start>
       </extent>
      </part>
      <genre type="CCS">TextContent</genre>
      
      <relatedItem type="constituent">
       <titleInfo>
        <title>В. И. Шонтковская</title>
       </titleInfo>
       <part>
        <extent unit="page">
         <start>4</start>
        </extent>
       </part>
       <genre type="CCS">Illustration</genre>
      </relatedItem>
     </relatedItem>
	#+END_SRC

***** Illustration
      We use /Illustration/ to refer to all kinds of graphic "art":
      photographs, cartoons, charts, etc.  Most illustrations in
      /Vozrozhdenie/ (but not all) are accompanied by some sort of
      /caption/: a line or two of text, usually beneath the graphic,
      that describes the illustration, or names the creator of the
      illustration, or both.

      For docWorks processing, the caption should be used as the
      <title>. 
