doc/reference.html

<div id="outline-container-4-2-3-4-1" class="outline-6">
<h6 id="sec-4-2-3-4-1"><span class="section-number-6">4.2.3.4.1</span> &lt;extent unit="page"&gt;</h6>
<div class="outline-text-6" id="text-4-2-3-4-1">

<ul>
<li>The &lt;extent&gt; records the page or pages on which the constituent appears:
<dl>
<dt>when the item appears on a single page</dt><dd>
<p>
            encode the page number as a solitary <i>&lt;start&gt;</i> element.
</p>


<pre class="src src-xml">&lt;<span style="color: #8cd0d3;">extent</span> <span style="color: #dfaf8f;">unit</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">page</span><span style="color: #cc9393;">"</span>&gt;
 &lt;<span style="color: #8cd0d3;">start</span>&gt;3&lt;/<span style="color: #8cd0d3;">start</span>&gt;
&lt;/<span style="color: #8cd0d3;">extent</span>&gt;
</pre>


</dd>
<dt>when the item appears on multiple sequential pages</dt><dd>
<p>
            encode the first page in a <i>&lt;start&gt;</i> element and the last
            page in an <i>&lt;end&gt;</i> element.
</p>


<pre class="src src-xml">&lt;<span style="color: #8cd0d3;">extent</span> <span style="color: #dfaf8f;">unit</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">page</span><span style="color: #cc9393;">"</span>&gt;
 &lt;<span style="color: #8cd0d3;">start</span>&gt;3&lt;/<span style="color: #8cd0d3;">start</span>&gt;
 &lt;<span style="color: #8cd0d3;">end</span>&gt;4&lt;/<span style="color: #8cd0d3;">end</span>&gt;
&lt;/<span style="color: #8cd0d3;">extent</span>&gt;
</pre>


</dd>
<dt>when the item appears on non-sequential pages</dt><dd>
<p>
            encode the pages as a series in a <i>&lt;list&gt;</i> element, as in
</p>


<pre class="src src-xml">&lt;<span style="color: #8cd0d3;">extent</span> <span style="color: #dfaf8f;">unit</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">page</span><span style="color: #cc9393;">"</span>&gt;
 &lt;<span style="color: #8cd0d3;">list</span>&gt;3; 5&lt;/<span style="color: #8cd0d3;">list</span>&gt;
&lt;/<span style="color: #8cd0d3;">extent</span>&gt;
</pre>


</dd>
<dt>when the item appears on a mix of sequential and non-sequential pages</dt><dd>



<pre class="src src-xml">&lt;<span style="color: #8cd0d3;">extent</span> <span style="color: #dfaf8f;">unit</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">page</span><span style="color: #cc9393;">"</span>&gt;
 &lt;<span style="color: #8cd0d3;">list</span>&gt;1-2; 5&lt;/<span style="color: #8cd0d3;">list</span>&gt;
&lt;/<span style="color: #8cd0d3;">extent</span>&gt;
</pre>


<p>
         For an article that starts on page 1, continues on page 2, and
         then skips to page 5.
</p></dd>
</dl>

</li>
</ul>


</div>
</div>

</div>

<div id="outline-container-4-2-3-5" class="outline-5">
<h5 id="sec-4-2-3-5"><span class="section-number-5">4.2.3.5</span> &lt;genre type="CCS"&gt;</h5>
<div class="outline-text-5" id="text-4-2-3-5">

<p>     The <i>&lt;genre type="CCS"&gt;</i> is determined from the docWorks configuration: for
     articles and other editorial content, it will be <i>TextContent</i>;
     for photographs, cartoons, and other illustrations, it will be
     <i>Illustration</i>; for advertisements, is will be <i>SponsoredAd</i>.
     Those &lt;relatedItem type="constituent"&gt; elements that contain
     <i>other</i> constituents will have the genre <i>Section</i>.
</p></div>

</div>

<div id="outline-container-4-2-3-6" class="outline-5">
<h5 id="sec-4-2-3-6"><span class="section-number-5">4.2.3.6</span> Kinds of Constituents</h5>
<div class="outline-text-5" id="text-4-2-3-6">


</div>

<div id="outline-container-4-2-3-6-1" class="outline-6">
<h6 id="sec-4-2-3-6-1"><span class="section-number-6">4.2.3.6.1</span> TextContent</h6>
<div class="outline-text-6" id="text-4-2-3-6-1">

<p>      These are the most common sorts of constituents: articles,
      notices, poems, stories, sports scores &ndash; all textual editorial
      content.
</p>
<p>
      A TextContent constituent may contain <i>other constituents</i>: in
      particular, an article may contain illustrations.
</p>
</div>

<div id="outline-container-4-2-3-6-1-1" class="outline-7">
<h7 id="sec-4-2-3-6-1-1"><span class="section-number-7">4.2.3.6.1.1</span> Examples</h7>
<div class="outline-text-7" id="text-4-2-3-6-1-1">

<ul>
<li id="sec-4-2-3-6-1-1-1">A basic article<br/>



<pre class="src src-xml">&lt;<span style="color: #8cd0d3;">relatedItem</span> <span style="color: #dfaf8f;">type</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">constituent</span><span style="color: #cc9393;">"</span>&gt;
 &lt;<span style="color: #8cd0d3;">titleInfo</span>&gt;
  &lt;<span style="color: #8cd0d3;">title</span>&gt;&#1055;&#1080;&#1089;&#1100;&#1084;&#1072; &#1080;&#1079;&#1098; &#1043;&#1077;&#1088;&#1084;&#1072;&#1085;i&#1080;&lt;/<span style="color: #8cd0d3;">title</span>&gt;
 &lt;/<span style="color: #8cd0d3;">titleInfo</span>&gt;
 &lt;<span style="color: #8cd0d3;">name</span> <span style="color: #dfaf8f;">type</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">personal</span><span style="color: #cc9393;">"</span>&gt;
  &lt;<span style="color: #8cd0d3;">displayForm</span>&gt;&#1040;. &#1041;&#1091;&#1085;&#1075;&#1077;.&lt;/<span style="color: #8cd0d3;">displayForm</span>&gt;
  &lt;<span style="color: #8cd0d3;">role</span>&gt;
   &lt;<span style="color: #8cd0d3;">roleTerm</span> <span style="color: #dfaf8f;">type</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">code</span><span style="color: #cc9393;">"</span>&gt;cre&lt;/<span style="color: #8cd0d3;">roleTerm</span>&gt;
  &lt;/<span style="color: #8cd0d3;">role</span>&gt;
 &lt;/<span style="color: #8cd0d3;">name</span>&gt;
 &lt;<span style="color: #8cd0d3;">language</span>&gt;
  &lt;<span style="color: #8cd0d3;">languageTerm</span> <span style="color: #dfaf8f;">type</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">code</span><span style="color: #cc9393;">"</span> <span style="color: #dfaf8f;">authority</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">iso639-2b</span><span style="color: #cc9393;">"</span>&gt;rus&lt;/<span style="color: #8cd0d3;">languageTerm</span>&gt;
 &lt;/<span style="color: #8cd0d3;">language</span>&gt;
 &lt;<span style="color: #8cd0d3;">part</span>&gt;
  &lt;<span style="color: #8cd0d3;">extent</span> <span style="color: #dfaf8f;">unit</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">page</span><span style="color: #cc9393;">"</span>&gt;
   &lt;<span style="color: #8cd0d3;">start</span>&gt;2&lt;/<span style="color: #8cd0d3;">start</span>&gt;
  &lt;/<span style="color: #8cd0d3;">extent</span>&gt;
 &lt;/<span style="color: #8cd0d3;">part</span>&gt;
 &lt;<span style="color: #8cd0d3;">genre</span> <span style="color: #dfaf8f;">type</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">CCS</span><span style="color: #cc9393;">"</span>&gt;TextContent&lt;/<span style="color: #8cd0d3;">genre</span>&gt;
&lt;/<span style="color: #8cd0d3;">relatedItem</span>&gt;
</pre>


</li>
</ul>
<ul>
<li id="sec-4-2-3-6-1-1-2">An article with an embedded illustration<br/>



<pre class="src src-xml">       &lt;<span style="color: #8cd0d3;">relatedItem</span> <span style="color: #dfaf8f;">type</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">constituent</span><span style="color: #cc9393;">"</span>&gt;
 &lt;<span style="color: #8cd0d3;">titleInfo</span>&gt;
  &lt;<span style="color: #8cd0d3;">title</span>&gt;&#1058;&#1077;&#1072;&#1090;&#1088;&#1100; &#1080; &#1052;&#1091;&#1079;&#1099;&#1082;&#1072;&lt;/<span style="color: #8cd0d3;">title</span>&gt;
 &lt;/<span style="color: #8cd0d3;">titleInfo</span>&gt;

 &lt;<span style="color: #8cd0d3;">language</span>&gt;
  &lt;<span style="color: #8cd0d3;">languageTerm</span> <span style="color: #dfaf8f;">type</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">code</span><span style="color: #cc9393;">"</span> <span style="color: #dfaf8f;">authority</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">iso639-2b</span><span style="color: #cc9393;">"</span>&gt;rus&lt;/<span style="color: #8cd0d3;">languageTerm</span>&gt;
 &lt;/<span style="color: #8cd0d3;">language</span>&gt;
 &lt;<span style="color: #8cd0d3;">part</span>&gt;
  &lt;<span style="color: #8cd0d3;">extent</span> <span style="color: #dfaf8f;">unit</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">page</span><span style="color: #cc9393;">"</span>&gt;
   &lt;<span style="color: #8cd0d3;">start</span>&gt;4&lt;/<span style="color: #8cd0d3;">start</span>&gt;
  &lt;/<span style="color: #8cd0d3;">extent</span>&gt;
 &lt;/<span style="color: #8cd0d3;">part</span>&gt;
 &lt;<span style="color: #8cd0d3;">genre</span> <span style="color: #dfaf8f;">type</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">CCS</span><span style="color: #cc9393;">"</span>&gt;TextContent&lt;/<span style="color: #8cd0d3;">genre</span>&gt;

 &lt;<span style="color: #8cd0d3;">relatedItem</span> <span style="color: #dfaf8f;">type</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">constituent</span><span style="color: #cc9393;">"</span>&gt;
  &lt;<span style="color: #8cd0d3;">titleInfo</span>&gt;
   &lt;<span style="color: #8cd0d3;">title</span>&gt;&#1042;. &#1048;. &#1064;&#1086;&#1085;&#1090;&#1082;&#1086;&#1074;&#1089;&#1082;&#1072;&#1103;&lt;/<span style="color: #8cd0d3;">title</span>&gt;
  &lt;/<span style="color: #8cd0d3;">titleInfo</span>&gt;
  &lt;<span style="color: #8cd0d3;">part</span>&gt;
   &lt;<span style="color: #8cd0d3;">extent</span> <span style="color: #dfaf8f;">unit</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">page</span><span style="color: #cc9393;">"</span>&gt;
    &lt;<span style="color: #8cd0d3;">start</span>&gt;4&lt;/<span style="color: #8cd0d3;">start</span>&gt;
   &lt;/<span style="color: #8cd0d3;">extent</span>&gt;
  &lt;/<span style="color: #8cd0d3;">part</span>&gt;
  &lt;<span style="color: #8cd0d3;">genre</span> <span style="color: #dfaf8f;">type</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">CCS</span><span style="color: #cc9393;">"</span>&gt;Illustration&lt;/<span style="color: #8cd0d3;">genre</span>&gt;
 &lt;/<span style="color: #8cd0d3;">relatedItem</span>&gt;
&lt;/<span style="color: #8cd0d3;">relatedItem</span>&gt;
</pre>


</li>
</ul>
</div>
</div>

</div>

<div id="outline-container-4-2-3-6-2" class="outline-6">
<h6 id="sec-4-2-3-6-2"><span class="section-number-6">4.2.3.6.2</span> Illustration</h6>
<div class="outline-text-6" id="text-4-2-3-6-2">

<p>      We use <i>Illustration</i> to refer to all kinds of graphic "art":
      photographs, cartoons, charts, etc.  Most illustrations in
      <i>Vozrozhdenie</i> (but not all) are accompanied by some sort of
      <i>caption</i>: a line or two of text, usually beneath the graphic,
      that describes the illustration, or names the creator of the
      illustration, or both.
</p>
<p>
      For docWorks processing, the caption should be used as the
      &lt;title&gt;. 
</p>
</div>
