doc/reference.org
****** Examples
       #+BEGIN_SRC xml
    <relatedItem type="constituent" ID="c2">
      <titleInfo>
       <title>Митрополитъ Евлопй</title>
      </titleInfo>
      <language>
       <languageTerm type="code" authority="iso639-2b">rus</languageTerm>
      </language>
      <part>
       <extent unit="page">
        <start>1</start>
       </extent>
      </part>
      <genre type="CCS">Illustration</genre>
     </relatedItem>
       #+END_SRC

***** SponsoredAd
      Advertisements are an important and plentiful constituent of
      /Vozrozhdenie/.  They usually appear in blocks or sections (see
      below); we do not attempt to assign them titles or creators.
****** Examples
       #+BEGIN_SRC xml
     <relatedItem type="constituent" ID="c3">
      <titleInfo>
       <title>[Advertisement]</title>
      </titleInfo>
      <language>
       <languageTerm type="code" authority="iso639-2b">rus</languageTerm>
      </language>
      <part>
       <extent unit="page">
       <start>3</start>
      </extent>
      </part>
      <genre type="CCS">SponsoredAd</genre>
     </relatedItem>
       #+END_SRC

***** Section
      A section is a "composite constituent": it contains other
      constituents.  Advertising blocks are encoded as sections;
      named sections of the paper are encoded as sections, too.
****** Examples
       #+BEGIN_SRC xml
     <relatedItem type="constituent">
      <titleInfo>
       <title>Литература, критика и искусство</title>
      </titleInfo>
      <part>
       <extent unit="page">
        <start>3</start>
       </extent>
      </part>
      <genre type="CCS">Section</genre>

      <relatedItem type="constituent">
       <titleInfo>
        <title>"Машенька"</title>
       </titleInfo>
       <part>
        <extent unit="page">
         <start>3</start>
        </extent>
       </part>
       <genre type="CCS">TextContent</genre>
      </relatedItem>

      <relatedItem type="constituent">
       <titleInfo>
        <title>"Золотой узоръ"</title>
       </titleInfo>
       <part>
        <extent unit="page">
         <start>3</start>
        </extent>
       </part>
       <genre type="CCS">TextContent</genre>
      </relatedItem>
     </relatedItem>       
       #+END_SRC

** ALTO Profile
   For each page, an encoded representation of the layout and the
   machine-readable text on the page shall be provided, using the
   ALTO schema, version 2.0 or higher, with the following
   specifications, adopted from the NDNP:

   - The text shall be encoded in the natural reading order of the
     language in which the text is written;
   - Point size and font data to at least the word level shall be included;
   - The ALTO file shall include bounding-box coordinates to at least
     the word level;
   - Non-rectangular blocks shall not be used.  Some illustrations
     may format as "tight" in the document.
** Image Profiles
*** TIFF: Image Description
    In general, Princeton University Library adheres to the standards
    elaborated by the Federal Agencies Digitization Guidelines
    Initiative (FADGI), whose Still Image Working Group produced
    a document entitled /Technical Guidelines for Digitizing Cultural
    Heritage Materials/ in 2010.  Archival images will be captured in
    24-bit RGB and digitally rendered at varying resolutions to produce
    a uniform long dimension of 7200 pixels, then stored as
    uncompressed TIFF files with a large, non-proprietary color profile
    (Pro Photo RGB). The homogenization of the archival files to a long
    dimension of 7200 pixels allows us to produce uniform derivative
    images rapidly and estimate our storage needs more accurately.
*** JPEG2000: Image Description
