doc/reference.html

<div id="outline-container-4-2-3-6-2-1" class="outline-7">
<h7 id="sec-4-2-3-6-2-1"><span class="section-number-7">4.2.3.6.2.1</span> Examples</h7>
<div class="outline-text-7" id="text-4-2-3-6-2-1">




<pre class="src src-xml">&lt;<span style="color: #8cd0d3;">relatedItem</span> <span style="color: #dfaf8f;">type</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">constituent</span><span style="color: #cc9393;">"</span> <span style="color: #dfaf8f;">ID</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">c2</span><span style="color: #cc9393;">"</span>&gt;
  &lt;<span style="color: #8cd0d3;">titleInfo</span>&gt;
   &lt;<span style="color: #8cd0d3;">title</span>&gt;&#1052;&#1080;&#1090;&#1088;&#1086;&#1087;&#1086;&#1083;&#1080;&#1090;&#1098; &#1045;&#1074;&#1083;&#1086;&#1087;&#1081;&lt;/<span style="color: #8cd0d3;">title</span>&gt;
  &lt;/<span style="color: #8cd0d3;">titleInfo</span>&gt;
  &lt;<span style="color: #8cd0d3;">language</span>&gt;
   &lt;<span style="color: #8cd0d3;">languageTerm</span> <span style="color: #dfaf8f;">type</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">code</span><span style="color: #cc9393;">"</span> <span style="color: #dfaf8f;">authority</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">iso639-2b</span><span style="color: #cc9393;">"</span>&gt;rus&lt;/<span style="color: #8cd0d3;">languageTerm</span>&gt;
  &lt;/<span style="color: #8cd0d3;">language</span>&gt;
  &lt;<span style="color: #8cd0d3;">part</span>&gt;
   &lt;<span style="color: #8cd0d3;">extent</span> <span style="color: #dfaf8f;">unit</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">page</span><span style="color: #cc9393;">"</span>&gt;
    &lt;<span style="color: #8cd0d3;">start</span>&gt;1&lt;/<span style="color: #8cd0d3;">start</span>&gt;
   &lt;/<span style="color: #8cd0d3;">extent</span>&gt;
  &lt;/<span style="color: #8cd0d3;">part</span>&gt;
  &lt;<span style="color: #8cd0d3;">genre</span> <span style="color: #dfaf8f;">type</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">CCS</span><span style="color: #cc9393;">"</span>&gt;Illustration&lt;/<span style="color: #8cd0d3;">genre</span>&gt;
 &lt;/<span style="color: #8cd0d3;">relatedItem</span>&gt;
</pre>


</div>
</div>

</div>

<div id="outline-container-4-2-3-6-3" class="outline-6">
<h6 id="sec-4-2-3-6-3"><span class="section-number-6">4.2.3.6.3</span> SponsoredAd</h6>
<div class="outline-text-6" id="text-4-2-3-6-3">

<p>      Advertisements are an important and plentiful constituent of
      <i>Vozrozhdenie</i>.  They usually appear in blocks or sections (see
      below); we do not attempt to assign them titles or creators.
</p>
</div>

<div id="outline-container-4-2-3-6-3-1" class="outline-7">
<h7 id="sec-4-2-3-6-3-1"><span class="section-number-7">4.2.3.6.3.1</span> Examples</h7>
<div class="outline-text-7" id="text-4-2-3-6-3-1">




<pre class="src src-xml">&lt;<span style="color: #8cd0d3;">relatedItem</span> <span style="color: #dfaf8f;">type</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">constituent</span><span style="color: #cc9393;">"</span> <span style="color: #dfaf8f;">ID</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">c3</span><span style="color: #cc9393;">"</span>&gt;
 &lt;<span style="color: #8cd0d3;">titleInfo</span>&gt;
  &lt;<span style="color: #8cd0d3;">title</span>&gt;[Advertisement]&lt;/<span style="color: #8cd0d3;">title</span>&gt;
 &lt;/<span style="color: #8cd0d3;">titleInfo</span>&gt;
 &lt;<span style="color: #8cd0d3;">language</span>&gt;
  &lt;<span style="color: #8cd0d3;">languageTerm</span> <span style="color: #dfaf8f;">type</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">code</span><span style="color: #cc9393;">"</span> <span style="color: #dfaf8f;">authority</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">iso639-2b</span><span style="color: #cc9393;">"</span>&gt;rus&lt;/<span style="color: #8cd0d3;">languageTerm</span>&gt;
 &lt;/<span style="color: #8cd0d3;">language</span>&gt;
 &lt;<span style="color: #8cd0d3;">part</span>&gt;
  &lt;<span style="color: #8cd0d3;">extent</span> <span style="color: #dfaf8f;">unit</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">page</span><span style="color: #cc9393;">"</span>&gt;
  &lt;<span style="color: #8cd0d3;">start</span>&gt;3&lt;/<span style="color: #8cd0d3;">start</span>&gt;
 &lt;/<span style="color: #8cd0d3;">extent</span>&gt;
 &lt;/<span style="color: #8cd0d3;">part</span>&gt;
 &lt;<span style="color: #8cd0d3;">genre</span> <span style="color: #dfaf8f;">type</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">CCS</span><span style="color: #cc9393;">"</span>&gt;SponsoredAd&lt;/<span style="color: #8cd0d3;">genre</span>&gt;
&lt;/<span style="color: #8cd0d3;">relatedItem</span>&gt;
</pre>


</div>
</div>

</div>

<div id="outline-container-4-2-3-6-4" class="outline-6">
<h6 id="sec-4-2-3-6-4"><span class="section-number-6">4.2.3.6.4</span> Section</h6>
<div class="outline-text-6" id="text-4-2-3-6-4">

<p>      A section is a "composite constituent": it contains other
      constituents.  Advertising blocks are encoded as sections;
      named sections of the paper are encoded as sections, too.
</p>
</div>

<div id="outline-container-4-2-3-6-4-1" class="outline-7">
<h7 id="sec-4-2-3-6-4-1"><span class="section-number-7">4.2.3.6.4.1</span> Examples</h7>
<div class="outline-text-7" id="text-4-2-3-6-4-1">




<pre class="src src-xml">&lt;<span style="color: #8cd0d3;">relatedItem</span> <span style="color: #dfaf8f;">type</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">constituent</span><span style="color: #cc9393;">"</span>&gt;
 &lt;<span style="color: #8cd0d3;">titleInfo</span>&gt;
  &lt;<span style="color: #8cd0d3;">title</span>&gt;&#1051;&#1080;&#1090;&#1077;&#1088;&#1072;&#1090;&#1091;&#1088;&#1072;, &#1082;&#1088;&#1080;&#1090;&#1080;&#1082;&#1072; &#1080; &#1080;&#1089;&#1082;&#1091;&#1089;&#1089;&#1090;&#1074;&#1086;&lt;/<span style="color: #8cd0d3;">title</span>&gt;
 &lt;/<span style="color: #8cd0d3;">titleInfo</span>&gt;
 &lt;<span style="color: #8cd0d3;">part</span>&gt;
  &lt;<span style="color: #8cd0d3;">extent</span> <span style="color: #dfaf8f;">unit</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">page</span><span style="color: #cc9393;">"</span>&gt;
   &lt;<span style="color: #8cd0d3;">start</span>&gt;3&lt;/<span style="color: #8cd0d3;">start</span>&gt;
  &lt;/<span style="color: #8cd0d3;">extent</span>&gt;
 &lt;/<span style="color: #8cd0d3;">part</span>&gt;
 &lt;<span style="color: #8cd0d3;">genre</span> <span style="color: #dfaf8f;">type</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">CCS</span><span style="color: #cc9393;">"</span>&gt;Section&lt;/<span style="color: #8cd0d3;">genre</span>&gt;

 &lt;<span style="color: #8cd0d3;">relatedItem</span> <span style="color: #dfaf8f;">type</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">constituent</span><span style="color: #cc9393;">"</span>&gt;
  &lt;<span style="color: #8cd0d3;">titleInfo</span>&gt;
   &lt;<span style="color: #8cd0d3;">title</span>&gt;"&#1052;&#1072;&#1096;&#1077;&#1085;&#1100;&#1082;&#1072;"&lt;/<span style="color: #8cd0d3;">title</span>&gt;
  &lt;/<span style="color: #8cd0d3;">titleInfo</span>&gt;
  &lt;<span style="color: #8cd0d3;">part</span>&gt;
   &lt;<span style="color: #8cd0d3;">extent</span> <span style="color: #dfaf8f;">unit</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">page</span><span style="color: #cc9393;">"</span>&gt;
    &lt;<span style="color: #8cd0d3;">start</span>&gt;3&lt;/<span style="color: #8cd0d3;">start</span>&gt;
   &lt;/<span style="color: #8cd0d3;">extent</span>&gt;
  &lt;/<span style="color: #8cd0d3;">part</span>&gt;
  &lt;<span style="color: #8cd0d3;">genre</span> <span style="color: #dfaf8f;">type</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">CCS</span><span style="color: #cc9393;">"</span>&gt;TextContent&lt;/<span style="color: #8cd0d3;">genre</span>&gt;
 &lt;/<span style="color: #8cd0d3;">relatedItem</span>&gt;

 &lt;<span style="color: #8cd0d3;">relatedItem</span> <span style="color: #dfaf8f;">type</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">constituent</span><span style="color: #cc9393;">"</span>&gt;
  &lt;<span style="color: #8cd0d3;">titleInfo</span>&gt;
   &lt;<span style="color: #8cd0d3;">title</span>&gt;"&#1047;&#1086;&#1083;&#1086;&#1090;&#1086;&#1081; &#1091;&#1079;&#1086;&#1088;&#1098;"&lt;/<span style="color: #8cd0d3;">title</span>&gt;
  &lt;/<span style="color: #8cd0d3;">titleInfo</span>&gt;
  &lt;<span style="color: #8cd0d3;">part</span>&gt;
   &lt;<span style="color: #8cd0d3;">extent</span> <span style="color: #dfaf8f;">unit</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">page</span><span style="color: #cc9393;">"</span>&gt;
    &lt;<span style="color: #8cd0d3;">start</span>&gt;3&lt;/<span style="color: #8cd0d3;">start</span>&gt;
   &lt;/<span style="color: #8cd0d3;">extent</span>&gt;
  &lt;/<span style="color: #8cd0d3;">part</span>&gt;
  &lt;<span style="color: #8cd0d3;">genre</span> <span style="color: #dfaf8f;">type</span>=<span style="color: #cc9393;">"</span><span style="color: #cc9393;">CCS</span><span style="color: #cc9393;">"</span>&gt;TextContent&lt;/<span style="color: #8cd0d3;">genre</span>&gt;
 &lt;/<span style="color: #8cd0d3;">relatedItem</span>&gt;
&lt;/<span style="color: #8cd0d3;">relatedItem</span>&gt;       
</pre>


</div>
</div>
</div>
</div>
</div>

</div>

<div id="outline-container-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="section-number-3">4.3</span> ALTO Profile</h3>
<div class="outline-text-3" id="text-4-3">

<p>   For each page, an encoded representation of the layout and the
   machine-readable text on the page shall be provided, using the
   ALTO schema, version 2.0 or higher, with the following
   specifications, adopted from the NDNP:
</p>
<ul>
<li>The text shall be encoded in the natural reading order of the
     language in which the text is written;
</li>
<li>Point size and font data to at least the word level shall be included;
</li>
<li>The ALTO file shall include bounding-box coordinates to at least
     the word level;
</li>
<li>Non-rectangular blocks shall not be used.  Some illustrations
     may format as "tight" in the document.
</li>
</ul>

</div>

</div>

<div id="outline-container-4-4" class="outline-3">
<h3 id="sec-4-4"><span class="section-number-3">4.4</span> Image Profiles</h3>
<div class="outline-text-3" id="text-4-4">


</div>

<div id="outline-container-4-4-1" class="outline-4">
<h4 id="sec-4-4-1"><span class="section-number-4">4.4.1</span> TIFF: Image Description</h4>
<div class="outline-text-4" id="text-4-4-1">

<p>    In general, Princeton University Library adheres to the standards
    elaborated by the Federal Agencies Digitization Guidelines
    Initiative (FADGI), whose Still Image Working Group produced
    a document entitled <i>Technical Guidelines for Digitizing Cultural     Heritage Materials</i> in 2010.  Archival images will be captured in
    24-bit RGB and digitally rendered at varying resolutions to produce
    a uniform long dimension of 7200 pixels, then stored as
    uncompressed TIFF files with a large, non-proprietary color profile
    (Pro Photo RGB). The homogenization of the archival files to a long
    dimension of 7200 pixels allows us to produce uniform derivative
    images rapidly and estimate our storage needs more accurately.
</p></div>

</div>

<div id="outline-container-4-4-2" class="outline-4">
<h4 id="sec-4-4-2"><span class="section-number-4">4.4.2</span> JPEG2000: Image Description</h4>
<div class="outline-text-4" id="text-4-4-2">


</div>
