doc/reference.org
**** Generative Image Derivatives
     Derived from the Master TIFF files with the following formula:

     #+BEGIN_EXAMPLE
     kdu_compress -i YOURINPUT.tif -o YOUROUTPUT.jp2 Creversible=yes -rate -,1,0.5,0.25 \
     -jp2_space sRGB \
     -double_buffering 10 \
     -num_threads 4 \
     -no_weights \
     -quiet
     #+END_EXAMPLE

**** Delivery Derivatives
     To generate a JP2000 using Kakadu, use the following recipe (taken
     from /The National Digital Newspaper Program (NDNP) Technical
     Guidelines for Applicants/):

    #+BEGIN_EXAMPLE
       kdu_compress -i YOURINPUT.tif -o YOUROUTPUT.jp2 -rate 
       1,0.84,0.7,0.6,0.5,0.4,0.35,0.3,0.25,0.21,0.18,0.15,0.125,0.1,0.088,0.0 
       75,0.0625,0.05,0.04419,0.03716,0.03125,0.025,0.0221,0.01858,0.015625 
       Clevels=6 Stiles={1024,1024} Corder=RLCP
    #+END_EXAMPLE

* Blue Mountain DocWorks Configuration
** Containers
*** Editorial Content Container
**** Article Copy
*** PubInfo Container
*** SponsoredAd Container
* General Markup Policy for Blue Mountain Magazines
** Preliminary
   For each title, Princeton will provide the following:

   1. A "sample copy markup" (PDF): a full issue marked up according
      to the General Markup Policy;
   2. A title-specific markup addendum clarifying unusual zoning and
      structural features; and
   3. A marked up copy of any issue(s) deviating substantially from
      either the general or title-specific markup policies.

** VerifyPageFrames (VPF)
   Straighten and deskew all pages.  When the input files include
   two-page spreads, do not split them into separate files unless
   instructed.
** VerifyLayoutElements (VLE)
   The VLE step is skipped for serials and books, so zoning is
   performed in VPN.
** VerifyPageNumbers (VPN)
   It is important to refer to any sample copy markup and any
   title-specific markup addenda in addition to this document, as the
   location and ways of identifying zones will vary by publication.
*** Zone Types to Tag
**** PubInfo Container
***** Page Number
      - Zone Name (in docWorks) :: PageNumber
      - Description :: Used when the publication includes page numbers
      - Location and Features :: Varies by publication; consult
	   addenda.
***** Nameplate
      - Zone Name (docWorks) :: Nameplate
      - Description :: The space at the top of the magazine cover,
		       usually containing the name (the logo),
		       location, volume, issue, and sometimes
		       taglines.  Designs range from simple to
		       intricate, depending on the design of the publication.
      - Location and Features :: The nameplate often contains the same
	   information as the /masthead/ but is a different layout
	   element.  Its purpose is to make the magazine identifiable
	   when seen from a distance (as at a magazine stand, for
	   example).  The typeface is often a custom display type.

	   Not every publication design includes a recognizable
	   nameplate.
***** Masthead
      - Zone Name (docWorks) :: Masthead
      - Description :: A section inside the magazine containing
		       various pieces of publication information, such
		       as the editor's names, contact information, and
		       subscription rates.
      - Location and Features :: Mastheads vary in size and amount of
	   information included.  Some may take up an entire page.
	   In newspapers, the masthead often occurs on the editorial
	   page; in magazines, it may appear in various locations
	   (consult title-specfic mark-up addenda).
***** Folio Line (Inside)
      - Zone Name :: InsideFolioLine
      - Description :: A folio line is an identification line,
		       appearing (when it does appear) on each page of
		       a newspaper or magazine.  The front-page folio
		       line is different from those on inside pages.
      - Location and Features :: Not all magazine layouts feature a
	   folio line.  It may run at the top or bottom of each page.
	   It can also run as part of the logo on special pages or
	   within the masthead.  It often consists of the publication
	   date in one corner, the name of the publication (centered),
	   and the page number in the other corner.  It is sometimes
	   separated from the rest of the page by a cutoff rule.
***** Front Folio Line(s)
      - Zone Name :: FrontFolioLine
      - Description :: An identification line or lines on cover of the
		       magazine often containing one or more of the
		       following elements: the volume number
		       (or the number of years the publication has
		       been in print); the issue number; the place of
		       publication; and date of publication.
      - Location and Features :: Usually joins the nameplate. Often
	   separated from the logo by borders or cutoff rules.

	   Not every publication layout includes a recognizable front
	   folio line.  Many of the Blue Mountain designs omit it, or
	   scatter the informaiton traditionally contained in a front
	   folio line across the front page.
***** General Publication Information
      - Zone Name :: GenericPubInfo
      - Description :: A catch-all category for other "metadata" about
		       the magazine not identifiable as nameplate,
		       masthead, or folio lines.
      - Location and Features :: Highly variable, but usually found on
	   outside or inside covers.  Consult title-specific addenda.
**** Editorial Content Container
