doc/reference.html

<div id="outline-container-4-4-2-1" class="outline-5">
<h5 id="sec-4-4-2-1"><span class="section-number-5">4.4.2.1</span> Generative Image Derivatives</h5>
<div class="outline-text-5" id="text-4-4-2-1">

<p>     Derived from the Master TIFF files with the following formula:
</p>



<pre class="example">kdu_compress -i YOURINPUT.tif -o YOUROUTPUT.jp2 Creversible=yes -rate -,1,0.5,0.25 \
-jp2_space sRGB \
-double_buffering 10 \
-num_threads 4 \
-no_weights \
-quiet
</pre>


</div>

</div>

<div id="outline-container-4-4-2-2" class="outline-5">
<h5 id="sec-4-4-2-2"><span class="section-number-5">4.4.2.2</span> Delivery Derivatives</h5>
<div class="outline-text-5" id="text-4-4-2-2">

<p>     To generate a JP2000 using Kakadu, use the following recipe (taken
     from <i>The National Digital Newspaper Program (NDNP) Technical      Guidelines for Applicants</i>):
</p>



<pre class="example">kdu_compress -i YOURINPUT.tif -o YOUROUTPUT.jp2 -rate 
1,0.84,0.7,0.6,0.5,0.4,0.35,0.3,0.25,0.21,0.18,0.15,0.125,0.1,0.088,0.0 
75,0.0625,0.05,0.04419,0.03716,0.03125,0.025,0.0221,0.01858,0.015625 
Clevels=6 Stiles={1024,1024} Corder=RLCP
</pre>


</div>
</div>
</div>
</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Blue Mountain DocWorks Configuration</h2>
<div class="outline-text-2" id="text-5">


</div>

<div id="outline-container-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> Containers</h3>
<div class="outline-text-3" id="text-5-1">


</div>

<div id="outline-container-5-1-1" class="outline-4">
<h4 id="sec-5-1-1"><span class="section-number-4">5.1.1</span> Editorial Content Container</h4>
<div class="outline-text-4" id="text-5-1-1">


</div>

<div id="outline-container-5-1-1-1" class="outline-5">
<h5 id="sec-5-1-1-1"><span class="section-number-5">5.1.1.1</span> Article Copy</h5>
<div class="outline-text-5" id="text-5-1-1-1">

</div>
</div>

</div>

<div id="outline-container-5-1-2" class="outline-4">
<h4 id="sec-5-1-2"><span class="section-number-4">5.1.2</span> PubInfo Container</h4>
<div class="outline-text-4" id="text-5-1-2">

</div>

</div>

<div id="outline-container-5-1-3" class="outline-4">
<h4 id="sec-5-1-3"><span class="section-number-4">5.1.3</span> SponsoredAd Container</h4>
<div class="outline-text-4" id="text-5-1-3">

</div>
</div>
</div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> General Markup Policy for Blue Mountain Magazines</h2>
<div class="outline-text-2" id="text-6">


</div>

<div id="outline-container-6-1" class="outline-3">
<h3 id="sec-6-1"><span class="section-number-3">6.1</span> Preliminary</h3>
<div class="outline-text-3" id="text-6-1">

<p>   For each title, Princeton will provide the following:
</p>
<ol>
<li>A "sample copy markup" (PDF): a full issue marked up according
      to the General Markup Policy;
</li>
<li>A title-specific markup addendum clarifying unusual zoning and
      structural features; and
</li>
<li>A marked up copy of any issue(s) deviating substantially from
      either the general or title-specific markup policies.
</li>
</ol>


</div>

</div>

<div id="outline-container-6-2" class="outline-3">
<h3 id="sec-6-2"><span class="section-number-3">6.2</span> VerifyPageFrames (VPF)</h3>
<div class="outline-text-3" id="text-6-2">

<p>   Straighten and deskew all pages.  When the input files include
   two-page spreads, do not split them into separate files unless
   instructed.
</p></div>

</div>

<div id="outline-container-6-3" class="outline-3">
<h3 id="sec-6-3"><span class="section-number-3">6.3</span> VerifyLayoutElements (VLE)</h3>
<div class="outline-text-3" id="text-6-3">

<p>   The VLE step is skipped for serials and books, so zoning is
   performed in VPN.
</p></div>

</div>

<div id="outline-container-6-4" class="outline-3">
<h3 id="sec-6-4"><span class="section-number-3">6.4</span> VerifyPageNumbers (VPN)</h3>
<div class="outline-text-3" id="text-6-4">

<p>   It is important to refer to any sample copy markup and any
   title-specific markup addenda in addition to this document, as the
   location and ways of identifying zones will vary by publication.
</p>
</div>

<div id="outline-container-6-4-1" class="outline-4">
<h4 id="sec-6-4-1"><span class="section-number-4">6.4.1</span> Zone Types to Tag</h4>
<div class="outline-text-4" id="text-6-4-1">


</div>

<div id="outline-container-6-4-1-1" class="outline-5">
<h5 id="sec-6-4-1-1"><span class="section-number-5">6.4.1.1</span> PubInfo Container</h5>
<div class="outline-text-5" id="text-6-4-1-1">


</div>

<div id="outline-container-6-4-1-1-1" class="outline-6">
<h6 id="sec-6-4-1-1-1"><span class="section-number-6">6.4.1.1.1</span> Page Number</h6>
<div class="outline-text-6" id="text-6-4-1-1-1">

<dl>
<dt>Zone Name (in docWorks)</dt><dd>PageNumber
</dd>
<dt>Description</dt><dd>Used when the publication includes page numbers
</dd>
<dt>Location and Features</dt><dd>Varies by publication; consult
           addenda.
</dd>
</dl>

</div>

</div>

<div id="outline-container-6-4-1-1-2" class="outline-6">
<h6 id="sec-6-4-1-1-2"><span class="section-number-6">6.4.1.1.2</span> Nameplate</h6>
<div class="outline-text-6" id="text-6-4-1-1-2">

<dl>
<dt>Zone Name (docWorks)</dt><dd>Nameplate
</dd>
<dt>Description</dt><dd>The space at the top of the magazine cover,
                       usually containing the name (the logo),
                       location, volume, issue, and sometimes
                       taglines.  Designs range from simple to
                       intricate, depending on the design of the publication.
</dd>
<dt>Location and Features</dt><dd>The nameplate often contains the same
           information as the <i>masthead</i> but is a different layout
           element.  Its purpose is to make the magazine identifiable
           when seen from a distance (as at a magazine stand, for
           example).  The typeface is often a custom display type.

<p>
           Not every publication design includes a recognizable
           nameplate.
</p></dd>
</dl>

</div>

</div>

<div id="outline-container-6-4-1-1-3" class="outline-6">
<h6 id="sec-6-4-1-1-3"><span class="section-number-6">6.4.1.1.3</span> Masthead</h6>
<div class="outline-text-6" id="text-6-4-1-1-3">

<dl>
<dt>Zone Name (docWorks)</dt><dd>Masthead
</dd>
<dt>Description</dt><dd>A section inside the magazine containing
                       various pieces of publication information, such
                       as the editor's names, contact information, and
                       subscription rates.
</dd>
<dt>Location and Features</dt><dd>Mastheads vary in size and amount of
           information included.  Some may take up an entire page.
           In newspapers, the masthead often occurs on the editorial
           page; in magazines, it may appear in various locations
           (consult title-specfic mark-up addenda).
</dd>
</dl>

</div>

</div>

<div id="outline-container-6-4-1-1-4" class="outline-6">
<h6 id="sec-6-4-1-1-4"><span class="section-number-6">6.4.1.1.4</span> Folio Line (Inside)</h6>
<div class="outline-text-6" id="text-6-4-1-1-4">

<dl>
<dt>Zone Name</dt><dd>InsideFolioLine
</dd>
<dt>Description</dt><dd>A folio line is an identification line,
                       appearing (when it does appear) on each page of
                       a newspaper or magazine.  The front-page folio
                       line is different from those on inside pages.
</dd>
<dt>Location and Features</dt><dd>Not all magazine layouts feature a
           folio line.  It may run at the top or bottom of each page.
           It can also run as part of the logo on special pages or
           within the masthead.  It often consists of the publication
           date in one corner, the name of the publication (centered),
           and the page number in the other corner.  It is sometimes
           separated from the rest of the page by a cutoff rule.
</dd>
</dl>

</div>

</div>

<div id="outline-container-6-4-1-1-5" class="outline-6">
<h6 id="sec-6-4-1-1-5"><span class="section-number-6">6.4.1.1.5</span> Front Folio Line(s)</h6>
<div class="outline-text-6" id="text-6-4-1-1-5">

<dl>
<dt>Zone Name</dt><dd>FrontFolioLine
</dd>
<dt>Description</dt><dd>An identification line or lines on cover of the
                       magazine often containing one or more of the
                       following elements: the volume number
                       (or the number of years the publication has
                       been in print); the issue number; the place of
                       publication; and date of publication.
</dd>
<dt>Location and Features</dt><dd>Usually joins the nameplate. Often
           separated from the logo by borders or cutoff rules.

<p>
           Not every publication layout includes a recognizable front
           folio line.  Many of the Blue Mountain designs omit it, or
           scatter the informaiton traditionally contained in a front
           folio line across the front page.
</p></dd>
</dl>

</div>

</div>

<div id="outline-container-6-4-1-1-6" class="outline-6">
<h6 id="sec-6-4-1-1-6"><span class="section-number-6">6.4.1.1.6</span> General Publication Information</h6>
<div class="outline-text-6" id="text-6-4-1-1-6">

<dl>
<dt>Zone Name</dt><dd>GenericPubInfo
</dd>
<dt>Description</dt><dd>A catch-all category for other "metadata" about
                       the magazine not identifiable as nameplate,
                       masthead, or folio lines.
</dd>
<dt>Location and Features</dt><dd>Highly variable, but usually found on
           outside or inside covers.  Consult title-specific addenda.
</dd>
</dl>

</div>
</div>

</div>
