doc/reference.org
***** Head
      - Zone Name :: Headline
      - Description :: A phrase at the beginning of a magazine
		       section, usually indicating the subject of the
		       following copy text.
      - Location and Features :: A newspaper /headline/ is a /kind/ of
	   head; magazines usually have many other kinds of
	   heads. /Heads/ are usually recognizable by weight, size, or
	   position of type: they are often heavier or larger, and are
	   often (though not always) centered above one or more
	   columns of type with space before and after.  A single
	   magazine constituent may have several /levels/ of heading:
	   most have a top-level head (usually the title of the
	   piece), to distinguish the piece as a whole from other
	   magazine content, but many have typographically distinct
	   /subheads/ that subdivide the constituent itself into
	   sections (see /Subhead/ below).
***** Subhead
      - Zone Name :: Subheadline
      - Description :: A phrase demarcating a part of a constituent
		       or section of a magazine. A constituent or
		       section cannot have a subhead without a head.
      - Location and Features :: Subheads break up a chunk (a
	   constituent, a section) into smaller units.  Subheads are
	   usually distinguished typographically from heads by smaller
	   type sizes and different spacing.
***** Article Copy
      - Zone Name :: Textblock
      - Description :: A block of body text. /Article Copy/ is a
		       misnomer; /Editorial Copy/ would be better.
		       It is usually, though not always, divided into
		       paragraphs; Blue Mountain zones tables and
		       lists as Article Copy.
      - Location and Features :: May be preceded by a Head (though a
	   Head is not mandatory).  May be subdivided into smaller
	   units through the use of rules and/or subheads.
      - Tagging Notes :: 
	- Blue Mountain zones tables and lists as
	  Article Copy.
	- Blue Mountain also tags tables of contents as Article Copy.
***** Byline
      - Zone Name :: Author
      - Description :: A zone containing one or more regions
		       associated with the writer of an article,
		       musical composition, letter, or other editorial
		       content: usually the writer's name, but
		       sometimes also the writer's position or other
		       biographical information.
      - Location and Features :: The byline is usually located either
	   at the beginning of the content, between the head and the
	   first zone of copy, or at the end of the copy text.
	   Bylines can be difficult to distinguish.  They are
	   sometimes set in italic or boldfaced type or in all-caps;
	   they are sometimes a full name (first name, last name),
	   sometimes a last name only, or one or two initials, or a
	   name with a term of address in the language of the
	   magazine (Mr., Dr., Madame, M., Herr, etc.)
***** Art
      - Zone Name :: Illustration
      - Description :: A drawing, photograph, a reproduction of a
		       print or a painting; a graphic poem.
		       Sometimes has a caption above, below, or to
		       the side of it.
      - Location and Features :: May occur anywhere; may occupy a
	   single column, several columns, or be set outside the
	   column grid of the page; or may take up a full page or a
	   multi-page spread.

	   The Avant-garde saw the invention of "graphical text" like
	   concrete poetry, shape poetry, Futurist "words in
	   liberty," etc.  While these are in fact hybrid forms, both
	   graphic and text, Blue Mountain zones them as art.		     
***** Caption
      - Zone Name :: Caption
      - Description :: One or more textual blocks associated with an
		       Illustration.
      - Location and Features :: Captions may appear above, below, or
	   (occasionally) to the side of the illustration to which
	   they belong.  They may contain several lines and/or zones
	   of information: the identity of the subject; the name of
	   the artist/photographer/poet; the title of the artwork
	   being printed or reproduced.  Consult title-specific
	   addenda.
***** Music
      - Zone Name :: Music
      - Description :: A zone of musical notation (in Western music,
		       most often one or more staves, perhaps with
		       clefs and key signatures, and notes; sometimes
		       heavily annotated with text.)
      - Location and Features :: Size and extent varies.  May be a
	   small musical example occupying a few lines of a column,
	   or a multi-page musical compostion.  Some zones of music
	   may be accompanied by heads or captions.
***** Footnote
      - Zone Name :: Footnote
      - Description :: A zone of type, usually at the foot of the
		       page, serving as an annotation to some text on
		       the page.
      - NOTE :: This zone is under consideration.
**** SponsoredAd Container
***** Sponsored Ad (Advertisement Copy)
      - Zone Name :: Advertisement
      - Description :: An often-heterogenous zone of mixed
		       typography, graphics, and layout whose
		       function is to draw attention to some event,
		       product, or service.  /Sponsored/
		       advertisements are those advertisements that
		       appear in the magazine because an outside
		       agency (a company, a theater, a publisher) has
		       paid for it to appear.
      - Location and Description :: Ads may appear anywhere, but most
	   often they appear in groups at the end of a magazine
	   issue.  They are often boxed.  They may be any size --
	   from a few inches to a partial or full page.

*** Zone Types to Ignore
    - Rules :: Do not zone horizontal and vertical rules -- the
	       (usually thin) lines used to separate regions of the page.
    - Ornamental Artwork :: Typographer's ornaments, ornamental
	 borders, anonymous graphics at the heads of sections.
	 (Consult title-specific addenda.)
** VerifyPageHierarchy (VPH)
   Add the following metadata, if available:

   - Volume Number
   - Issue Number
   - Issue Date
   - Publication Title

   This information will always be supplied by Princeton in the form
   of /preliminary issue-level MODS/ (see below).
