doc/reference.html

<div id="outline-container-6-4-1-2" class="outline-5">
<h5 id="sec-6-4-1-2"><span class="section-number-5">6.4.1.2</span> Editorial Content Container</h5>
<div class="outline-text-5" id="text-6-4-1-2">


</div>

<div id="outline-container-6-4-1-2-1" class="outline-6">
<h6 id="sec-6-4-1-2-1"><span class="section-number-6">6.4.1.2.1</span> Head</h6>
<div class="outline-text-6" id="text-6-4-1-2-1">

<dl>
<dt>Zone Name</dt><dd>Headline
</dd>
<dt>Description</dt><dd>A phrase at the beginning of a magazine
                       section, usually indicating the subject of the
                       following copy text.
</dd>
<dt>Location and Features</dt><dd>A newspaper <i>headline</i> is a <i>kind</i> of
           head; magazines usually have many other kinds of
           heads. <i>Heads</i> are usually recognizable by weight, size, or
           position of type: they are often heavier or larger, and are
           often (though not always) centered above one or more
           columns of type with space before and after.  A single
           magazine constituent may have several <i>levels</i> of heading:
           most have a top-level head (usually the title of the
           piece), to distinguish the piece as a whole from other
           magazine content, but many have typographically distinct
           <i>subheads</i> that subdivide the constituent itself into
           sections (see <i>Subhead</i> below).
</dd>
</dl>

</div>

</div>

<div id="outline-container-6-4-1-2-2" class="outline-6">
<h6 id="sec-6-4-1-2-2"><span class="section-number-6">6.4.1.2.2</span> Subhead</h6>
<div class="outline-text-6" id="text-6-4-1-2-2">

<dl>
<dt>Zone Name</dt><dd>Subheadline
</dd>
<dt>Description</dt><dd>A phrase demarcating a part of a constituent
                       or section of a magazine. A constituent or
                       section cannot have a subhead without a head.
</dd>
<dt>Location and Features</dt><dd>Subheads break up a chunk (a
           constituent, a section) into smaller units.  Subheads are
           usually distinguished typographically from heads by smaller
           type sizes and different spacing.
</dd>
</dl>

</div>

</div>

<div id="outline-container-6-4-1-2-3" class="outline-6">
<h6 id="sec-6-4-1-2-3"><span class="section-number-6">6.4.1.2.3</span> Article Copy</h6>
<div class="outline-text-6" id="text-6-4-1-2-3">

<dl>
<dt>Zone Name</dt><dd>Textblock
</dd>
<dt>Description</dt><dd>A block of body text. <i>Article Copy</i> is a
                       misnomer; <i>Editorial Copy</i> would be better.
                       It is usually, though not always, divided into
                       paragraphs; Blue Mountain zones tables and
                       lists as Article Copy.
</dd>
<dt>Location and Features</dt><dd>May be preceded by a Head (though a
           Head is not mandatory).  May be subdivided into smaller
           units through the use of rules and/or subheads.
</dd>
<dt>Tagging Notes</dt><dd>
<ul>
<li>Blue Mountain zones tables and lists as
          Article Copy.
</li>
<li>Blue Mountain also tags tables of contents as Article Copy.
</li>
</ul>

</dd>
</dl>

</div>

</div>

<div id="outline-container-6-4-1-2-4" class="outline-6">
<h6 id="sec-6-4-1-2-4"><span class="section-number-6">6.4.1.2.4</span> Byline</h6>
<div class="outline-text-6" id="text-6-4-1-2-4">

<dl>
<dt>Zone Name</dt><dd>Author
</dd>
<dt>Description</dt><dd>A zone containing one or more regions
                       associated with the writer of an article,
                       musical composition, letter, or other editorial
                       content: usually the writer's name, but
                       sometimes also the writer's position or other
                       biographical information.
</dd>
<dt>Location and Features</dt><dd>The byline is usually located either
           at the beginning of the content, between the head and the
           first zone of copy, or at the end of the copy text.
           Bylines can be difficult to distinguish.  They are
           sometimes set in italic or boldfaced type or in all-caps;
           they are sometimes a full name (first name, last name),
           sometimes a last name only, or one or two initials, or a
           name with a term of address in the language of the
           magazine (Mr., Dr., Madame, M., Herr, etc.)
</dd>
</dl>

</div>

</div>

<div id="outline-container-6-4-1-2-5" class="outline-6">
<h6 id="sec-6-4-1-2-5"><span class="section-number-6">6.4.1.2.5</span> Art</h6>
<div class="outline-text-6" id="text-6-4-1-2-5">

<dl>
<dt>Zone Name</dt><dd>Illustration
</dd>
<dt>Description</dt><dd>A drawing, photograph, a reproduction of a
                       print or a painting; a graphic poem.
                       Sometimes has a caption above, below, or to
                       the side of it.
</dd>
<dt>Location and Features</dt><dd>May occur anywhere; may occupy a
           single column, several columns, or be set outside the
           column grid of the page; or may take up a full page or a
           multi-page spread.

<p>
           The Avant-garde saw the invention of "graphical text" like
           concrete poetry, shape poetry, Futurist "words in
           liberty," etc.  While these are in fact hybrid forms, both
           graphic and text, Blue Mountain zones them as art.                
</p></dd>
</dl>

</div>

</div>

<div id="outline-container-6-4-1-2-6" class="outline-6">
<h6 id="sec-6-4-1-2-6"><span class="section-number-6">6.4.1.2.6</span> Caption</h6>
<div class="outline-text-6" id="text-6-4-1-2-6">

<dl>
<dt>Zone Name</dt><dd>Caption
</dd>
<dt>Description</dt><dd>One or more textual blocks associated with an
                       Illustration.
</dd>
<dt>Location and Features</dt><dd>Captions may appear above, below, or
           (occasionally) to the side of the illustration to which
           they belong.  They may contain several lines and/or zones
           of information: the identity of the subject; the name of
           the artist/photographer/poet; the title of the artwork
           being printed or reproduced.  Consult title-specific
           addenda.
</dd>
</dl>

</div>

</div>

<div id="outline-container-6-4-1-2-7" class="outline-6">
<h6 id="sec-6-4-1-2-7"><span class="section-number-6">6.4.1.2.7</span> Music</h6>
<div class="outline-text-6" id="text-6-4-1-2-7">

<dl>
<dt>Zone Name</dt><dd>Music
</dd>
<dt>Description</dt><dd>A zone of musical notation (in Western music,
                       most often one or more staves, perhaps with
                       clefs and key signatures, and notes; sometimes
                       heavily annotated with text.)
</dd>
<dt>Location and Features</dt><dd>Size and extent varies.  May be a
           small musical example occupying a few lines of a column,
           or a multi-page musical compostion.  Some zones of music
           may be accompanied by heads or captions.
</dd>
</dl>

</div>

</div>

<div id="outline-container-6-4-1-2-8" class="outline-6">
<h6 id="sec-6-4-1-2-8"><span class="section-number-6">6.4.1.2.8</span> Footnote</h6>
<div class="outline-text-6" id="text-6-4-1-2-8">

<dl>
<dt>Zone Name</dt><dd>Footnote
</dd>
<dt>Description</dt><dd>A zone of type, usually at the foot of the
                       page, serving as an annotation to some text on
                       the page.
</dd>
<dt>NOTE</dt><dd>This zone is under consideration.
</dd>
</dl>

</div>
</div>

</div>

<div id="outline-container-6-4-1-3" class="outline-5">
<h5 id="sec-6-4-1-3"><span class="section-number-5">6.4.1.3</span> SponsoredAd Container</h5>
<div class="outline-text-5" id="text-6-4-1-3">


</div>

<div id="outline-container-6-4-1-3-1" class="outline-6">
<h6 id="sec-6-4-1-3-1"><span class="section-number-6">6.4.1.3.1</span> Sponsored Ad (Advertisement Copy)</h6>
<div class="outline-text-6" id="text-6-4-1-3-1">

<dl>
<dt>Zone Name</dt><dd>Advertisement
</dd>
<dt>Description</dt><dd>An often-heterogenous zone of mixed
                       typography, graphics, and layout whose
                       function is to draw attention to some event,
                       product, or service.  <i>Sponsored</i>
                       advertisements are those advertisements that
                       appear in the magazine because an outside
                       agency (a company, a theater, a publisher) has
                       paid for it to appear.
</dd>
<dt>Location and Description</dt><dd>Ads may appear anywhere, but most
           often they appear in groups at the end of a magazine
           issue.  They are often boxed.  They may be any size --
           from a few inches to a partial or full page.
</dd>
</dl>


</div>
</div>
</div>

</div>

<div id="outline-container-6-4-2" class="outline-4">
<h4 id="sec-6-4-2"><span class="section-number-4">6.4.2</span> Zone Types to Ignore</h4>
<div class="outline-text-4" id="text-6-4-2">

<dl>
<dt>Rules</dt><dd>Do not zone horizontal and vertical rules &ndash; the
               (usually thin) lines used to separate regions of the page.
</dd>
<dt>Ornamental Artwork</dt><dd>Typographer's ornaments, ornamental
         borders, anonymous graphics at the heads of sections.
         (Consult title-specific addenda.)
</dd>
</dl>

</div>
</div>

</div>

<div id="outline-container-6-5" class="outline-3">
<h3 id="sec-6-5"><span class="section-number-3">6.5</span> VerifyPageHierarchy (VPH)</h3>
<div class="outline-text-3" id="text-6-5">

<p>   Add the following metadata, if available:
</p>
<ul>
<li>Volume Number
</li>
<li>Issue Number
</li>
<li>Issue Date
</li>
<li>Publication Title
</li>
</ul>


<p>
   This information will always be supplied by Princeton in the form
   of <i>preliminary issue-level MODS</i> (see below).
</p></div>

</div>
