doc/reference.org
** VerifyHiearchy (VH)
   Identify all components as either PubInfo, EditorialContent, or
   SponsoredAds.

   - Classify all zones in PubInfo or Editorial Content containers
     manually.  (All ad zones will be grouped automatically into
     SponsoredAd containers.)
   - Composition of magazine constituents is highly variable.  Some
     general guidelines:
     - A constituent very often is composed of a head, a byline, and
       one or more sections of body copy.  Look for a typographically
       distinct head to begin the constituent; a byline will
       sometimes follow immediately after the head, but it may also
       appear at the very end.
     - Use the head as the constituent's title.
     - Many of the Blue Mountain titles are art magazines; the illustrations
       often have heads, captions, and bylines. If a head is present,
       treat it as the title.
** OCR Correction
   - Correct all heads, subheads, bylines, and captions.
   - Delete empty zones.
   - Ignore hand-written text blocks.
* Footnotes
[fn:1] This convention has been adopted to suport the naming conventions
in Veridian, which prohibit the use of integers in identifiers.
