doc/reference.html

<div id="outline-container-6-6" class="outline-3">
<h3 id="sec-6-6"><span class="section-number-3">6.6</span> VerifyHiearchy (VH)</h3>
<div class="outline-text-3" id="text-6-6">

<p>   Identify all components as either PubInfo, EditorialContent, or
   SponsoredAds.
</p>
<ul>
<li>Classify all zones in PubInfo or Editorial Content containers
     manually.  (All ad zones will be grouped automatically into
     SponsoredAd containers.)
</li>
<li>Composition of magazine constituents is highly variable.  Some
     general guidelines:
<ul>
<li>A constituent very often is composed of a head, a byline, and
       one or more sections of body copy.  Look for a typographically
       distinct head to begin the constituent; a byline will
       sometimes follow immediately after the head, but it may also
       appear at the very end.
</li>
<li>Use the head as the constituent's title.
</li>
<li>Many of the Blue Mountain titles are art magazines; the illustrations
       often have heads, captions, and bylines. If a head is present,
       treat it as the title.
</li>
</ul>

</li>
</ul>

</div>

</div>

<div id="outline-container-6-7" class="outline-3">
<h3 id="sec-6-7"><span class="section-number-3">6.7</span> OCR Correction</h3>
<div class="outline-text-3" id="text-6-7">

<ul>
<li>Correct all heads, subheads, bylines, and captions.
</li>
<li>Delete empty zones.
</li>
<li>Ignore hand-written text blocks.
</li>
</ul>


<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">
<p class="footnote"><sup><a class="footnum" name="fn-.1" href="#fnr-.1">1</a></sup> This convention has been adopted to suport the naming conventions
in Veridian, which prohibit the use of integers in identifiers.
</p>



</div>
</div>
</div>

</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2013-01-22 Tue</p>
<p class="author">Author: Cliff Wulfman</p>
<p class="creator"><a href="http://orgmode.org">Org</a> version 7.9.2 with <a href="http://www.gnu.org/software/emacs/">Emacs</a> version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
